const data = [
    [1, "Όλυμπος - Λάρισα, Πιερία", "Μύτικας", 2.918],
    [2, "Σμόλικας - Ιωάννινα", "Γέρος", "2.637"],
    [3, "Βόρας (Καϊμακτσαλάν) - Πέλλα", "Προφήτης Ηλίας", "2.524"],
    [4, "Γράμμος - Ιωάννινα, Καστοριά", "Τσούκα Πέτσικ", "2.520"],
    [5, "Γκιώνα (Ασέληνον Όρος) - Φωκίδα", "Πυραμίδα", "2.510"],
    [6, "Τύμφη - Ιωάννινα", "Γκαμήλα", "2.497"],
    [7, "Βαρδούσια (Κόραξ) - Βοιωτία, Φθιώτιδα", "Κόρακας", "2.495"],
    [8, "Παρνασσός - Φωκίδα", "Λιάκουρα", "2.457"],
    [9, "Ψηλορείτης (Ίδη) - Ηράκλειο, Ρέθυμνο", "Τίμιος Σταυρός", "2.456"],
    [10, "Λευκά Όρη (Μαδάρες) - Χανιά", "Πάχνες", "2.454"],
    [11, "Κακαρδίτσα - Ιωάννινα, Τρίκαλα, Άρτα", "-", "2.429"],
    [12, "Ταΰγετος - Λακωνία, Μεσσηνία", "Προφήτης Ηλίας", "2.407"],
    [13, "Τζουμέρκα (Αθαμανικά Όρη) - Άρτα", "Καταφίδι", "2.393"],
    [14, "Ζήρεια (Κυλλήνη) - Κορινθία", "Μεγάλη Ζήρεια", "2.376"],
[15, "Χελμός (Αροάνια) - Αχαΐα", "Ψηλή Κορυφή", "2.355"],
[16, "Βαρνούντας (Περιστέρι, Βαρνούς) - Φλώρινα", "Δεσποτικό (Γκάρβανι)", "2.334"],
[17, "Τυμφρηστός (Βελούχι) - Ευρυτανία, Φθιώτιδα", "Ψηλή Κορυφή", "2.315"],
[18, "Καταραχιάς - Ιωάννινα", "-", "2.299"],
[19, "Περιστέρι (Λάκμος) - Ιωάννινα, Τρίκαλα", "Τσούκα Ρέλλα", "2.294"],
[20, "Βασιλίτσα - Γρεβενά, Ιωάννινα", "-", "2.248"],
[21, "Φαλακρό (Μποζ Νταγ) - Δράμα", "Προφήτης Ηλίας", "2.232"],
[22, "Ερύμανθος - Αχαΐα", "Ωλενός (Ωλονός)", "2.224"],
[23, "Όρβηλος (Αλή Μπουτούς) - Σέρρες, Δράμα", "Τσολιάς", "2.212"],
[24, "Δούσκο (Ντεμέρτσκα, Μερόπη) - Ιωάννινα", "-", "2.208"],
[25, "Τριγγία (Τριγία) - Τρίκαλα", "Στο Λάκκο", "2.204"],
[26, "Πιέρια Όρη - Κοζάνη, Πιερία", "Φλάμπουρο", "2.188"],
[27, "Καράβα (Σχιζοκάραβο) (Άγραφα) - Καρδίτσα", "-", "2.184"],
[28, "Αυγό (Λύγκος) - Γρεβενά, Ιωάννινα", "Αυγό", "2.177"],
[29, "Τζένα (Ζιώνα) - Πέλλα", "Πόρτα", "2.171"],
[30, "Ντεληδήμι (Αυγό, Τσουρνάτα) (Άγραφα) - Καρδίτσα, Ευρυτανία", "-", "2.163"],
[31, "Κακοπλεύρι (Μηλιά) - Γρεβενά, Ιωάννινα", "-", "2.159"],
[32, "Φλέγγα (Μαυροβούνι) - Γρεβενά, Ιωάννινα", "-", "2.157"],
[33, "Βουτσικάκι (Γκαβέλ) (Άγραφα) - Καρδίτσα", "-", "2.152"],
[34, "Οίτη (Καταβόθρα) - Φθιώτιδα, Φωκίδα", "Πύργος", "2.151"],
[35, "Κρυάκουρας (Κριάκουρας) - Άρτα", "-", "2.150"],
[36, "Πίνοβο - Πέλλα", "Κορφούλα", "2.156"],
[37, "Αυγό - Τρίκαλα", "-", "2.148"],
[38, "Δίκτη (Λασιθιώτικα Βουνά) - Ηράκλειο, Λασίθι", "Σπαθί, Δίχτης", "2.148"],
[39, "Μαδερό - Αχαΐα, Κορινθία", "-", "2.143"],                                          
[40, "Χαλικόβουνο (Νεράιδα, Μπούτζα) - Τρίκαλα", "Μπριτσιάσα", "2.135"],
[41, "Φτέρη (Πτέρη) (Άγραφα) - Ευρυτανία", "-", "2.127"],
[42, "Βίτσι (Βέρνο) - Καστοριά, Φλώρινα", "-", "2.128"],
[43, "Βολακιάς - Χανιά", "-", "2.116"],
[44, "Ντουρντουβάνα (Πεντέλεια) - Αχαΐα, Κορινθία", "-", "2.109"],
[45, "Σινιάτσικο (Άσκιο) - Κοζάνη", "-", "2.107"],
[46, "Καλιακούδα - Ευρυτανία", "-", "2.099"],
[47, "Φούρκα (Σελιό, Μουρτζιά) - Άρτα", "-", "2.064"],
[48, "Βέρμιο - Ημαθία, Κοζάνη", "Χαμίτης", "2.058"],
[49, "Λιάκουρα (Άγραφα) - Ευρυτανία", "-", "2.043"],
[50, "Καμενίκ - Ιωάννινα", "-", "2.042"],
[51, "Σβόνι (Μαράθια) (Άγραφα) - Ευρυτανία", "-", "2.042"],
[52, "Χατζή - Τρίκαλα", "-", "2.038"],
[53, "Άθως (Άγιον Όρος) - Χαλκιδική", "-", "2.033"],
[54, "Μπαλντενήσι - Ευρυτανία", "-", "2.030"],
[55, "Μπέλες (Μπέλλες, Κερκίνη) - Σέρρες", "-", "2.030"],
[56, "Τραπεζίτσα - Ιωάννινα", "-", "2.024"],
[57, "Δοκίμι Παχτουρίου (Τσιγκάρι, Τσουγκότι) - Τρίκαλα", "-", "2.020"],
[58, "Μπορλέρο (Μπουρλέρος) (Άγραφα) - Ευρυτανία, Καρδίτσα", "-", "2.017"],
[59, "Φλυτζάνι (Καλύβια, Νιάλα) - Ευρυτανία, Καρδίτσα", "-", "2.017"],
[60, "Πέντε Πύργοι (Άγραφα) - Καρδίτσα", "-", "2.004"],
[61, "Καταραχιάς (Άγραφα) - Καρδίτσα", "-", "2.002"],
[62, "Καλλιφώνιο - Αχαΐα", "-", "1.997"],
[63, "Τσούκα Ρόσσα (Κοκκινόραχη) - Ιωάννινα", "-", "1.985"],
[64, "Μαίναλο - Αρκαδία", "Οστρακίνα", "1.981"],
[65, "Κίσσαβος (Όσσα) - Λάρισα", "-", "1.978"],
[66, "Δοκίμι (Δοκίμι Χαλικίου) - Ιωάννινα, Τρίκαλα", "-", "1.974"],
[67, "Χελιδόνα (Χελιδώνα) - Ευρυτανία", "-", "1.974"],
[68, "Τόμαρος (Ολύτσικας) - Ιωάννινα", "-", "1.971"],
[69, "Πυροστιά (Μπάλνες) - Γρεβενά", "-", "1.966"],
[70, "Μενοίκιο (Σμιγίνιτσα) - Δράμα, Σέρρες", "Μαυρομάτα", "1.963"],
[71, "Παγγαίο - Καβάλα, Σέρρες", "Μάτι", "1.956"],
[72, "Φρακτό (Νταλιμπόσκα) - Δράμα", "-", "1.950"],
[73, "Κόψι (Άγραφα) - Ευρυτανία", "-", "1.940"],
[74, "Ολίγυρτος - Αργολίδα, Αρκαδία, Κορινθία", "Σκίπιζα", "1.935"],
[75, "Πάρνωνας (Μαλεβός) - Αρκαδία, Λακωνία", "Μεγάλη Τούρλα", "1.935"],
[76, "Παπαδημήτρης (Άγραφα) - Καρδίτσα", "-", "1.931"],
[77, "Παναχαϊκό Όρος (Βοϊδιάς) - Αχαΐα", "Πύργος του Παλαβού", "1.928"],
[78, "Οξυά - Ευρυτανία, Φθιώτιδα, Φωκίδα", "Σαράνταινα", "1.923"],
[79, "Παναιτωλικό - Αιτωλοακαρνανία, Ευρυτανία", "Κατελάνος", "1.922"],
[80, "Φλάμπουρο (Καραβούνι, Καρβούνι) - Ιωάννινα", "-", "1.914"],
[81, "Όρη Λιδωρικίου - Φωκίδα", "-", "1.911"],
[82, "Κοκκινάρι (Άγιος Ηλίας) - Φωκίδα", "-", "1.909"],
[83, "Κόζιακας (Κερκέτιον Όρος) - Τρίκαλα", "Αστραπή", "1.900"],
[84, "Γαλάτσι (Ασήμι) (Άγραφα) - Καρδίτσα", "-", "1.894"],
[85, "Ταμπούρι (Οχυρό) - Ιωάννινα", "-", "1.876"],
[86, "Βούρινος (Μπούρινος, Ντρισινίκος) - Γρεβενά, Κοζάνη", "-", "1.863"],
[87, "Καραβούλα (Άγραφα) - Καρδίτσα, Τρίκαλα", "-", "1.862"],
[88, "Προσηλιακό (Προσηλιάκι) - Ευρυτανία", "-", "1.862"],
[89, "Κίρκουρη - Γρεβενά, Καστοριά", "-", "1.860"],
[90, "Αετοί - Άρτα", "-", "1.852"],
[91, "Λαϊλιάς (Όρη Βροντούς, Ανάληψη, Προφήτης Ηλίας) - Σέρρες", "-", "1.849"],
[92, "Μοράβα (Κυνηγός) - Τρίκαλα", "-", "1.845"],
[93, "Τούρλα (Λιβαδάκι) - Αχαΐα, Κορινθία", "-", "1.836"],
[94, "Σουφλί (Μπούτσος) - Καρδίτσα", "-", "1.835"],
[95, "Τίταρος (Μικρό Φλάμπουρο) - Κοζάνη, Λάρισα", "Μικρό Φλάμπουρο", "1.834"],
[96, "Τρεις Γυναίκες - Αχαΐα", "-", "1.834"],
[97, "Όρη Ναυπακτίας (Κοκκινιάς) - Αιτωλοακαρνανία", "-", "1.832"],
[98, "Χαϊντού (Ερύμανθος, Γυφτόκαστρο) - Δράμα, Ξάνθη", "Κούλα", "1.828"],
[99, "Κουκουρούντζος - Ιωάννινα", "Νεράιδα", "1.827"],
[100, "Ελατιά (Καράντερε) - Δράμα", "Τσάκαλος", "1.826"],
[101, "Ζυγός (Άσπρα Λιθάρια, Ταμπούρια Θανασάκη, Βούλγαρης) - Ιωάννινα, Τρίκαλα", "-", "1.822"],
[102, "Τριανταφυλλιά - Αιτωλοακαρνανία, Ευρυτανία", "-", "1.817"],
[103, "Σαϊτάς (Όρυξις) - Κορινθία, Αρκαδία, Αχαΐα", "-", "1.811"],
[104, "Μιτσικέλι - Ιωάννινα", "-", "1.810"],
[105, "Τραχύ (Καρούμπαλο) - Αργολίδα, Αρκαδία", "-", "1.808"],
[106, "Μουργκάνα (Όρη Τσαμαντά, Μαυροβούνι) - Θεσπρωτία, Ιωάννινα", "-", "1.806"],
[107, "Πύργος - Ευρυτανία, Καρδίτσα", "-", "1.804"],
[108, "Βόιο - Καστοριά, Κοζάνη", "Παλιοκριμίνι", "1.803"],
[109, "Πέρδικα (Σκούρτζα) - Γρεβενά", "-", "1.799"],
[110, "Κέδρος (Τρία Σύνορα) - Τρίκαλα", "-", "1.796"],
[111, "Κοκκινόλακκα (Κοκκινόλακκος) - Άρτα", "-", "1.796"],
[112, "Μπούτσι (Μάλι Μάδι) - Καστοριά, Φλώρινα", "Ανεμοδαρμένη", "1.795"],
[113, "Λάμπεια - Ηλεία", "Ανάληψη", "1.794"],
[114, "Μαρμάτι (Νεραϊδόρραχη) - Αχαΐα", "-", "1.794"],
[115, "Όρη Βάλτου (Γάβροβο) - Αιτωλοακαρνανία, Άρτα", "-", "1.781"],
[116, "Κατούνα (Καυκιά, Τούρλα) - Καρδίτσα, Τρίκαλα", "-", "1.781"],
[117, "Κλωκός (Φτέρη, Παναγία) - Αχαΐα", "-", "1.778"],
[118, "Σκίαθις (Καταφύγιο, Ζάρα) - Αργολίδα, Αρκαδία", "-", "1.778"],
[119, "Πλατανάκι (Πλατάνι, Ζάρα) - Αιτωλοακαρνανία, Ευρυτανία", "-", "1.777"],
[120, "Κέδρος (Ανάληψη) - Ρέθυμνο", "-", "1.776"],
[121, "Προφήτης Ηλίας (Βερούσια) - Καρδίτσα", "-", "1.775"],
[122, "Αρτεμίσιο - Αργολίδα, Αρκαδία", "Μαλεβός", "1.772"],
[123, "Άγιος Παύλος (Σιβρί Τεπέ, Γρανίτης) - Δράμα", "-", "1.769"],
[124, "Φρούσια Όρη (Κόκκινα Στεφάνια) - Άρτα", "-", "1.759"],
[125, "Μαύρο Όρος (Μαυρονόρος, Προφήτης Ηλίας) - Κορινθία", "-", "1.756"],
[126, "Βέλια (Μέλλια) - Κοζάνη", "-", "1.754"],
[127, "Γερόντιο Όρος - Κορινθία", "-", "1.754"],
[128, "Καυκί (Άγραφα) - Ευρυτανία", "-", "1.751"],
[129, "Τρικλάριο (Βάρμπα, Σφήκα, Βάρμπα) - Φλώρινα", "-", "1.742"],
[130, "Ελικώνας - Βοιωτία", "Παλιοβούνα", "1.748"],
[131, "Δίρφυς (Δίρφη) - Εύβοια", "Δέλφι", "1.743"],
[132, "Τσεκούρα - Αιτωλοακαρνανία", "-", "1.733"],
[133, "Στάμνα (Τζούρα, Κουσλάρι, Κιτρινοβούνι, Ψήλωμα) - Δράμα", "-", "1.739"],
[134, "Φουρκούλα (Κουκουρούντζος) (Άγραφα) - Ευρυτανία", "-", "1.726"],
[135, "Όθρυς - Μαγνησία, Φθιώτιδα", "Γκιούζι", "1.726"],
[136, "Αλογοβούνι - Ευρυτανία, Φθιώτιδα", "-", "1.725"],
[137, "Μαυροπούλι - Τρίκαλα", "-", "1.721"],
[138, "Κοκκάλια - Ευρυτανία, Φθιώτιδα", "-", "1.716"],
[139, "Τσακαλάκι - Αιτωλοακαρνανία", "-", "1.710"],
[140, "Μουρίκι - Κοζάνη", "-", "1.708"],
[141, "Άννινος - Αιτωλοακαρνανία, Ευρυτανία", "-", "1.702"],
[142, "Αρδίνης - Αιτωλοακαρνανία", "-", "1.699"],
[143, "Περδικούλα - Κορινθία", "-", "1.693"],
[144, "Κερασοβούνι - Αιτωλοακαρνανία, Φωκίδα", "-", "1.694"],
[145, "Μάρτσα - Ευρυτανία, Καρδίτσα", "-", "1.688"],
[146, "Βουλγάρα - Λάρισα, Πιερία", "-", "1.683"],
[147, "Πετρόκαμπος - Ιωάννινα, Τρίκαλα", "-", "1.683"],
[148, "Βλαχοβούνι - Φωκίδα", "-", "1.670"],
[149, "Καθαρό (Τσίβι, Αλόιδα) - Λασίθι", "-", "1.663"],
[150, "Μακρύκαμπος (Τσούκα, Μπόζοβο) - Ιωάννινα", "-", "1.661"],
[151, "Όρη Παραμυθιάς (Γορίλλας, Γκορίλας, Κορύλλας) - Θεσπρωτία", "-", "1.658"],
[152, "Ξεροβούνι (Ξηροβούνι) - Ιωάννινα, Πρέβεζα, Άρτα", "-", "1.655"],
[153, "Βουλγάρα (Άγραφα) - Ευρυτανία, Καρδίτσα", "-", "1.653"],
[154, "Ξεροβούνι (Βλαχοβούνι) - Αιτωλοακαρνανία, Φωκίδα", "-", "1.650"],
[155, "Πάικο (Φιδωτά) - Κιλκίς, Πέλλα", "-", "1.649"],
[156, "Λύρκειο (Φραγκοκούκουρα) - Αργολίδα, Αρκαδία", "Λεσοβίτη", "1.647"],
[157, "Δυτικό Μαίναλο - Αρκαδία", "-", "1.646"],
[158, "Χιονίστρα (Σπάτα) - Θεσπρωτία", "-", "1.643"],
[159, "Χτενιάς (Κτενιάς, Κρύον Όρος) - Αργολίδα, Αρκαδία", "-", "1.635"],
[160, "Άγιο Πνεύμα - Δράμα", "-", "1.631"],
[161, "Αίνος - Κεφαλληνία", "Μέγας Σωρός", "1.627"],
[162, "Αετόπετρα - Φωκίδα", "-", "1.624"],
[163, "Πήλιο - Μαγνησία", "(Πουριανός Σταυρός)", "1.624"],
[164, "Κοζάκος - Ιωάννινα", "-", "1.622"],
[165, "Στούρος (Στούρου, Σμίντελα) - Ιωάννινα", "-", "1.622"],
[166, "Φαρμακάς (Αβυζές) - Αργολίδα", "-", "1.615"],
[167, "Μπαρμπάς - Αχαΐα", "-", "1.613"],
[168, "Όρη Σουλίου (Βριτζάχα ή Αλισσός) - Θεσπρωτία, Ιωάννινα", "-", "1.613"],
[169, "Σάος - Σαμοθράκη", "Φεγγάρι", "1.611"],
[170, "Καμβούνια Όρη (Βουνάσα) - Γρεβενά, Κοζάνη", "Πρίονος", "1.611"],
[171, "Βουνά Μετσόβου (Καλιγωμένο Αλώνι) - Ιωάννινα", "-", "1.593"],
[172, "Πυργούλια (Φονιάς) - Αιτωλοακαρνανία, Ευρυτανία", "-", "1.592"],
[173, "Μεγάλα Όντρια (Όδρυα) - Καστοριά, Κοζάνη", "-", "1.590"],
[174, "Αλεβίτσα - Καστοριά", "-", "1.589"],
[175, "Ακαρνανικά Όρη (Όρη Ξηρόμερου) - Αιτωλοακαρνανία", "Ψηλή Κορυφή", "1.589"],
[176, "Σκεπαστό (Όρος Κερύνεια) - Αχαΐα", "-", "1.588"],
[177, "Σαρακηνός - Ηράκλειο, Λασίθι", "-", "1.586"],
[178, "Κάτω Όλυμπος (Μεταμόρφωση) - Λάρισα, Πιερία", "-", "1.585"],
[179, "Τσούμα - Ευρυτανία", "-", "1.583"],
[180, "Μπούμιστος (Ταμπούρια) - Αιτωλοακαρνανία", "-", "1.577"],
[181, "Βουνά Γρεβενιτίου (Κερά Άννα, Κεράνα) - Ιωάννινα", "-", "1.574"],
[182, "Ξεροβούνι - Αιτωλοακαρνανία", "-", "1.571"],
[183, "Πύργος - Ευρυτανία", "-", "1.569"],
[184, "Βελιάς (Βελά) - Αχαΐα", "-", "1.566"],
    [185, "Χάσια - Τρίκαλα", "Μύτικας (Κράτσοβο)", "1.565"],
    [186, "Καρφοπεταλιάς - Αιτωλοακαρνανία", "-", "1.563"],
    [187, "Πινακάκια - Ευρυτανία", "-", "1.562"],
    [188, "Μακρυνόρος - Αιτωλοακαρνανία (Ναυπακτία)", "-", "1.561"],
    [189, "Όρος Κίρφις (Επάνω Καρβούνι) - Βοιωτία", "Ξεροβούνι", "1.560"],
    [190, "Σελένα - Ηράκλειο, Λασίθι", "-", "1.558"],
    [191, "Μεγάλη Λούτσα (Καψάλα) - Βοιωτία", "-", "1.553"],
    [192, "Τρίκορφο (Όρη Λιδωρικίου) - Φωκίδα", "-", "1.550"],
    [193, "Γεράνεια - Ξάνθη", "-", "1.548"],
    [194, "Σκαφίδα - Καρδίτσα", "-", "1.545"],
    [195, "Μυρμιτζάλα (Μυρμηγκιά) - Καρδίτσα", "-", "1.542"],
    [196, "Τάλιαρος (Θανασούλας) - Γρεβενά, Καστοριά", "-", "1.538"],
    [197, "Κουμπί - Ευρυτανία", "-", "1.534"],
    [198, "Λιάγκουνα (Κοπάνες) - Γρεβενά", "-", "1.526"],
    [199, "Αμμουτσέλος (Αμοντζέλος) - Τρίκαλα", "-", "1.526"],
    [200, "Ζέμπη - Αχαΐα", "-", "1.526"],
    [201, "Ζαγαράς (Μοτσάρα, Ζάστανι) - Βοιωτία", "-", "1.525"],
    [202, "Ποτίστρες (Κανάλα, Καλάνα) - Αιτωλοακαρνανία", "-", "1.520"],
    [203, "Λυκομνήματα - Ευρυτανία, Φθιώτιδα", "-", "1.519"],
    [204, "Αγκαθές (Χορεύτρες) - Χανιά", "-", "1.512"],
    [205, "Τσούμα Ανιάδας - Ευρυτανία", "-", "1.508"],
    [206, "Ίταμος (Τσιούκα) (Άγραφα) - Καρδίτσα", "-", "1.504"],
    [207, "Καζάνι Αποσκέπου - Καστοριά", "Μπίκοβικ", "1.503"],
    [208, "Ψηλό Βουνό - Αρκαδία", "-", "1.503"],
    [209, "Ξεροβούνι - Αιτωλοακαρνανία, Φωκίδα", "-", "1.502"],
    [210, "Προφήτης Ηλίας\u200B - Αχαΐα", "-", "1.493"],
    [211, "Νεραϊδοβούνι - Ευρυτανία", "-", "1.492"],
    [212, "Τούρλα - Αργολίδα, Αρκαδία", "-", "1.492"],
    [213, "Πλατιά Κορφή (Ανεφαλάκος) - Λασίθι", "-", "1.486"],
    [214, "Κολλιέδες (Ντρέβιζα) - Βοιωτία", "-", "1.486"],
    [215, "Παπίκιο (Καρλίκ Νταγ) - Ροδόπη", "-", "1.483"],
    [216, "Θρυπτή (Αφέντης Σταυρωμένος) - Λασίθι", "-", "1.476"],
    [217, "Όρλιακας (Σπίλος) - Γρεβενά", "Καντήλα", "1.475"],
    [218, "Ανάληψη (Τσούκα) - Ευρυτανία", "-", "1.473"],
    [219, "Αρχοντική (Αμάρμπεης) - Κοζάνη, Λάρισα", "-", "1.473"],
    [220, "Ριγάνι (Ορίγανον) - Αιτωλοακαρνανία", "Προφήτης Ηλίας", "1.469"],
    [221, "Σκιαδοβούνι - Αχαΐα, Ηλεία", "-", "1.466"],
    [222, "Γουλινάς - Φθιώτιδα", "-", "1.459"],
[223, "Ρούσκιο - Αχαΐα", "Άγιος Γεώργιος", "1.457"],
[224, "Βροντερό (Τσουτσούλι) - Φλώρινα", "-", "1.455"],
[225, "Τουρλί (Τρουλλί) - Χανιά", "-", "1.454"],
[226, "Ξεροβούνι - Εύβοια", "Ψηλή Κορυφή", "1.453"],
[227, "Όρη Μελίβοιας - Ξάνθη", "Ντόμπριβαρ", "1.449"],
[228, "Αφροδίσιο - Αρκαδία, Αχαΐα", "Μαύρη Βρύση", "1.446"],
[229, "Καπροβούνι (Άγραφα) - Καρδίτσα", "-", "1.446"],
[230, "Αργυρόκαστρο - Αρκαδία", "Κάστρο", "1.446"],
[231, "Ερμάριο - Ξάνθη", "-", "1.441"],
[232, "Κόμπολος (Κόμπιλο) - Ευρυτανία", "Βίγλα", "1.440"],
[233, "Κερκετεύς (Κέρκης) - Σάμος", "-", "1.433"],
[234, "Προφήτης Ηλίας (Άγιος Ηλίας) - Τρίκαλα", "-", "1.431"],
[235, "Τάρταρης - Αχαΐα", "-", "1.425"],
[236, "Καλογκέριτ (Λόκβατ) - Φλώρινα", "Πυραμίδα 4", "1.427"],
[237, "Αντιχάσια (Ράχη Τσέτσιλα, Μαμαλή) - Λάρισα, Τρίκαλα", "Οξυά", "1.424"],
[238, "Λύκαιον Όρος - Αρκαδία, Μεσσηνία", "Διαφόρτι ή Στεφάνι", "1.420"],
[239, "Αλωνάκι - Αιτωλοακαρνανία", "-", "1.419"],
[240, "Βροαστέργια (Βροατσέργια) - Φλώρινα", "Πυραμίδα 12", "1.414"],
[241, "Πάρνηθα (Καραβόλα) - Αττική", "-", "1.413"],
[242, "Μαυρόραχη (Καρά Ράχη) - Καρδίτσα, Φθιώτιδα", "-", "1.411"],
[243, "Βύθουλας (Βίτουλα) - Αρκαδία", "-", "1.410"],
[244, "Κωνίσκος (Κόνισκος) - Ευρυτανία", "-", "1.408"],
[245, "Κιθαιρώνας - Αττική, Βοιωτία", "Προφήτης Ηλίας", "1.407"],
[246, "Πυραμίδα (Μετερίζια) - Λάρισα, Τρίκαλα", "-", "1.404"],
[247, "Αχλάτ Τσαλ (Αχλαδόβουνο) - Ξάνθη", "Άγιος Γεώργιος", "1.402"],
[248, "Καλλίδρομο (Σαρώματα) - Φθιώτιδα", "Γκιόζα , Σταυρός", "1.399"],
[249, "Όχη - Εύβοια", "-", "1.398"],
[250, "Τετράζι (Νόμια Όρη) - Αρκαδία, Μεσσηνία", "Προφήτης Ηλίας", "1.389"],
[251, "Καλάθιο - Μεσσηνία", "-", "1.385"],
[252, "Αγία Τριάδα (Απόσκεπος, Σαρακήνα) - Καστοριά", "-", "1.384"],
[253, "Τρία Σύνορα - Ευρυτανία", "Βραχάκια", "1.384"],
[254, "Κορησός (Αηδονάκος) - Καστοριά", "Ίστακος", "1.383"],
[255, "Σερβόβουνο - Αρκαδία", "-", "1.374"],
[256, "Ντέβας - Φλώρινα", "-", "1.372"],
[257, "Γεράνεια Όρη - Αττική, Κορινθία", "Μακρυπλάγι", "1.369"],
[258, "Γορτυνιακά Όρη - Αρκαδία", "Χαλασμένο Βουνό", "1.368"],
[259, "Δοβράς (Φλάμπουρο) - Κοζάνη", "Γούρνες", "1.365"],
[260, "Σκοτεινή - Εύβοια", "-", "1.362"],
[261, "Προφήτης Ηλίας (Αηλιάς, Μελίσσι) - Αχαΐα", "-", "1.368"],
[262, "Προφήτης Ηλίας\u200B\u200B - Καστοριά", "Βογάτσικο", "1.361"],
[263, "Μελιδόνι (Αη-Λιάς) - Αργολίδα", "-", "1.356"],
[264, "Όρη Λαγκαδιών - Αρκαδία", "Πέντε Αδέλφια", "1.351"],
[265, "Πυξαριάς - Εύβοια", "-", "1.351"],
[266, "Μπουχουμέρα (Μπουκουμέρα) - Αχαΐα", "-", "1.350"],
[267, "Όρη Θερμών - Ξάνθη", "Μιργκάζιαν", "1.346"],
[268, "Άγκιστρο (Τσιγγέλι) - Σέρρες", "Δασωτό", "1.345"],
[269, "Μίνθη (Άλβαινα, Άλβενα) - Ηλεία", "Βουνούκα", "1.344"],
[270, "Προφήτης Ηλίας\u200B\u200B\u200B - Αχαΐα", "Κάστρο", "1.338"],
[271, "Λάπατα - Ιωάννινα", "-", "1.337"],
[272, "Ζαρκόραχη (Θεσπρωτικά Όρη) - Ιωάννινα, Πρέβεζα", "-", "1.332"],
[273, "Αποπηγάδι - Χανιά", "Άγιος Ζήνας", "1.333"],
[274, "Κασιδιάρης (Σούτιστα) - Ιωάννινα", "Καραβαμιά", "1.329"],
[275, "Μαδάρα - Αρκαδία, Λακωνία", "Πηλιουριώτικο", "1.326"],
[276, "Κουτσόκρανο - Ιωάννινα", "Ρεβίτσα", "1.325"],
[277, "Κρανιά - Αχαΐα", "-", "1.316"],
[278, "Κρυονερίτης - Ρέθυμνο", "Άγιο Πνεύμα", "1.310"],
[279, "Όρη Λεκάνης - Δράμα, Καβάλα", "Τσαλ Νταγ", "1.300"],
[280, "Άγιος Γεώργιος - Αρκαδία", "Γαρδίκι", "1.298"],
[281, "Πελινναίον - Χίος", "Πεληναίο", "1.297"],
[282, "Χιονοβούνι - Λακωνία", "-", "1.297"],
[283, "Σκοπός - Κοζάνη", "Σουβλερή Κορυφή", "1.291"],
[284, "Σουρμπάς - Αχαΐα", "Γούβες, Βουνό Νεζερών", "1.284"],
[285, "Νεραϊδολάκκωμα - Βοιωτία, Φωκίδα", "Άνθιμος", "1.274"],
[286, "Βρωμοβρυσέικα Βουνά - Μεσσηνία", "Προφήτης Ηλίας", "1.273"],
[287, "Μεγαλοβούνι - Αργολίδα, Κορινθία", "Μέγα Βουνό", "1.272"],
[288, "Περίβλεπτο - Δράμα", "Χαϊδαρίτσα, Στραγκάτς", "1.272"],
[289, "Ρεζενίκος - Αρκαδία", "-", "1.272"],
[290, "Βυρσίνη - Ροδόπη", "Μεγάλο Λιβάδι", "1.267"],
[291, "Λεωνίδας - Τρίκαλα", "-", "1.260"],
[292, "Λυκότρυπα - Γρεβενά", "-", "1.259"],
[293, "Αετοβούνι - Κοζάνη", "Καρτάλ Νταγ", "1.256"],
[294, "Αετοράχη - Γρεβενά, Κοζάνη", "Φλάμπουρο", "1.254"],
[295, "Τσεμπερού - Αρκαδία", "-", "1.252"],
[296, "Βαλανιδιά - Ιωάννινα", "Ντούσκα, Ρόγγια", "1.251"],
[297, "Καστανιά - Αρκαδία", "-", "1.248"],
[298, "Πυργούλι - Καρδίτσα", "-", "1.249"],
[299, "Καντήλι - Εύβοια", "Στρουγγίτσα", "1.246"],
[300, "Φαρμακοβούνι - Θεσπρωτία", "-", "1.240"],
[301, "Ορνό - Λασίθι", "Σπαθί", "1.238"],
[302, "Τσούκα Καραλή - Γρεβενά", "Κάρπενος", "1.235"],
[303, "Αστερούσια Όρη - Ηράκλειο", "Κόφινας", "1.230"],
[304, "Νεραϊδοβούνι - Αχαΐα", "-", "1.223"],
[305, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B - Ιωάννινα", "Άγιος Ηλίας", "1.222"],
[306, "Δεμάτι - Ιωάννινα", "Προφήτης Ηλίας", "1.221"],
[307, "Αιγάλεω (Όρη Κυπαρισσίας) - Μεσσηνία", "Άγιος Κωνσταντίνος", "1.219"],
[308, "Σαγγιάς - Λακωνία", "Κουρκούτσιλας", "1.218"],
[309, "Αττάβυρος - Ρόδος", "Άγιος Ιωάννης", "1.216"],
[310, "Λάστος - Κάρπαθος", "Καλολίμνη (Καλή Λίμνη)", "1.215"],
[311, "Παρθένι - Αργολίδα, Αρκαδία", "Προφήτης Ηλίας", "1.215"],
[312, "Κολώνα (Γκόλνα) - Ημαθία", "Γκόλονα", "1.210"],
[313, "Γαβριάς - Κορινθία", "-", "1.208"],
[314, "Βέσιζα - Κορινθία", "-", "1.207"],
[315, "Υψάριο (Ψαριό) - Θάσος", "-", "1.206"],
[316, "Καμαράκι - Ευρυτανία", "-", "1.203"],
[317, "Καρδαράς - Αιτωλοακαρνανία", "-", "1.202"],
[318, "Χορτιάτης - Θεσσαλονίκη, Χαλκιδική", "-", "1.201"],
[319, "Βελούνα (Βουνό Χαραυγής) - Θεσπρωτία", "-", "1.201"],
[320, "Αραχναίο - Αργολίδα", "-", "1.197"],
[321, "Μαγκλάβι - Μεσσηνία", "-", "1.192"],
[322, "Κοτύλαια Όρη - Εύβοια", "Μαυροβούνι", "1.190"],
[323, "Ξεροβούνι (Λαφύστιον Όρος) - Βοιωτία", "-", "1.186"],
[324, "Όρη Κουρέντων (Όρη Λυκοστάνης) - Ιωάννινα", "Προφήτης Ηλίας", "1.185"],
[325, "Γαϊδουροβούνι - Λακωνία", "-", "1.184"],
[326, "Σωρός - Ρέθυμνο", "Ανάληψη (Μεταμόρφωση Σωτήρος)", "1.184"],
[327, "Κουτσουρός - Φωκίδα", "Κριτσουρός", "1.183"],
[328, "Άγιος Ηλίας - Λευκάδα", "Ελάτη (Σταυρωτάς)", "1.182"],
[329, "Άγιος Δίκαιος - Χανιά", "Αϊ-Δίκαιος", "1.181"],
[330, "Βουνά Γρεβενών - Γρεβενά", "Τραχανάς", "1.180"],
[331, "Σιδέρωτας (Ασιδέρωτο, Ανάληψη) - Ρέθυμνο", "-", "1.177"],
[332, "Κρούσσια Όρη (Μαυροβούνι, Καρά Νταγ) - Κιλκίς, Σέρρες", "-", "1.177"],
[333, "Σουλιώτης - Κοζάνη, Λάρισα", "-", "1.177"],
[334, "Καλπακόβραχος - Εύβοια", "-", "1.176"],
[335, "Δραγουνέρα (Πιτσαδέικο Βουνό, Σωτήρα) - Κορινθία", "-", "1.175"],
[336, "Μεγάλη Τσούκα - Ιωάννινα", "-", "1.172"],
[337, "Ευβοϊκός Όλυμπος - Εύβοια", "Έλυμπος (Ψηλή Κορυφή)", "1.171"],
[338, "Βουνά Χαλανδρίτσας - Αχαΐα", "Άγιος Γεώργιος", "1.171"],
[339, "Πικερνιώτικο - Αρκαδία", "Μπαρμπέρι", "1.168"],
[340, "Κουτρούφι - Αρκαδία", "-", "1.165"],
[341, "Μπιρμπιλιώ - Φθιώτιδα", "-", "1.163"],
[342, "Χολομώντας - Χαλκιδική", "Υψίζων", "1.163"],
[343, "Στρογγυλοβούνι (Καστανοβούνι) - Κορινθία", "Προφήτης Ηλίας", "1.161"],
[344, "Παραβουνάκι - Αργολίδα", "Ψηλό Λιθαρι", "1.161"],
[345, "Κορυφή Ξενογιώργη - Λασίθι", "-", "1.160"],
[346, "Λουλουδάκης - Ηράκλειο, Λασίθι", "-", "1.160"],
[347, "Τουρτούλα - Αρκαδία", "-", "1.160"],
[348, "Ταναΐδα - Εύβοια", "-", "1.157"],
[349, "Καρβούνης - Σάμος", "Άμπελος (Προφήτης Ηλίας)", "1.153"],
[350, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B - Μεσσηνία", "Άγιος Ηλίας", "1.146"],
[351, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B - Αχαΐα", "-", "1.142"],
[352, "Άγιοι Θεόδωροι - Φθιώτιδα", "-", "1.141"],
[353, "Μεγάλη Κορυφή - Λασίθι", "-", "1.141"],
[354, "Αετοράχη - Ιωάννινα", "Πύργος", "1.137"],
[355, "Τραπεζώνα - Αργολίδα, Κορινθία", "-", "1.137"],
[356, "Πατέρας - Αττική", "Λιοντάρι (Έλατος)", "1.132"],
[357, "Ίταμος - Καρδίτσα, Τρίκαλα", "Γιάμος (Τσούκα)", "1.132"],
[358, "Αγία Δυνατή - Κεφαλληνία", "-", "1.131"],
[359, "Κουλοχέρα - Λακωνία", "-", "1.125"],
[360, "Κούκουρας - Αρκαδία", "-", "1.122"],
[361, "Δίδυμο (Δίδυμα, Κονί) - Αργολίδα", "-", "1.121"],
[362, "Άγιος Ηλίας - Αρκαδία", "Αγιολιάς", "1.119"],
[363, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αρκαδία", "-", "1.119"],
[364, "Τρίκορφο - Ευρυτανία", "-", "1.118"],
[365, "Μεγαλοβούνι (Νοτζά Νταγ) - Δράμα", "-", "1.117"],
[366, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αρκαδία", "Καντρέβα (Αγιολιάς)", "1.117"],
[367, "Άγιος Χριστόφορος - Αρκαδία", "Αξιοφόρος", "1.117"],
[368, "Πεντέλη (Πεντελικό) - Αττική", "Πυργάρι (Πέργαρι)", "1.108"],
[369, "Βερτίσκος - Θεσσαλονίκη", "Χαρβάτα (Μπεσίκι)", "1.107"],
[370, "Σταυραετός - Κορινθία", "-", "1.107"],
[371, "Τσουγκρί (Πύργος) - Άρτα", "Κιλμπερίνι", "1.104"],
[372, "Ορθολίθι - Αργολίδα", "-", "1.103"],
[373, "Τρίλοφο (Αλεότζ) - Καστοριά, Φλώρινα", "-", "1.102"],
[374, "Κουβελαίικο Βουνό (Άγιος Ηλίας) - Μεσσηνία", "Προφήτης Ηλίας", "1.101"],
[375, "Τριαντάφυλλα - Αρκαδία", "Σούρλα", "1.097"],
[376, "Καλογεροβούνι - Λακωνία", "-", "1.095"],
[377, "Κίσσαβος - Γρεβενά", "-", "1.094"],
[378, "Μαύρο Ίσιωμα - Ξάνθη", "-", "1.093"],
[379, "Σκρα (Σκρα ντι Λέγκεν, Γκιζέτ) - Κιλκίς, Πέλλα", "-", "1.091"],
[380, "Κερδύλιο (Κερδύλια Όρη) - Θεσσαλονίκη, Σέρρες", "Φούντες", "1.090"],
[381, "Τσεκούρι (Τσεκουράτ) - Πρέβεζα", "-", "1.090"],
[382, "Χάρακας - Δράμα", "Πυραμίδα", "1.088"],
[383, "Τρέτιμος (Τρέτιμ Τεπέ) - Γρεβενά", "-", "1.088"],
[384, "Λημέρι - Αιτωλοακαρνανία", "Κορίτα", "1.087"],
[385, "Κράβαρης (Γκράβαρης, Βόρειον) - Αρκαδία", "Προφήτης Ηλίας", "1.086"],
[386, "Κατσονύχι - Ρέθυμνο", "Αγκάθι", "1.085"],
[387, "Κουλούκωνας (Ταλλαία Όρη) - Ρέθυμνο", "-", "1.084"],
[388, "Λασποχώματα (Μπλος) - Ευρυτανία", "-", "1.083"],
[389, "Φλατσάτα - Καστοριά", "-", "1.079"],
[390, "Καστρί - Κεφαλληνία", "Κόκκινη Ράχη", "1.079"],
[391, "Χλωμό - Φθιώτιδα", "-", "1.079"],
[392, "Νυφίτσα - Κορινθία", "Ψηλή Ράχη Στεφανιού", "1.078"],
[393, "Τούρλα (Βουνό Μουζακαίικων) - Πρέβεζα", "-", "1.077"],
[394, "Δρίσκος - Ιωάννινα", "-", "1.077"],
[395, "Δρακοβούνι - Αρκαδία", "-", "1.075"],
[396, "Βουνά Μανολιάσας - Ιωάννινα", "Μεγάλη Ράχη", "1.075"],
[397, "Καμερτζή (Μαυροπαίδι, Καρά Ογλάν) - Ξάνθη", "-", "1.072"],
[398, "Κουτρούλης - Χανιά", "-", "1.070"],
[399, "Μαύρο Πουλί (Χιντιρλίκ) - Κοζάνη, Φλώρινα", "-", "1.069"],
[400, "Σάπκα - Ροδόπη, Έβρος", "Χαράκωμα", "1.065"],
[401, "Χαράκωμα (Σίλο) - Έβρος, Ροδόπη", "-", "1.065"],
[402, "Γράμματα - Άρτα", "Κρανιά", "1.064"],
[403, "Όρη Φιλιατών - Θεσπρωτία", "Κότσιον", "1.064"],
[404, "Όρη Τροπαίων - Αρκαδία", "Άγιος Κωνσταντίνος", "1.062"],
[405, "Βλαχοβούνι - Εύβοια", "Εφταός", "1.060"],
[406, "Βουνό Βελαντίλας (Κρανίλα, Καμάρα) - Θεσπρωτία", "-", "1.057"],
[407, "Άγιος Αθανάσιος (Βουνό Μαμαλούκας) - Αχαΐα", "-", "1.056"],
[408, "Μπούρα - Μεσσηνία", "-", "1.055"],
[409, "Μαυροβούνι (Σκούτλη) - Λάρισα", "-", "1.053"],
[410, "Βουνό Ρούσσου (Ρούσο Βουνό) - Λακωνία", "-", "1.053"],
[411, "Λάκκα Κοκκίνη (Κερνίκελο, Μάλια Λένι) - Αργολίδα, Κορινθία", "-", "1.046"],
[412, "Προφήτης Ηλίας (Παλιοαηλιάς, Άτυνο Μύλο) - Λάρισα", "-", "1.045"],
[413, "Αμάραντος - Καρδίτσα", "-", "1.041"],
[414, "Πέντε Κορυφές - Ευρυτανία", "Κομπολίτσα", "1.039"],
[415, "Αθέρας - Ικαρία", "Πράμνος", "1.037"],
[416, "Ράχη - Αργολίδα", "Μπαχριάμι", "1.036"],
[417, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Φθιώτιδα", "-", "1.026"],
[418, "Υμηττός - Αττική", "Εύζωνας", "1.026"],
[419, "Πάστρα - Αττική, Βοιωτία", "Κούρτεζα", "1.025"],
[420, "Ανάληψη - Αιτωλοακαρνανία", "Πυργάκι", "1.021"],
[421, "Μεσσάπιον Όρος - Βοιωτία", "Κτυπάς", "1.021"],
[422, "Προφήτης Ηλίας (Μαλούνι, Μαλόνι) - Θεσπρωτία", "-", "1.020"],
[423, "Σανταμέρι (Σκόλλις, Πορτέικο, Πορτοβούνι) - Αχαΐα", "-", "1.016"],
[424, "Κλόκοβα - Αιτωλοακαρνανία", "Παλιοβούνα", "1.015"],
[425, "Κουκουργιάκος (Κοκκοριάκος) - Καρδίτσα", "-", "1.015"],
[426, "Σάμιτος - Ρέθυμνο", "-", "1.013"],
[427, "Ψηλή Ράχη - Καρδίτσα", "-", "1.011"],
[428, "Ναρθάκι (Κασιδιάρης) - Λάρισα, Φθιώτιδα", "-", "1.011"],
[429, "Βουνά Ξινού Νερού - Φλώρινα", "Μάλα Ρέκα (Ξηρή Πηγή)", "1.011"],
[430, "Μέλισσα - Ικαρία", "Προβατοκεφάλας", "1.011"],
[431, "Καστανιές (Κεστενές) - Καβάλα", "-", "1.009"],
[432, "Ξερακιώνα - Βοιωτία", "Άγιος Βασίλειος", "1.007"],
[433, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Μεσσηνία", "Λιγκοβίσιτσα", "1.006"],
[434, "Άγιος Αρσένιος - Φωκίδα", "-", "1.003"],
[435, "Καψάς - Λασίθι", "-", "1.002"],
[436, "Ζας (Ζευς) - Νάξος", "-", "1.001"],
[437, "Ριζό - Κοζάνη", "-", "999"],
[438, "Κορωνός - Νάξος", "Μαυροβούνι", "999"],
[439, "Άγιος Χριστόφορος - Κοζάνη", "-", "997"],
[440, "Κουβάρα - Ανδρος", "Πέταλο (Προφήτης Ηλίας)", "997"],
[441, "Ημεροβίγλι (Μεροβίγλι) - Κεφαλληνία", "-", "994"],
[442, "Ξηρόν Ορος - Εύβοια", "-", "990"],
[443, "Κουτσόρραχος - Γρεβενά", "-", "989"],
[444, "Βουνά Μύτικα - Ροδόπη", "Παρατηρητής", "987"],
[445, "Αράκυνθος - Αιτωλοακαρνανία", "Ζυγός (Γρεβενό)", "983"],
[446, "Κατάχλωμο (Κατάχλωρο, Ταμάσιον Όρος) - Καρδίτσα", "-", "983"],
[447, "Κουρούπα - Ρέθυμνο", "-", "983"],
[448, "Μοναστήρι - Κιλκίς", "-", "981"],
[449, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Θεσπρωτία", "-", "981"],
            [450, "Ασφεντιλιάς (Ανατολικά Αστερούσια) - Ηράκλειο", "-", "979"],
            [451, "Βουνά Κύμης - Ροδόπη", "Φαντάρος", "978"],
            [452, "Ξεροβούνι - Φθιώτιδα", "-", "977"],
            [453, "Ζάβιτσα (Τιμένιον Όρος) - Αργολίδα, Αρκαδία", "Προφήτης Ηλίας", "974"],
            [454, "Μέλτη - Ξάνθη", "Μισκίν Τεπέ", "973"],  
            [455, "Χάρμα (Φλώρος, Τεροβίτικο) - Ιωάννινα", "-", "971"], 
            [456, "Αγούρος - Τρίκαλα", "-", "970"],  
            [457, "Τελέθριο - Εύβοια", "Προφήτης Ηλίας", "970"],
            [458, "Λεπέτυμνος Αγιολιάς - Λέσβος", "Βίγλα", "968"], 
            [459, "Όλυμπος - Λέσβος", "-", "967"],  
            [460, "Λυκόδημο Όρος - Μεσσηνία", "-", "959"],  
            [461, "Αλωνοράχη - Κοζάνη", "-", "957"],
            [462, "Βουνά Κάρδαμου - Ροδόπη", "Πολεμιστής", "956"],
            [463, "Ψηλό Βουνό - Θεσπρωτία", "Μάλι Κλάδι", "956"],
            [464, "Μακρυνόρος - Αιτωλοακαρνανία", "Αγρίδι", "955"],
            [465, "Κονισκός (Παγκάκαινα) - Τρίκαλα", "-", "954"],
            [466, "Ράχη Κούτρα - Λάρισα", "-", "953"],
            [467, "Βουνά Κοζάνης - Κοζάνη", "Προφήτης Ηλίας", "952"],
[468, "Μακροβούνι (Μαυροβούνι) - Γρεβενά", "-", "948"],
[469, "Άγιος Κωνσταντίνος - Αρκαδία", "-", "947"],
[470, "Κνημίδα - Φθιώτιδα", "Αγία Παρασκευή", "945"],
[471, "Βουβάλα - Ρέθυμνο", "-", "944"],
[472, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Χαλκιδική", "Βίγλα", "940"],
[473, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Κοζάνη", "-", "939"],
[474, "Ρωμανάτη - Λασίθι", "-", "937"],
[475, "Προφήτης Ηλίας (Τσιότινα) - Γρεβενά", "-", "930"],
[476, "Αυγό - Κεφαλληνία", "-", "929"],
[477, "Δίκορφο (Βελούτσα) - Αιτωλοακαρνανία", "Προφήτης Ηλίας", "929"],
[478, "Αλογομάνδρα - Αρκαδία, Λακωνία", "-", "927"],
[479, "Όρη Πάργας (Κρανιά) - Πρέβεζα", "-", "926"],
[480, "Σπηλακιά (Αίπος, Κοχλιός) - Χίος", "-", "926"],
[481, "Μακρυλάκκωμα - Λακωνία", "-", "924"],
[482, "Λυκοζόρι (Τσέβροχο) - Τρίκαλα", "-", "921"],
[483, "Σγουριάς - Αρκαδία", "-", "920"],
[484, "Λάγγαρη - Θεσπρωτία", "-", "920"],
[485, "Τρύπιο Λιθάρι - Άρτα", "-", "920"],
[486, "Στρατονικό (Μπιάβιτσα, Πιαβίτσα, Κοντάρι) - Χαλκιδική", "-", "918"],
[487, "Κουρκούλα (Στρογγύλο) - Λακωνία", "-", "916"],
[488, "Μεγάλη Ράχη - Κοζάνη", "-", "916"],
[489, "Βαράσοβα (Σφυρί) - Αιτωλοακαρνανία", "-", "914"],
[490, "Καλαβούνι (Κολοβούνι) - Αιτωλοακαρνανία", "-", "910"],
[491, "Καμήλα (Καμηλοβούνι) - Χαλκιδική", "-", "909"],
[492, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Ιωάννινα", "-", "909"],
[493, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Άρτα", "Άγιος Ηλίας", "907"],
[494, "Κορομπίλι - Βοιωτία", "-", "907"],
[495, "Ξηρό - Ρέθυμνο", "Ντιμπλοχωριανό Αόρι", "904"],
[496, "Παντοκράτωρ - Κέρκυρα", "-", "903"],
[497, "Ξηροβούνι - Αιτωλοακαρνανία", "-", "903"],
[498, "Βουνά Οργάνης - Ροδόπη", "Αετοπηγή", "902"],
[499, "Καλόν Ορος - Κεφαλληνία", "-", "901"],
[500, "Παπαλίβαδο - Λάρισα", "-", "901"],
[501, "Πεταλάς (Θύαμον όρος) - Αιτωλοακαρνανία", "Πεταλόστερνα", "895"],
[502, "Άτρος - Κεφαλληνία", "Κολώνα", "894"],
[503, "Προφήτης Ηλίας (Γρανίτσας) - Βοιωτία", "-", "894"],
[504, "Χλωμό - Μαγνησία", "-", "894"],
[505, "Κούτσουρας - Φωκίδα", "-", "893"],
[506, "Λευκάδιο - Κοζάνη", "-", "893"],
[507, "Αμάλια - Βοιωτία", "Σκαλτσάς", "891"],
[508, "Βουνά Λευκογείων - Δράμα", "Τομπρούκ", "887"],
[509, "Μέγα Ίσωμα - Φθιώτιδα", "-", "887"],
[510, "Μεγαλοβούνι - Αργολίδα", "Μάλιαζε, Μπεντέρι", "885"],
[511, "Φανάρι - Νάξος", "-", "883"],
[512, "Βουρσάνα - Κοζάνη", "-", "882"],
[513, "Τραγόσταλος - Αιτωλοακαρνανία", "-", "881"],
[514, "Φροξυλιά - Αιτωλοακαρνανία", "-", "880"],
[515, "Ορφέας - Έβρος, Ροδόπη", "Γκελεμπέκι", "878"],
[516, "Ακρορράχη - Ιωάννινα", "-", "877"],
[517, "Πλακάκια - Χανιά", "Καλαμαύκα", "877"],
[518, "Κιντζιρέλου - Ιωάννινα", "Μάρμαρα", "877"],
[519, "Γερμανικό - Κιλκίς", "Κλέπε (Μπουρούνι)", "876"],
[520, "Μέγα Πλάι - Ιωάννινα", "Μπνάγια", "876"],
[521, "Βερντάτση - Μεσσηνία", "Βιρτσάτσι, Μακελειό", "874"],
[522, "Σταυρός - Αιτωλοακαρνανία", "Πυργάκια", "873"],
[523, "Φουκάς - Κορινθία", "Φωκάς, Απέσας", "872"],
[524, "Δανιήλ - Φωκίδα", "Ξηρογιάννης", "872"],
[525, "Σαρακίνα - Θεσπρωτία", "Σαράγκινιτ (Κρεμάλες)", "871"],
[526, "Ορτάρι - Εύβοια", "Τσαρούχι, Σουκάρο", "870"],
[527, "Πύργος - Εύβοια", "Μουριτζά, Κερατούρα", "869"],
[528, "Κακοβούνια - Λακωνία", "Νικόλακκος (Λιακός)", "868"],
[529, "Γορίλας (Γκορίλα, Κουρύλας) - Ιωάννινα", "-", "867"],
[530, "Αρκουδότρυπα - Εύβοια", "-", "866"],
[531, "Τσούκα - Άρτα", "Τσούμα", "864"],
[532, "Ομπλός - Αχαΐα", "-", "863"],
[533, "Δύσωρο (Κρούσια Όρη, Μαυροβούνι) - Κιλκίς, Σέρρες", "-", "862"],
[534, "Καμήλα - Θεσπρωτία", "Μεγάλη Ράχη, Πλόκιστα", "861"],
[535, "Βρύσινας - Ρέθυμνο", "Άγιο Πνεύμα", "860"],
[536, "Προφήτης Ηλίας (Βελανιδιά, Κυνόρτιον) - Αργολίδα", "-", "859"],
[537, "Βουνά Καλότυχου - Ξάνθη", "Κορυφή", "858"],
[538, "Κορυφή - Τρίκαλα", "Στάοσα, Στάρμπα", "858"],
[539, "Πετραλώνι - Μεσσηνία", "Κούτρα (Άγιος Ηλίας)", "857"],
[540, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αργολίδα", "-", "856"],
[541, "Σουγλιάνι (Στρατονικό Όρος) - Θεσσαλονίκη, Χαλκιδική", "-", "855"],
[542, "Πύργος - Αιτωλοακαρνανία", "Πεντάλφα", "852"],
[543, "Ψηλή Ράχη - Καρδίτσα, Φθιώτιδα", "Παλιοκάιτσα", "851"],
[544, "Δίκαιος - Κως", "Ωρομέδων", "850"],
[545, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αρκαδία", "-", "850"],
[546, "Άγιοι Ασώματοι - Αχαΐα", "-", "848"],
[547, "Μεγάλη Τσούκα - Πρέβεζα", "Τοπόλια", "848"],
[548, "Πενταλώνι - Ιωάννινα", "Παντελόνι", "847"],
[549, "Αμπέλια - Βοιωτία", "Μαλιαζέζα", "846"],
[550, "Αφρόσι - Εύβοια", "Αρκούδι", "845"],
[551, "Κεραύσιον Όρος (Ματεσαίικο Βουνό) - Ηλεία", "-", "844"],
[552, "Μαυροβούνι - Αργολίδα", "Βελανιδιά", "843"],
[553, "Ιερό (Μπουκατέ Νταγ) - Έβρος, Ροδόπη", "-", "842"],
[554, "Αρκούδα - Τρίκαλα", "-", "841"],
[555, "Ακραμύτης - Ρόδος", "-", "840"],
[556, "Βίτσι - Αιτωλοακαρνανία", "-", "840"],
[557, "Ίταμος (Δραγουδέλης) - Χαλκιδική", "Ντραγουντέλι", "839"],
[558, "Κρούκελλος - Αμοργός", "Κρίκελος", "838"],
[559, "Ξηχόρτι - Ηλεία", "Ζαχοβούνι", "837"],
[560, "Άγιος Κωνσταντίνος - Λακωνία", "-", "836"],
[561, "Τσιτομή - Φωκίδα", "-", "835"],
[562, "Πλαγιές (Βουνά Ζίρου) - Λασίθι", "-", "834"],
[563, "Μαυρότοπος - Φθιώτιδα", "Καράπα", "833"],
[564, "Λουνάκι - Τρίκαλα", "Προφήτης Ηλίας", "832"],
[565, "Καστέλλια - Αχαΐα", "Αγία Τριάδα", "831"],
[566, "Καταλύματα - Λασίθι", "Ξυλόγουρνες", "830"],
[567, "Αμανή - Χίος", "-", "829"],
[568, "Γιούχτας - Ηράκλειο", "Γιούκτας", "828"],
[569, "Νήριτο Όρος - Ιθάκη", "Αγία Ελεούσα", "827"],
[570, "Χαρβάτι - Αργολίδα, Κορινθία", "Αγιολιάς (Μάρτα)", "826"],
[571, "Οξύ Κεφάλι - Ηράκλειο", "Ξυκέφαλο", "824"],
[572, "Ευαγγελίστρια - Κορινθία", "Σπιριάς, Θυαμία", "823"],
[573, "Ζωιτός - Βοιωτία", "Μπαρδάνα, Υψωμα", "822"],
[574, "Εκκλησάκι - Κορινθία", "Πελλήνη, Παλάτι, Τσέρκοβα", "821"],
[575, "Μπρινιάς (Δρυζές, Πρινιάς) - Λασίθι", "-", "820"],
[576, "Μονοδένδρι - Ηράκλειο", "Μονοδέντρι", "818"],
[577, "Σητειακά Όρη- Λασίθι", "Πλαγιά", "817"],
[578, "Τρίκορφο (Βουνά Δερβενακίων) - Αργολίδα", "-", "817"],
[579, "Στρούμπουλας - Ηράκλειο", "Τίμιος Σταυρός", "816"],
[580, "Δόβρος - Αιτωλοακαρνανία", "-", "794"],
[581, "Κριθίνα - Λακωνία", "-", "794"],  
[582, "Τίμιος Σταυρός - Λασίθι", "-", "793"],  
[583, "Μαυροκορφή - Μαγνησία", "-", "793"],  
[584, "Ψηλοκορφή - Κορινθία", "-", "789"],  
[585, "Κόχυλας - Σκύρος", "(Πανόφτης, Πυραμίδα)", "788"],  
[586, "Πυργίσκος - Λέσβος", "-", "786"],  
[587, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Ευρυτανία", "-", "786"],  
[588, "Αδέρες - Αργολίδα", "-", "786"],  
[589, "Σερβούνι - Εύβοια", "Πλατειά Κορφή", "785"],  
[590, "Πτώο - Βοιωτία", "Πεταλάς", "781"],  
[591, "Μπουρνιάς - Σάμος", "-", "778"],  
[592, "Λαπίθας - Ηλεία", "-", "776"],  
[593, "Μεγάλη Κορυφή - Ηράκλειο", "-", "773"],  
[594, "Ζαλόγγου Βουνά - Πρέβεζα", "-", "773"],  
[595, "Παλιαγραπιδιά - Ευρυτανία", "-", "772"],  
[596, "Κουκουρουφλιά - Τρίκαλα", "-", "771"],  
[597, "Χελμός - Αρκαδία, Λακωνία", "-", "769"],
[598, "Αυγό (Σταύρος Τσακίρης) - Ξάνθη", "Αυγό", "768"],
[599, "Κοκκινίτσα - Θεσπρωτία", "-", "765"],  
[600, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Ευρυτανία", "-", "764"],  
[601, "Πετράλωνα - Αιτωλοακαρνανία", "-", "764"],  
[602, "Πορί - Λακωνία", "-", "763"],  
[603, "Άγιοι Πάντες - Πάρος", "-", "762"],  
[604, "Γραμβούσα - Χανιά", "-", "762"],  
[605, "Στειρομάνδρα - Λασίθι", "-", "762"],  
[606, "Βουνί (Οχθονιά) - Εύβοια", "-", "761"],  
[607, "Κρυοκεφάλα (Κρίμιανη) - Λασίθι", "-", "760"],  
[608, "Κομποβούνι - Αχαΐα", "-", "758"],  
[609, "Παλιοπρέβεζα - Ευρυτανία", "-", "757"],  
[610, "Βραχιώνας - Ζάκυνθος", "Βουνί", "757"],  
[611, "Ντουσκάρας Βουνά - Ιωάννινα", "Βάτος", "754"],  
[612, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αχαΐα", "-", "754"],  
[613, "Μέγας Λάκκος - Λευκάδα", "-", "753"],  
[614, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Μήλος", "-", "750"],  
[615, "Όνυχας - Χανιά", "-", "749"],  
[616, "Χρυσοβίτσας Βουνό - Αιτωλοακαρνανία", "Προφήτης Ηλίας", "748"],  
[617, "Φλιάμπουρι - Θεσπρωτία", "-", "747"],  
[618, "Σαγματάς - Βοιωτία", "Ύπατο", "746"],  
[619, "Βουνί - Κάλαμος", "-", "745"],  
[620, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Λακωνία", "-", "744"],  
[621, "Χελώνα (Χελώνη) - Αργολίδα", "-", "740"],  
[622, "Πυργάκι - Εύβοια", "-", "740"],  
[623, "Βενή Κορυφή (Βένι) - Ρέθυμνο", "-", "740"],  
[624, "Προφήτης Ηλίας (Αριά) - Άρτα", "-", "740"],  
[625, "Ξεροσουβάλα - Εύβοια", "Λιχάς", "738"],  
[626, "Προφήτης Ηλίας (Άγιος Ηλίας, Κουρί) - Θεσσαλονίκη", "-", "737"],  
[627, "Γερακώνας (Γερακώνες) - Άνδρος", "-", "736"],  
[628, "Ξεροβούνι - Καρδίτσα", "-", "734"],  
[629, "Βασιλικό - Ηράκλειο", "-", "732"],  
[630, "Χασιού Κορυφή - Χανιά", "-", "732"],  
[631, "Κορυφή - Κορινθία", "-", "731"],  
[632, "Όρη Ζάρκου - Λάρισα, Τρίκαλα", "Κούτρα", "729"],  
[633, "Τσικνιάς - Τήνος", "-", "727"],  
[634, "Μαυροβούνι (Χαλκοδόνιον, Καραντάου) - Λάρισα", "-", "725"],  
[635, "Στρογγυλό - Κορινθία", "-", "724"],  
[636, "Προφήτης Ηλίας (Άγιος Ηλίας) - Φθιώτιδα", "-", "724"],  
[637, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Κορινθία", "-", "724"],  
[638, "Τύμπανο (Κορακοβούνι) - Κορινθία", "-", "722"],  
[639, "Περιστέρι (Γκαλόσι, Χήμι) - Εύβοια", "-", "722"],  
[640, "Μόβρη - Αχαΐα, Ηλεία", "Προφήτης Ηλίας", "719"],  
[641, "Λούτσι - Λασίθι", "-", "719"],  
[642, "Απιδιανά Βουνά - Λασίθι", "Χαντριανή Κεφάλα", "719"],  
[643, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Κάρπαθος", "-", "719"],  
[644, "Άγιοι Σαράντα - Άνδρος", "-", "718"],  
[645, "Μαγκλαβάς - Μεσσηνία", "-", "715"],  
[646, "Ετιανή Κεφάλα - Λασίθι", "-", "715"],  
[647, "Παλαιόκαστρο - Βοιωτία", "-", "714"],  
[648, "Πύργος - Ίος", "-", "714"],  
[649, "Ορκίλλι - Κάρπαθος", "-", "713"],  
[650, "Πλακοκεφάλα - Λασίθι", "-", "712"],  
[651, "Παλιοσαμαρίνα - Τρίκαλα", "-", "711"],  
[652, "Βαβύλα - Λακωνία", "-", "711"],  
[653, "Κουλούρα - Κάρπαθος", "Κυμαράς", "710"],  
[654, "Χρουσαίικο Βουνό - Αρκαδία", "-", "709"],  
[655, "Βερσενίκος - Βοιωτία", "-", "709"],  
[656, "Ψήλωμα (Βατόνια, Νέϊφτος) - Χαλκιδική", "-", "703"],  
[657, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αργολίδα", "-", "702"],  
[658, "Κάδιστο - Λασίθι", "Κούτσουρα", "701"],  
[659, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Κορινθία", "-", "701"],  
[660, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Άρτα", "-", "701"],  
[661, "Μεγαβούνι (Πυργιώσα) - Αργολίδα", "-", "700"],  
[662, "Μικρό - Ηράκλειο", "-", "700"],  
[663, "Προφήτης Ηλίας - Αμοργός", "-", "700"],  
[664, "Χορεύτρα - Λέσβος", "-", "699"],  
[665, "Γούπατα - Αιτωλοακαρνανία", "-", "699"],  
[666, "Προφήτης Ηλίας​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ - Νίσυρος", "-", "698"],  
[667, "Πασχαλιές - Βοιωτία", "-", "696"],  
[668, "Μέγα Όρος - Αιτωλοακαρνανία", "-", "695"],  
[669, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Φθιώτιδα", "-", "694"],  
[670, "Πυραμίδα - Κιλκίς", "-", "693"],  
[671, "Βράχος - Δράμα", "-", "692"],  
[672, "Σύμβολο - Καβάλα", "Αγριάδα, Τσαλί", "692"],  
[673, "Τίτανος (Δοβρούτσι) - Καρδίτσα, Λάρισα, Τρίκαλα", "Αγία Παρασκευή", "690"],  
[674, "Βλοχός - Αιτωλοακαρνανία", "-", "688"],  
[675, "Λαχανά Βουνά (Λαχανάς) - Θεσσαλονίκη", "-", "687"],  
[676, "Χόμαλης - Κάρπαθος", "-", "686"],  
[677, "Προφήτης Ηλίας - Άνδρος", "-", "684"],  
[678, "Πυραμίς - Αιτωλοακαρνανία", "-", "684"],  
[679, "Βίγλα - Ηράκλειο", "-", "683"],  
[680, "Στύρων Βουνά - Εύβοια", "Κλιόσι", "682"],  
[681, "Προφήτης Ηλίας​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ - Σίφνος", "-", "682"],  
[682, "Πεζούλισες - Αχαΐα", "-", "682"],  
[683, "Ίσμαρος - Ροδόπη", "Άγιος Αθανάσιος", "681"],  
[684, "Δέλφι - Σκόπελος", "-", "681"],  
[685, "Μακρυά Λενιά - Εύβοια", "-", "680"],  
[686, "Λυκοχωρίου Βουνό - Αρκαδία", "-", "677"],  
[687, "Κουλές - Ρέθυμνο", "-", "676"],  
[688, "Προφήτης Ηλίας​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ - Κάλυμνος", "-", "676"],  
[689, "Πριονόσκαλα - Αιτωλοακαρνανία", "-", "673"],  
[690, "Σκάρος - Λευκάδα", "Μεγάλη Ράχη", "673"],  
[691, "Αητοράχη - Λέσβος", "-", "673"],  
[692, "Αντίμηλος - Αντίμηλος", "Πεντένια", "671"],  
[693, "Ξυλόκαστρο - Αχαΐα", "-", "670"],  
[694, "Νερόβουλο - Ιθάκη", "-", "669"],  
[695, "Κάστρο (Σιδηρόκαστρο) - Μεσσηνία", "-", "669"],  
[696, "Βόλβης Όρη - Θεσσαλονίκη", "Πετρωτό", "668"],  
[697, "Θρακικά Μετέωρα - Ροδόπη", "-", "661"],  
[698, "Ψηλή Ράχη - Αιτωλοακαρνανία", "-", "659"],  
[699, "Βάραθρο - Θεσπρωτία", "Βαράθι", "658"],  
[700, "Γριά Βίγλα - Ηράκλειο", "-", "657"],
[701, "Φορτέτζα - Ρέθυμνο", "-", "656"],  
[702, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Φθιώτιδα", "-", "655"],  
[703, "Κορυφή - Έβρος", "Αντά Τεπέ", "654"],  
[704, "Προφήτης Ηλίας​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ - Τήλος", "-", "654"],  
[705, "Γέρο Γιώργης - Αιτωλοακαρνανία", "-", "653"],  
[706, "Διονυσοβούνι - Αττική", "-", "651"],  
[707, "Μεσοβούνι - Τήνος", "Μέλισσα", "649"],  
[708, "Πάνειο - Αττική", "Κερατοβούνι", "648"],  
[709, "Λίμη (Λουκίσσα) - Κεφαλληνία", "-", "647"],  
[710, "Μύτη - Εύβοια", "-", "647"],  
[711, "Βαρνάβας (Μαυροβούνι) - Αττική", "Προφήτης Ηλίας", "647"],  
[712, "Μαυρηνόρα (Μαυρονόρος) - Αττική", "-", "646"],  
[713, "Πόρτες - Μαγνησία", "Σαρατζή", "645"],  
[714, "Τισαίο - Μαγνησία", "Εύζωνος", "644"],  
[715, "Κατσίκα - Χαλκιδική", "-", "643"],  
[716, "Παλαρράχη - Αιτωλοακαρνανία", "-", "642"],  
[717, "Τραγοβούνι - Μαγνησία, Φθιώτιδα", "-", "639"],  
[718, "Ριζανών Βουνό - Κιλκίς, Σέρρες", "-", "638"],  
[719, "Τρίκορφο - Εύβοια", "-", "638"],  
[720, "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Βοιωτία, Φθιώτιδα", "-", "637"],  
[721, "Πέρδικας Βουνό - Θεσπρωτία", "Τσούκα", "636"],  
[722, "Κεφάλα - Ηράκλειο", "-", "635"],  
[723, "Αχριανοβούνι - Αρκαδία", "-", "635"],
[724, "Όρδυμνος - Λέσβος", "-", "634"],  
[725, "Γυμνούλα - Θεσπρωτία", "Γκόλνιτσα", "633"],  
[726, "Παχύ Βουνό - Σαρία", "Γκρόσσο", "631"],  
[727, "Παναγία (Πολύφεγγος) - Κορινθία", "-", "631"],  
[728, "Μετέωρα - Τρίκαλα", "Αγιά", "630"],  
[729, "Ορφανός - Τρίκαλα", "-", "630"],  
[730, "Λόφος - Καβάλα", "-", "630"],  
[731, "Ύψωμα Αδελφών Ζαχαροπούλου (Κορύλοβο) - Δράμα", "-", "629"],  
[732, "Χούσακας - Ηράκλειο", "-", "629"],  
[733, "Κεφάλι - Έβρος", "Αλταάτ Τεπέ", "628"],  
[734, "Αγκαθερή - Λέσβος", "-", "625"],  
[735, "Μεγαλοβούνι - Θεσπρωτία", "-", "625"],  
[736, "Ανάβλοχας - Λασίθι", "-", "623"],  
[737, "Τσούκα - Κέρκυρα", "-", "621"],  
[738, "Κάψαλο - Έβρος", "Τσατάλ Καγιά", "620"],  
[739, "Θέρμου Βουνό - Αιτωλοακαρνανία", "-", "620"],  
[740, "Βίγλα - Σύμη", "Άγιος Νικόλαος", "617"],  
[741, "Μερέντα - Αττική", "-", "614"],  
[742, "Νεραϊδίτης - Λάρισα, Μαγνησία", "-", "614"],  
[743, "Παλιοβούνι - Έβρος", "Κουρτ Τεπέ", "612"],  
[744, "Ψήλωμα - Βοιωτία", "-", "612"],  
[745, "Ζούρβα (Βουνό Μαλάξας) - Χανιά", "-", "610"],  
[746, "Κουκούλα - Κάλυμνος", "Κυρά Ψηλή", "609"],  
[747, "Αλογοβούνι - Αιτωλοακαρνανία", "-", "607"],  
[748, "Μεγάλο Βουνό - Ζάκυνθος", "Πύργος", "606"],  
[749, "Μεροβίγλι - Αιτωλοακαρνανία", "-", "604"],  
[750, "Κεχροβούνι - Τήνος", "-", "604"],  
[751, "Ασφεντιλές - Χανιά", "-", "604"],  
[752, "Λούτσα - Φθιώτιδα", "-", "603"],  
[753, "Τσίγγανη - Θεσπρωτία", "-", "602"],  
[754, "Παλιάμπελα - Θεσπρωτία", "-", "602"],  
[755, "Μεγάλος Πρίωνας - Κάσος", "-", "601"],  
[756, "Μεροβίγλι - Χάλκη", "-", "601"],  
[757, "Ψηλή Παναγιά - Αιτωλοακαρνανία", "-", "601"],  
[758, "Σουμάνι - Λακωνία", "-", "600"],  
[759, "Όνεια Όρη - Κορινθία", "Προφήτης Ηλίας", "599"],  
[760, "Πλαταριάς Βουνά - Θεσπρωτία", "Γουλγάρα", "595"],  
[761, "Βουνοκορφή (Ψηλή Βίγλα) - Αργολίδα", "-", "593"],  
[762, "Ανεμόμυλος - Ηράκλειο", "-", "592"],  
[763, "Μεγάλη Ράχη - Λακωνία", "-", "590"],  
[764, "Κορύφι - Κάρπαθος", "-", "590"],
[765, "Όψιον (Κορακόπετρα) - Λάρισα", "-", "590"],  
[766, "Παλιόπυργος - Μαγνησία, Φθιώτιδα", "-", "590"],  
[767, "Γαλατιανή - Κάλυμνος", "-", "590"],  
[768, "Άντισσας Βουνά - Λέσβος", "Κούρουκλο", "589"],  
[769, "Άγιος Ιωάννης Θεολόγος - Νίσυρος", "-", "588"],  
[770, "Άκρος - Αργολίδα", "-", "588"],  
[771, "Έρως - Ύδρα", "-", "588"],  
[772, "Αστέρι - Ζάκυνθος", "-", "583"],  
[773, "Τρούλλος - Σέριφος", "-", "583"],  
[774, "Βίγλα - Ανάφη", "-", "581"],  
[775, "Πηγαδούλα - Αιτωλοακαρνανία", "-", "581"],  
[776, "Προφήτης Ηλίας (Πρινοβούνι) - Λέσβος", "-", "581"],  
[777, "Φλαμουριά - Θεσπρωτία", "Μάλια", "580"],  
[778, "Μηλιανός - Κάλυμνος", "-", "580"],  
[779, "Πυργιά - Ηράκλειο", "-", "579"],  
[780, "Παράριο - Βοιωτία, Φθιώτιδα", "-", "577"],  
[781, "Αϊλιάς - Λακωνία", "-", "577"],  
[782, "Ακροκόρινθος - Κορινθία", "-", "575"],  
[783, "Δαμιανού Σωρός - Ηράκλειο", "-", "575"],

//ΝΑ ΠΡΟΣΤΕΘΟΥΝ ΠΕΝΤΕΣΚΟΥΦΙ ΚΑΙ ΤΑ ΥΠΟΛΟΙΠΑ, ΑΡΙΘΜΗΣΗ ΑΠΟ ΕΔΩ ΚΑΙ ΚΑΤΩ

[784, "Αιγάλεω - Αττική", "-", "468"],
[785, "Ποικίλο - Αττική", "Ζαχαρίτσα", "446"],

                      
]

const tableBody = document.getElementById('table-body');

// Here's how you can remove the first column dynamically

document.addEventListener("DOMContentLoaded", function() {
    var table = document.getElementById("myTable");
    if (table) {
      // Loop through each row and remove the first cell
      var rows = table.rows;
      for (var i = 0; i < rows.length; i++) {
        rows[i].deleteCell(0); // Delete the first cell of each row
      }
    }
  });


// Iterate through the data and create HTML rows for each entry
data.forEach(rowData => {
    const row = document.createElement('tr'); // Create a table row
    
    // Create the first cell as text content
    const firstCell = document.createElement('td');
    firstCell.textContent = rowData[0]; // Set the text content of the first cell
    row.appendChild(firstCell); // Append the first cell to the row
    
    // Create the second cell as a link
    const secondCell = document.createElement('td');
    const link = document.createElement('a');
    
    // Adjust the URL based on the row data
    if (rowData[1] === "Όλυμπος - Λάρισα, Πιερία") {
        link.href = "Ολυμπος.html";
    } else if (rowData[1] === "Σμόλικας - Ιωάννινα") {
        link.href = "Σμολικας.html";
    } else if (rowData[1] === "Γράμμος - Ιωάννινα, Καστοριά") {
        link.href = "Γραμμος.html";
    } else if (rowData[1] === "Ψηλορείτης (Ίδη) - Ηράκλειο, Ρέθυμνο") {
        link.href = "Ψηλορειτης.html";
    } else if (rowData[1] === "Λευκά Όρη (Μαδάρες) - Χανιά") {
        link.href = "Λευκα Ορη.html";
    } else if (rowData[1] === "Κακαρδίτσα - Ιωάννινα, Τρίκαλα, Άρτα") {
        link.href = "Κακαρδιτσα.html";
    } else if (rowData[1] === "Ταΰγετος - Λακωνία, Μεσσηνία") {
        link.href = "Ταυγετος.html";
    } else if (rowData[1] === "Ζήρεια (Κυλλήνη) - Κορινθία") {
        link.href = "Ζηρεια.html";
    } else if (rowData[1] === "Χελμός (Αροάνια) - Αχαΐα") {
        link.href = "Χελμος.html";
    } else if (rowData[1] === "Βασιλίτσα - Γρεβενά, Ιωάννινα") {
        link.href = "Βασιλιτσα.html";
    } else if (rowData[1] === "Περιστέρι (Λάκμος) - Ιωάννινα, Τρίκαλα") {
        link.href = "Λακμος.html";
    } else if (rowData[1] === "Φαλακρό (Μποζ Νταγ) - Δράμα") {
        link.href = "Φαλακρο.html";
    } else if (rowData[1] === "Δοκίμι (Δοκίμι Χαλικίου) - Ιωάννινα, Τρίκαλα") {
        link.href = "Δοκιμι.html";
    } else if (rowData[1] === "Τίταρος (Μικρό Φλάμπουρο) - Κοζάνη, Λάρισα") {
        link.href = "Τιταρος.html";
    } else if (rowData[1] === "Βουνά Κάρδαμου - Ροδόπη") {
        link.href = "ΒουναΚαρδαμου.html";
    } else if (rowData[1] === "Βουνά Κύμης - Ροδόπη") {
        link.href = "ΒουναΚυμης.html";
    } else if (rowData[1] === "Ιερό (Μπουκατέ Νταγ) - Έβρος, Ροδόπη") {
        link.href = "Ιερο.html";
    } else if (rowData[1] === "Ορφέας - Έβρος, Ροδόπη") {
        link.href = "Ορφεας.html";
    } else if (rowData[1] === "Βουνά Καλότυχου - Ξάνθη") {
        link.href = "ΒουναΚαλοτυχου.html";
    } else if (rowData[1] === "Βουνά Οργάνης - Ροδόπη") {
        link.href = "ΒουναΟργανης.html";
    } else if (rowData[1] === "Βουνά Μύτικα - Ροδόπη") {
        link.href = "ΒουναΜυτικα.html";
    } else if (rowData[1] === "Σάπκα - Ροδόπη, Έβρος") {
        link.href = "Σαπκα.html";
    } else if (rowData[1] === "Χαράκωμα (Σίλο) - Έβρος, Ροδόπη") {
        link.href = "Χαρακωμα.html";
    } else if (rowData[1] === "Αχλάτ Τσαλ (Αχλαδόβουνο) - Ξάνθη") {
        link.href = "ΑχλαΤσαλ.html";
    } else if (rowData[1] === "Καμερτζή (Μαυροπαίδι, Καρά Ογλάν) - Ξάνθη") {
        link.href = "Καμερτζη.html";
    } else if (rowData[1] === "Όρη Μελίβοιας - Ξάνθη") {
        link.href = "ΟρηΜελιβοιας.html";
    } else if (rowData[1] === "Όρη Θερμών - Ξάνθη") {
        link.href = "ΟρηΘερμων.html";
    } else if (rowData[1] === "Φινέας - Ξάνθη") {
        link.href = "Φινεας.html";
    } else if (rowData[1] === "Θρακικά Μετέωρα - Ροδόπη") {
        link.href = "ΘρακικαΜετεωρα.html";
    } else if (rowData[1] === "Μέλτη - Ξάνθη") {
        link.href = "Μελτη.html";
    } else if (rowData[1] === "Παπίκιο (Καρλίκ Νταγ) - Ροδόπη") {
        link.href = "Παπικιο.html";
    } else if (rowData[1] === "Μαύρο Ίσιωμα - Ξάνθη") {
        link.href = "ΜαυροΙσιωμα.html";
    } else if (rowData[1] === "Γεράνεια - Ξάνθη") {
        link.href = "ΓερανειαΚορυφη.html";
    } else if (rowData[1] === "Αυγό (Σταύρος Τσακίρης) - Ξάνθη") {
        link.href = "ΣταυροςΤσακιρης.html";
    } else if (rowData[1] === "Στάμνα (Τζούρα, Κουσλάρι, Κιτρινοβούνι, Ψήλωμα) - Δράμα") {
        link.href = "ΣταμναΡοδοπη.html";
    } else if (rowData[1] === "Ερμάριο - Ξάνθη") {
        link.href = "Ερμαριο.html";
    } else if (rowData[1] === "Χαϊντού (Ερύμανθος, Γυφτόκαστρο) - Δράμα, Ξάνθη") {
        link.href = "Χαιντου.html";
    } else if (rowData[1] === "Μπρινιάς (Δρυζές, Πρινιάς) - Λασίθι") {
        link.href = "Μπρινιας.html";
    } else if (rowData[1] === "Ασφεντιλιάς (Ανατολικά Αστερούσια) - Ηράκλειο") {
        link.href = "Ασφεντιλιας.html";
    } else if (rowData[1] === "Πλαγιές (Βουνά Ζίρου) - Λασίθι") {
        link.href = "Πλαγιες.html";
    } else if (rowData[1] === "Αστερούσια Όρη - Ηράκλειο") {
        link.href = "Αστερουσια.html";
    } else if (rowData[1] === "Κουλούκωνας (Ταλλαία Όρη) - Ρέθυμνο") {
        link.href = "Κουλουκωνας.html";
    } else if (rowData[1] === "Οξύ Κεφάλι - Ηράκλειο") {
        link.href = "ΟξυΚεφαλι.html";
    } else if (rowData[1] === "Γιούχτας - Ηράκλειο") {
        link.href = "Γιουχτας.html";
    } else if (rowData[1] === "Στρούμπουλας - Ηράκλειο") {
        link.href = "Στρουμπουλας.html";
    } else if (rowData[1] === "Βρύσινας - Ρέθυμνο") {
        link.href = "Βρυσινας.html";
    } else if (rowData[1] === "Βουβάλα - Ρέθυμνο") {
        link.href = "Βουβαλα.html";
    } else if (rowData[1] === "Κουρούπα - Ρέθυμνο") {
        link.href = "Κουρουπα.html";
    } else if (rowData[1] === "Καψάς - Λασίθι") {
        link.href = "Καψας.html";
    } else if (rowData[1] === "Δίκτη (Λασιθιώτικα Βουνά) - Ηράκλειο, Λασίθι") {
        link.href = "Δικτη.html";
    } else if (rowData[1] === "Κέδρος (Ανάληψη) - Ρέθυμνο") {
        link.href = "Κεδρος.html";
    } else if (rowData[1] === "Ψηλορείτης (Ίδη) - Ηράκλειο, Ρέθυμνο") {
        link.href = "Ψηλορειτης.html";
    } else if (rowData[1] === "Λευκά Όρη (Μαδάρες) - Χανιά") {
        link.href = "ΛευκαΟρη.html";
    } else if (rowData[1] === "Σελένα - Ηράκλειο, Λασίθι") {
        link.href = "Σελενα.html";
    } else if (rowData[1] === "Μονοδένδρι - Ηράκλειο") {
        link.href = "Μονοδενδρι.html";
    } else if (rowData[1] === "Καταλύματα - Λασίθι") {
        link.href = "Καταλυματα.html";
    } else if (rowData[1] === "Πλακάκια - Χανιά") {
        link.href = "Πλακακια.html";
    } else if (rowData[1] === "Ξηρό - Ρέθυμνο") {
        link.href = "Ξηρο.html";
    } else if (rowData[1] === "Ρωμανάτη - Λασίθι") {
        link.href = "Ρωμανατη.html";
    } else if (rowData[1] === "Κουτρούλης - Χανιά") {
        link.href = "Κουτρουλης.html";
    }  else if (rowData[1] === "Μεγάλη Κορυφή - Λασίθι") {
        link.href = "ΜεγαληΚορυφη.html";
    }  else if (rowData[1] === "Κουτρούλης - Χανιά") {
        link.href = "Κουτρουλης.html";
    } else if (rowData[1] === "Τουρλί (Τρουλλί) - Χανιά") {
        link.href = "Τουρλι.html";
    } else if (rowData[1] === "Κρανιά - Αχαΐα") {
        link.href = "Κρανια.html";
    } else if (rowData[1] === "Σάμιτος - Ρέθυμνο") {
        link.href = "Σαμιτος.html";
    } else if (rowData[1] === "Κατσονύχι - Ρέθυμνο") {
        link.href = "Κατσονυχι.html";
    } else if (rowData[1] === "Λουλουδάκης - Ηράκλειο, Λασίθι") {
        link.href = "Λουλουδακης.html";
    } else if (rowData[1] === "Σιδέρωτας (Ασιδέρωτο, Ανάληψη) - Ρέθυμνο") {
        link.href = "Σιδερωτας.html";
    } else if (rowData[1] === "Άγιος Δίκαιος - Χανιά") {
        link.href = "ΑγιοςΔικαιος.html";
    } else if (rowData[1] === "Αποπηγάδι - Χανιά") {
        link.href = "Αποπηγαδι.html";
    } else if (rowData[1] === "Θρυπτή (Αφέντης Σταυρωμένος) - Λασίθι") {
        link.href = "ΟρηΘρυπτης.html";
    } else if (rowData[1] === "Πλατιά Κορφή (Ανεφαλάκος) - Λασίθι") {
        link.href = "ΠλατιαΚορφη.html";
    } else if (rowData[1] === "Αγκαθές (Χορεύτρες) - Χανιά") {
        link.href = "Αγκαθες.html";
    } else if (rowData[1] === "Σαρακηνός - Ηράκλειο, Λασίθι") {
        link.href = "Σαρακηνος.html";
    } else if (rowData[1] === "Βολακιάς - Χανιά") {
        link.href = "Βολακιας.html";
    } else if (rowData[1] === "Ορνό - Λασίθι") {
        link.href = "Ορνο.html";
    } else if (rowData[1] === "Σητειακά Όρη- Λασίθι") {
        link.href = "ΣητειακαΟρη.html";
    } else if (rowData[1] === "Κορυφή Ξενογιώργη - Λασίθι") {
        link.href = "Ξενογιωργη.html";
    } else if (rowData[1] === "Καλόν Ορος - Κεφαλληνία") {
        link.href = "ΚαλονΟρος.html";
    } else if (rowData[1] === "Καστρί - Κεφαλληνία") {
        link.href = "Καστρι.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Ρόδος") {
        link.href = "ΠροφητηςΗλιαςΡοδου.html";
    } else if (rowData[1] === "Νήριτο Όρος - Ιθάκη") {
        link.href = "ΝηριτοΟρος.html";
    } else if (rowData[1] === "Αμανή - Χίος") {
        link.href = "Αμανη.html";
    } else if (rowData[1] === "Σπηλακιά (Αίπος, Κοχλιός) - Χίος") {
        link.href = "Σπηλακια.html";
    } else if (rowData[1] === "Αυγό - Κεφαλληνία") {
        link.href = "ΑυγοΚεφαλλονιας.html";
    } else if (rowData[1] === "Όλυμπος - Λέσβος") {
        link.href = "ΟλυμποςΛεσβου.html";
    } else if (rowData[1] === "Λεπέτυμνος Αγιολιάς - Λέσβος") {
        link.href = "Λεπετυμνος.html";
    } else if (rowData[1] === "Λάστος - Κάρπαθος") {
        link.href = "Λαστος.html";
    } else if (rowData[1] === "Υψάριο (Ψαριό) - Θάσος") {
        link.href = "Υψαριο.html";
    } else if (rowData[1] === "Άγιος Ηλίας - Λευκάδα") {
        link.href = "ΑγιοςΗλιας.html";
    } else if (rowData[1] === "Αγία Δυνατή - Κεφαλληνία") {
        link.href = "ΑγιαΔυνατη.html";
    } else if (rowData[1] === "Καρβούνης - Σάμος") {
        link.href = "Καρβουνης.html";
    } else if (rowData[1] === "Ζας (Ζευς) - Νάξος") {
        link.href = "Ζας.html";
    } else if (rowData[1] === "Κορωνός - Νάξος") {
        link.href = "Κορωνος.html";
    } else if (rowData[1] === "Κουβάρα - Ανδρος") {
        link.href = "Κουβαρα.html";
    } else if (rowData[1] === "Ακραμύτης - Ρόδος") {
        link.href = "Ακραμυτης.html";
    } else if (rowData[1] === "Κρούκελλος - Αμοργός") {
        link.href = "Κρουκελλος.html";
    } else if (rowData[1] === "Δίκαιος - Κως") {
        link.href = "Δικαιος.html";
    } else if (rowData[1] === "Φανάρι - Νάξος") {
        link.href = "Φαναρι.html";
    } else if (rowData[1] === "Άτρος - Κεφαλληνία") {
        link.href = "Ατρος.html";
    } else if (rowData[1] === "Παντοκράτωρ - Κέρκυρα") {
        link.href = "Παντοκρατωρ.html";
    } else if (rowData[1] === "Ημεροβίγλι (Μεροβίγλι) - Κεφαλληνία") {
        link.href = "Ημεροβιγλι.html";
    } else if (rowData[1] === "Αθέρας - Ικαρία") {
        link.href = "Αθερας.html";
    } else if (rowData[1] === "Μέλισσα - Ικαρία") {
        link.href = "Μελισσα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Λέσβος") {
        link.href = "ΠροφητηςΗλιαςΛεσβου.html";
    } else if (rowData[1] === "Σάος - Σαμοθράκη") {
        link.href = "Σαος.html";
    } else if (rowData[1] === "Αίνος - Κεφαλληνία") {
        link.href = "Αινος.html";
    } else if (rowData[1] === "Αττάβυρος - Ρόδος") {
        link.href = "Ατταβυρος.html";
    } else if (rowData[1] === "Πελινναίον - Χίος") {
        link.href = "Πελινναιον.html";
    } else if (rowData[1] === "Κερκετεύς (Κέρκης) - Σάμος") {
        link.href = "Κερκετευς.html";
    } else if (rowData[1] === "Κρυονερίτης - Ρέθυμνο") {
        link.href = "Κρυονεριτης.html";
    } else if (rowData[1] === "Ξηχόρτι - Ηλεία") {
        link.href = "Ξηχορτι.html";
    } else if (rowData[1] === "Σουρμπάς - Αχαΐα") {
        link.href = "Σουρμπας.html";
    } else if (rowData[1] === "Άγιος Κωνσταντίνος - Λακωνία") {
        link.href = "ΑγιοςΚωνσταντινοςΛακ.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B - Μεσσηνία") {
        link.href = "ΠροφητηςΗλιαςMess.html";
    } else if (rowData[1] === "Ράχη - Αργολίδα") {
        link.href = "Ραχη.html";
    } else if (rowData[1] === "Μπούρα - Μεσσηνία") {
        link.href = "Μπουρα.html";
    } else if (rowData[1] === "Βουνό Ρούσσου (Ρούσο Βουνό) - Λακωνία") {
        link.href = "ΒουνοΡουσσου.html";
    } else if (rowData[1] === "Νεραϊδοβούνι - Αχαΐα") {
        link.href = "Νεραιδοβουνι.html";
    } else if (rowData[1] === "Εκκλησάκι - Κορινθία") {
        link.href = "Εκκλησακι.html";
    } else if (rowData[1] === "Ευαγγελίστρια - Κορινθία") {
        link.href = "Ευαγγελιστρια.html";
    } else if (rowData[1] === "Λάκκα Κοκκίνη (Κερνίκελο, Μάλια Λένι) - Αργολίδα, Κορινθία") {
        link.href = "ΛακκαΚοκκινη.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αρκαδία") {
        link.href = "ΠροφητηςΗλιας1117.html";
    } else if (rowData[1] === "Όρη Τροπαίων - Αρκαδία") {
        link.href = "ΟρηΤροπαιων.html";
    } else if (rowData[1] === "Δρακοβούνι - Αρκαδία") {
        link.href = "Δρακοβουνι.html";
    } else if (rowData[1] === "Καλογεροβούνι - Λακωνία") {
        link.href = "Καλογεροβουνι.html";
    } else if (rowData[1] === "Τριαντάφυλλα - Αρκαδία") {
        link.href = "Τριανταφυλλα.html";
    } else if (rowData[1] === "Άγιος Κωνσταντίνος - Αρκαδία") {
        link.href = "ΑγιοςΚωνσταντινοςΑρκαδιας.html";
    } else if (rowData[1] === "Αλογομάνδρα - Αρκαδία, Λακωνία") {
        link.href = "Αλογομανδρα.html";
    } else if (rowData[1] === "Μακρυλάκκωμα - Λακωνία") {
        link.href = "Μακρυλακκωμα.html";
    } else if (rowData[1] === "Σγουριάς - Αρκαδία") {
        link.href = "Σγουριας.html";
    } else if (rowData[1] === "Κακοβούνια - Λακωνία") {
        link.href = "Κακοβουνια.html";
    } else if (rowData[1] === "Βερντάτση - Μεσσηνία") {
        link.href = "Βερντατση.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αρκαδία") {
        link.href = "ΠροφητηςΗλιας850.html";
    } else if (rowData[1] === "Άγιοι Ασώματοι - Αχαΐα") {
        link.href = "ΑγιοιΑσωματοι.html";
    } else if (rowData[1] === "Κεραύσιον Όρος (Ματεσαίικο Βουνό) - Ηλεία") {
        link.href = "ΚεραυσιονΟρος.html";
    } else if (rowData[1] === "Μαυροβούνι - Αργολίδα") {
        link.href = "Μαυροβουνι.html";
    } else if (rowData[1] === "Δροσοβούνι - Αρκαδία") {
        link.href = "Δροσοβουνι.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B - Αχαΐα") {
        link.href = "ΠροφητηςΗλιας1142.html";
    } else if (rowData[1] === "Καστέλλια - Αχαΐα") {
        link.href = "Καστελλια.html";
    } else if (rowData[1] === "Κράβαρης (Γκράβαρης, Βόρειον) - Αρκαδία") {
        link.href = "Κραβαρης.html";
    } else if (rowData[1] === "Άγιος Χριστόφορος - Αρκαδία") {
        link.href = "ΑγιοςΧριστοφοροςΑρκαδιας.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αρκαδία") {
        link.href = "ΠροφητηςΗλιας1119.html";
    } else if (rowData[1] === "Κουλοχέρα - Λακωνία") {
        link.href = "Κουλοχερα.html";
    } else if (rowData[1] === "Κούκουρας - Αρκαδία") {
        link.href = "Κουκουρας.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Αχαΐα") {
        link.href = "ΠροφητηςΗλιας808.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αχαΐα") {
        link.href = "ΠροφητηςΗλιαςΑχαια754.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Μεσσηνία") {
        link.href = "ΠροφητηςΗλιας1006.html";
    } else if (rowData[1] === "Τουρτούλα - Αρκαδία") {
        link.href = "Τουρτουλα.html";
    } else if (rowData[1] === "Στρογγυλοβούνι (Καστανοβούνι) - Κορινθία") {
        link.href = "Στρογγυλοβουνι.html";
    } else if (rowData[1] === "Παραβουνάκι - Αργολίδα") {
        link.href = "Παραβουνακι.html";
    } else if (rowData[1] === "Δραγουνέρα (Πιτσαδέικο Βουνό, Σωτήρα) - Κορινθία") {
        link.href = "Δραγουνερα.html";
    } else if (rowData[1] === "Κουτρούφι - Αρκαδία") {
        link.href = "Κουτρουφι.html";
    } else if (rowData[1] === "Πικερνιώτικο - Αρκαδία") {
        link.href = "Πικερνιωτικο.html";
    } else if (rowData[1] === "Βουνά Χαλανδρίτσας - Αχαΐα") {
        link.href = "ΒουναΧαλανδριτσας.html";
    } else if (rowData[1] === "Γαϊδουροβούνι - Λακωνία") {
        link.href = "Γαιδουροβουνι.html";
    } else if (rowData[1] === "Βέσιζα - Κορινθία") {
        link.href = "Βεσιζα.html";
    } else if (rowData[1] === "Καστανιά - Αρκαδία") {
        link.href = "Καστανια.html";
    } else if (rowData[1] === "Τσεμπερού - Αρκαδία") {
        link.href = "Τσεμπερου.html";
    } else if (rowData[1] === "Ρεζενίκος - Αρκαδία") {
        link.href = "Ρεζενικος.html";
    } else if (rowData[1] === "Βρωμοβρυσέικα Βουνά - Μεσσηνία") {
        link.href = "ΒρωμοβρυσεικαΒουνα.html";
    } else if (rowData[1] === "Άγιος Γεώργιος - Αρκαδία") {
        link.href = "ΑγιοςΓεωργιοςΑρκαδιας.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B - Αχαΐα") {
        link.href = "ΠροφητηςΗλιας1338.html";
    } else if (rowData[1] === "Βύθουλας (Βίτουλα) - Αρκαδία") {
        link.href = "Βυθουλας.html";
    } else if (rowData[1] === "Ζέμπη - Αχαΐα") {
        link.href = "Ζεμπη.html";
    } else if (rowData[1] === "Σκιαδοβούνι - Αχαΐα, Ηλεία") {
        link.href = "Σκιαδοβουνι.html";
    } else if (rowData[1] === "Ψηλό Βουνό - Αρκαδία") {
        link.href = "ΨηλοΒουνοΑρκαδιας.html";
    } else if (rowData[1] === "Άγιος Αθανάσιος (Βουνό Μαμαλούκας) - Αχαΐα") {
        link.href = "ΒουνοΜαμαλουκας.html";
    } else if (rowData[1] === "Σκεπαστό (Όρος Κερύνεια) - Αχαΐα") {
        link.href = "Σκεπαστο.html";
    } else if (rowData[1] === "Μπαρμπάς - Αχαΐα") {
        link.href = "Μπαρμπας.html";
    } else if (rowData[1] === "Τρεις Γυναίκες - Αχαΐα") {
        link.href = "ΤρειςΓυναικες.html";
    } else if (rowData[1] === "Ρούσκιο - Αχαΐα") {
        link.href = "Ρουσκιο.html";
    } else if (rowData[1] === "Τάρταρης - Αχαΐα") {
        link.href = "Ταρταρης.html";
    } else if (rowData[1] === "Λύκαιον Όρος - Αρκαδία, Μεσσηνία") {
        link.href = "ΛυκαιονΟρος.html";
    } else if (rowData[1] === "Τετράζι (Νόμια Όρη) - Αρκαδία, Μεσσηνία") {
        link.href = "Τετραζι.html";
    } else if (rowData[1] === "Αργυρόκαστρο - Αρκαδία") {
        link.href = "Αργυροκαστρο.html";
    } else if (rowData[1] === "Γορτυνιακά Όρη - Αρκαδία") {
        link.href = "ΓορτυνιακαΟρη.html";
    } else if (rowData[1] === "Αραχναίο - Αργολίδα") {
        link.href = "Αραχναιο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Βελανιδιά, Κυνόρτιον) - Αργολίδα") {
        link.href = "Κυνορτιον.html";
    } else if (rowData[1] === "Πετραλώνι - Μεσσηνία") {
        link.href = "Πετραλωνι.html";
    } else if (rowData[1] === "Ιθώμη - Μεσσηνία") {
        link.href = "Ιθωμη.html";
    } else if (rowData[1] === "Φολόη - Ηλεία") {
        link.href = "Φολοη.html";
    } else if (rowData[1] === "Χαρβάτι - Αργολίδα, Κορινθία") {
        link.href = "Χαρβατι.html";
    } else if (rowData[1] === "Παρθένι - Αργολίδα, Αρκαδία") {
        link.href = "Παρθενι.html";
    } else if (rowData[1] === "Τρίκορφο (Βουνά Δερβενακίων) - Αργολίδα") {
        link.href = "Τρικορφο.html";
    } else if (rowData[1] === "Ντουρντουβάνα (Πεντέλεια) - Αχαΐα, Κορινθία") {
        link.href = "Ντουρντουβανα.html";
    } else if (rowData[1] === "Μαρμάτι (Νεραϊδόρραχη) - Αχαΐα") {
        link.href = "Μαρματι.html";
    } else if (rowData[1] === "Παναχαϊκό Όρος (Βοϊδιάς) - Αχαΐα") {
        link.href = "Παναχαικο.html";
    } else if (rowData[1] === "Φαρμακάς (Αβυζές) - Αργολίδα") {
        link.href = "Φαρμακας.html";
    } else if (rowData[1] === "Μεγαλοβούνι - Αργολίδα, Κορινθία") {
        link.href = "Μεγαλοβουνι.html";
    } else if (rowData[1] === "Σανταμέρι (Σκόλλις, Πορτέικο, Πορτοβούνι) - Αχαΐα") {
        link.href = "Σανταμερι.html";
    } else if (rowData[1] === "Σαγγιάς - Λακωνία") {
        link.href = "Σαγγιας.html";
    } else if (rowData[1] === "Αιγάλεω (Όρη Κυπαρισσίας) - Μεσσηνία") {
        link.href = "ΑιγαλεωΚυπαρισσιας.html";
    } else if (rowData[1] === "Χιονοβούνι - Λακωνία") {
        link.href = "Χιονοβουνι.html";
    } else if (rowData[1] === "Τούρλα (Λιβαδάκι) - Αχαΐα, Κορινθία") {
        link.href = "Τουρλα.html";
    } else if (rowData[1] === "Φουκάς - Κορινθία") {
        link.href = "Φουκας.html";
    } else if (rowData[1] === "Ομπλός - Αχαΐα") {
        link.href = "Ομπλος.html";
    } else if (rowData[1] === "Κουρκούλα (Στρογγύλο) - Λακωνία") {
        link.href = "Κουρκουλα.html";
    } else if (rowData[1] === "Μακροβούνι (Μαυροβούνι) - Γρεβενά") {
        link.href = "Μακροβουνι.html";
    } else if (rowData[1] === "Λυκόδημο Όρος - Μεσσηνία") {
        link.href = "Λυκοδημο.html";
    } else if (rowData[1] === "Τούρλα - Αργολίδα, Αρκαδία") {
        link.href = "ΤουρλαΑργολιδας.html";
    } else if (rowData[1] === "Αφροδίσιο - Αρκαδία, Αχαΐα") {
        link.href = "Αφροδισιο.html";
    } else if (rowData[1] === "Μελιδόνι (Αη-Λιάς) - Αργολίδα") {
        link.href = "Μελιδονι.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Αηλιάς, Μελίσσι) - Αχαΐα") {
        link.href = "Αηλιας.html";
    } else if (rowData[1] === "Μπουχουμέρα (Μπουκουμέρα) - Αχαΐα") {
        link.href = "Μπουχουμερα.html";
    } else if (rowData[1] === "Καλάθιο - Μεσσηνία") {
        link.href = "Καλαθιο.html";
    } else if (rowData[1] === "Όρη Λαγκαδιών - Αρκαδία") {
        link.href = "ΟρηΛαγκαδιων.html";
    } else if (rowData[1] === "Μίνθη (Άλβαινα, Άλβενα) - Ηλεία") {
        link.href = "Μινθη.html";
    } else if (rowData[1] === "Σερβόβουνο - Αρκαδία") {
        link.href = "Σερβοβουνο.html";
    } else if (rowData[1] === "Όνεια Όρη - Κορινθία") {
        link.href = "ΟνειαΟρη.html";
    } else if (rowData[1] === "Μαδερό - Αχαΐα, Κορινθία") {
        link.href = "Μαδερο.html";
    } else if (rowData[1] === "Χτενιάς (Κτενιάς, Κρύον Όρος) - Αργολίδα, Αρκαδία") {
        link.href = "Χτενιας.html";
    } else if (rowData[1] === "Άγιος Ηλίας - Αρκαδία") {
        link.href = "ΑγιοςΗλιαςΑρκαδιας.html";
    } else if (rowData[1] === "Ζάβιτσα (Τιμένιον Όρος) - Αργολίδα, Αρκαδία") {
        link.href = "Ζαβιτσα.html";
    } else if (rowData[1] === "Νυφίτσα - Κορινθία") {
        link.href = "Νυφιτσα.html";
    } else if (rowData[1] === "Ορθολίθι - Αργολίδα") {
        link.href = "Ορθολιθι.html";
    } else if (rowData[1] === "Σταυραετός - Κορινθία") {
        link.href = "Σταυραετος.html";
    } else if (rowData[1] === "Δίδυμο (Δίδυμα, Κονί) - Αργολίδα") {
        link.href = "Διδυμο.html";
    } else if (rowData[1] === "Τραπεζώνα - Αργολίδα, Κορινθία") {
        link.href = "Τραπεζωνα.html";
    } else if (rowData[1] === "Μαγκλάβι - Μεσσηνία") {
        link.href = "Μαγκλάβι.html";
    } else if (rowData[1] === "Γαβριάς - Κορινθία") {
        link.href = "Γαβριας.html";
    } else if (rowData[1] === "Μαδάρα - Αρκαδία, Λακωνία") {
        link.href = "Μαδαρα.html";
    } else if (rowData[1] === "Λάμπεια - Ηλεία") {
        link.href = "Λαμπεια.html";
    } else if (rowData[1] === "Λύρκειο (Φραγκοκούκουρα) - Αργολίδα, Αρκαδία") {
        link.href = "Λυρκειο.html";
    } else if (rowData[1] === "Αρτεμίσιο - Αργολίδα, Αρκαδία") {
        link.href = "Αρτεμισιο.html";
    } else if (rowData[1] === "Μαύρο Όρος (Μαυρονόρος, Προφήτης Ηλίας) - Κορινθία") {
        link.href = "ΜαυροΟρος.html";
    } else if (rowData[1] === "Κλωκός (Φτέρη, Παναγία) - Αχαΐα") {
        link.href = "Κλωκος.html";
    } else if (rowData[1] === "Σκίαθις (Καταφύγιο, Ζάρα) - Αργολίδα, Αρκαδία") {
        link.href = "Σκιαθις.html";
    } else if (rowData[1] === "Σαϊτάς (Όρυξις) - Κορινθία, Αρκαδία, Αχαΐα") {
        link.href = "Σαιτας.html";
    } else if (rowData[1] === "Δυτικό Μαίναλο - Αρκαδία") {
        link.href = "ΔυτικοΜαιναλο.html";
    } else if (rowData[1] === "Χελμός (Αροάνια) - Αχαΐα") {
        link.href = "Χελμος.html";
    } else if (rowData[1] === "Ερύμανθος - Αχαΐα") {
        link.href = "Ερυμανθος.html";
    } else if (rowData[1] === "Γερόντιο Όρος - Κορινθία") {
        link.href = "Γεροντιο.html";
    } else if (rowData[1] === "Ζήρεια (Κυλλήνη) - Κορινθία") {
        link.href = "Ζηρεια.html";
    } else if (rowData[1] === "Τραχύ (Καρούμπαλο) - Αργολίδα, Αρκαδία") {
        link.href = "Τραχυ.html";
    } else if (rowData[1] === "Ολίγυρτος - Αργολίδα, Αρκαδία, Κορινθία") {
        link.href = "Ολιγυρτος.html";
    } else if (rowData[1] === "Πάρνωνας (Μαλεβός) - Αρκαδία, Λακωνία") {
        link.href = "Παρνωνας.html";
    } else if (rowData[1] === "Ταΰγετος - Λακωνία, Μεσσηνία") {
        link.href = "Ταυγετος.html";
    } else if (rowData[1] === "Μαίναλο - Αρκαδία") {
        link.href = "Μαιναλο.html";
    } else if (rowData[1] === "Μάρτσα - Ευρυτανία, Καρδίτσα") {
        link.href = "Μαρτσα.html";
    } else if (rowData[1] === "Βουλγάρα (Άγραφα) - Ευρυτανία, Καρδίτσα") {
        link.href = "ΒουλγαραΕυρυτανιας.html";
    } else if (rowData[1] === "Ντεληδήμι (Αυγό, Τσουρνάτα) (Άγραφα) - Καρδίτσα, Ευρυτανία") {
        link.href = "Ντεληδημι.html";
    } else if (rowData[1] === "Μπορλέρο (Μπουρλέρος) (Άγραφα) - Ευρυτανία, Καρδίτσα") {
        link.href = "Μπορλερο.html";
    } else if (rowData[1] === "Πύργος - Ευρυτανία, Καρδίτσα") {
        link.href = "ΠυργοςΕυρυτανιας1804.html";
    } else if (rowData[1] === "Φλυτζάνι (Καλύβια, Νιάλα) - Ευρυτανία, Καρδίτσα") {
        link.href = "Φλυτζανι.html";
    } else if (rowData[1] === "Βουλγάρα - Λάρισα, Πιερία") {
        link.href = "ΒουλγαραΛαρισας.html";
    } else if (rowData[1] === "Αρχοντική (Αμάρμπεης) - Κοζάνη, Λάρισα") {
        link.href = "Αρχοντικη.html";
    } else if (rowData[1] === "Χλωμό - Μαγνησία") {
        link.href = "Χλωμο.html";
    } else if (rowData[1] === "Κατάχλωμο (Κατάχλωρο, Ταμάσιον Όρος) - Καρδίτσα") {
        link.href = "Καταχλωμο.html";
    } else if (rowData[1] === "Τρόχαλος - Λάρισα") {
        link.href = "Τροχαλος.html";
    } else if (rowData[1] === "Παπαλίβαδο - Λάρισα") {
        link.href = "Παπαλιβαδο.html";
    } else if (rowData[1] === "Σουλιώτης - Κοζάνη, Λάρισα") {
        link.href = "Σουλιωτης.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Παλιοαηλιάς, Άτυνο Μύλο) - Λάρισα") {
        link.href = "ΠροφητηςΗλιαςΛαρισας.html";
    } else if (rowData[1] === "Κουκουργιάκος (Κοκκοριάκος) - Καρδίτσα") {
        link.href = "Κουκουργιακος.html";
    } else if (rowData[1] === "Μαυροβούνι (Σκούτλη) - Λάρισα") {
        link.href = "ΜαυροβουνιΛαρισας.html";
    } else if (rowData[1] === "Ψηλή Ράχη - Καρδίτσα") {
        link.href = "ΨηληΡαχηΚαρδιτσας.html";
    } else if (rowData[1] === "Αμάραντος - Καρδίτσα") {
        link.href = "Αμαραντος.html";
    } else if (rowData[1] === "Ίταμος (Τσιούκα) (Άγραφα) - Καρδίτσα") {
        link.href = "ΙταμοςΤσιουκα.html";
    } else if (rowData[1] === "Ράχη Κούτρα - Λάρισα") {
        link.href = "ΡαχηΚουτρα.html";
    } else if (rowData[1] === "Κονισκός (Παγκάκαινα) - Τρίκαλα") {
        link.href = "Κονισκος.html";
    } else if (rowData[1] === "Αντιχάσια (Ράχη Τσέτσιλα, Μαμαλή) - Λάρισα, Τρίκαλα") {
        link.href = "Αντιχασια.html";
    } else if (rowData[1] === "Καπροβούνι (Άγραφα) - Καρδίτσα") {
        link.href = "Καπροβουνι.html";
    } else if (rowData[1] === "Αμμουτσέλος (Αμοντζέλος) - Τρίκαλα") {
        link.href = "Αμμουτσελος.html";
    } else if (rowData[1] === "Ίταμος - Καρδίτσα, Τρίκαλα") {
        link.href = "ΙταμοςΤρικαλων.html";
    } else if (rowData[1] === "Μυρμιτζάλα (Μυρμηγκιά) - Καρδίτσα") {
        link.href = "Μυρμιτζαλα.html";
    } else if (rowData[1] === "Χάσια - Τρίκαλα") {
        link.href = "Χασια.html";
    } else if (rowData[1] === "Κορυφή - Τρίκαλα") {
        link.href = "ΚορυφηΤρικαλων.html";
    } else if (rowData[1] === "Λυκοζόρι (Τσέβροχο) - Τρίκαλα") {
        link.href = "Λυκοζορι.html";
    } else if (rowData[1] === "Πυργούλι - Καρδίτσα") {
        link.href = "Πυργουλι.html";
    } else if (rowData[1] === "Λεωνίδας - Τρίκαλα") {
        link.href = "Λεωνιδας.html";
    } else if (rowData[1] === "Αγούρος - Τρίκαλα") {
        link.href = "Αγουρος.html";
    } else if (rowData[1] === "Πυραμίδα (Μετερίζια) - Λάρισα, Τρίκαλα") {
        link.href = "Πυραμιδα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Άγιος Ηλίας) - Τρίκαλα") {
        link.href = "ΠροφητηςΗλιαςΑγιοςΗλιαςΤρικαλων.html";
    } else if (rowData[1] === "Βουτσικάκι (Γκαβέλ) (Άγραφα) - Καρδίτσα") {
        link.href = "Βουτσικακι.html";
    } else if (rowData[1] === "Χατζή - Τρίκαλα") {
        link.href = "ΧατζηΤρικαλων.html";
    } else if (rowData[1] === "Δοκίμι Παχτουρίου (Τσιγκάρι, Τσουγκότι) - Τρίκαλα") {
        link.href = "ΔοκιμιΠαχτουριου.html";
    } else if (rowData[1] === "Παπαδημήτρης (Άγραφα) - Καρδίτσα") {
        link.href = "Παπαδημητρης.html";
    } else if (rowData[1] === "Καραβούλα (Άγραφα) - Καρδίτσα, Τρίκαλα") {
        link.href = "Καραβουλα.html";
    } else if (rowData[1] === "Γαλάτσι (Ασήμι) (Άγραφα) - Καρδίτσα") {
        link.href = "Γαλατσι.html";
    } else if (rowData[1] === "Μοράβα (Κυνηγός) - Τρίκαλα") {
        link.href = "Μοραβα.html";
    } else if (rowData[1] === "Σουφλί (Μπούτσος) - Καρδίτσα") {
        link.href = "Σουφλι.html";
    } else if (rowData[1] === "Κέδρος (Τρία Σύνορα) - Τρίκαλα") {
        link.href = "ΚεδροςΤρικαλων.html";
    } else if (rowData[1] === "Κατούνα (Καυκιά, Τούρλα) - Καρδίτσα, Τρίκαλα") {
        link.href = "Κατουνα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Βερούσια) - Καρδίτσα") {
        link.href = "Βερουσια.html";
    } else if (rowData[1] === "Μαυροπούλι - Τρίκαλα") {
        link.href = "Μαυροπουλι.html";
    } else if (rowData[1] === "Χαλικόβουνο (Νεράιδα, Μπούτζα) - Τρίκαλα") {
        link.href = "Χαλικοβουνο.html";
    } else if (rowData[1] === "Κίσσαβος (Όσσα) - Λάρισα") {
        link.href = "Κισσαβος.html";
    } else if (rowData[1] === "Κόζιακας (Κερκέτιον Όρος) - Τρίκαλα") {
        link.href = "Κοζιακας.html";
    } else if (rowData[1] === "Καράβα (Σχιζοκάραβο) (Άγραφα) - Καρδίτσα") {
        link.href = "Καραβα.html";
    } else if (rowData[1] === "Αυγό - Τρίκαλα") {
        link.href = "ΑυγοΤρικαλων.html";
    } else if (rowData[1] === "Τριγγία (Τριγία) - Τρίκαλα") {
        link.href = "Τριγγια.html";
    } else if (rowData[1] === "Αρκούδα - Τρίκαλα") {
        link.href = "Αρκουδα.html";
    } else if (rowData[1] === "Ναρθάκι (Κασιδιάρης) - Λάρισα, Φθιώτιδα") {
        link.href = "Ναρθακι.html";
    } else if (rowData[1] === "Όθρυς - Μαγνησία, Φθιώτιδα") {
        link.href = "Οθρυς.html"; 
    } else if (rowData[1] === "Κάτω Όλυμπος (Μεταμόρφωση) - Λάρισα, Πιερία") {
        link.href = "ΚατωΟλυμπος.html";
    } else if (rowData[1] === "Πήλιο - Μαγνησία") {
        link.href = "Πηλιο.html";
    } else if (rowData[1] === "Λουνάκι - Τρίκαλα") {
        link.href = "Λουνακι.html";
    } else if (rowData[1] === "Ψηλή Ράχη - Καρδίτσα, Φθιώτιδα") {
        link.href = "ΨηληΡαχηΦθιωτιδας.html";
    } else if (rowData[1] === "Μαυρόραχη (Καρά Ράχη) - Καρδίτσα, Φθιώτιδα") {
        link.href = "Μαυροραχη.html";
    } else if (rowData[1] === "Τσεκούρι (Τσεκουράτ) - Πρέβεζα") {
        link.href = "ΤσεκουριΤσεκουρατ.html";
    } else if (rowData[1] === "Τσούκα - Άρτα") {
        link.href = "Τσουκα.html";
    } else if (rowData[1] === "Πενταλώνι - Ιωάννινα") {
        link.href = "Πενταλωνι.html";
    } else if (rowData[1] === "Γορίλας (Γκορίλα, Κουρύλας) - Ιωάννινα") {
        link.href = "Γοριλας.html";
    } else if (rowData[1] === "Μέγα Πλάι - Ιωάννινα") {
        link.href = "ΜεγαΠλαι.html";
    } else if (rowData[1] === "Κιντζιρέλου - Ιωάννινα") {
        link.href = "Κιντζιρελου.html";
    } else if (rowData[1] === "Ακρορράχη - Ιωάννινα") {
        link.href = "Ακρορραχη.html";
    } else if (rowData[1] === "Όρη Πάργας (Κρανιά) - Πρέβεζα") {
        link.href = "ΟρηΠαργας.html";
    } else if (rowData[1] === "Μέγα Ίσωμα - Φθιώτιδα") {
        link.href = "ΜεγαΙσωμα.html";
    } else if (rowData[1] === "Μαυρότοπος - Φθιώτιδα") {
        link.href = "Μαυροτοπος.html";
    } else if (rowData[1] === "Μεγάλη Τσούκα - Πρέβεζα") {
        link.href = "ΜεγαληΤσουκαΠρεβεζας.html";
    } else if (rowData[1] === "Καμήλα - Θεσπρωτία") {
        link.href = "Καμηλα.html";
    } else if (rowData[1] === "Γράμματα - Άρτα") {
        link.href = "Γραμματα.html";
    } else if (rowData[1] === "Βροντερό (Τσουτσούλι) - Φλώρινα") {
        link.href = "Βροντερο.html";
    } else if (rowData[1] === "Ντέβας - Φλώρινα") {
        link.href = "Ντεβας.html";
    } else if (rowData[1] === "Κορησός (Αηδονάκος) - Καστοριά") {
        link.href = "Κορησος.html";
    } else if (rowData[1] === "Αγία Τριάδα (Απόσκεπος, Σαρακήνα) - Καστοριά") {
        link.href = "ΑγιαΤριαδαΚαστοριας.html";
    } else if (rowData[1] === "Τρίκορφο (Όρη Λιδωρικίου) - Φωκίδα") {
        link.href = "ΤρικορφοΦωκιδας.html";
    } else if (rowData[1] === "Κνημίδα - Φθιώτιδα") {
        link.href = "Κνημιδα.html";
    } else if (rowData[1] === "Αετόπετρα - Φωκίδα") {
        link.href = "Αετοπετρα.html";
    } else if (rowData[1] === "Κουτσουρός - Φωκίδα") {
        link.href = "Κουτσουρος.html";
    } else if (rowData[1] === "Κούτσουρας - Φωκίδα") {
        link.href = "Κουτσουρας.html";
    } else if (rowData[1] === "Δανιήλ - Φωκίδα") {
        link.href = "Δανιηλ.html";
    } else if (rowData[1] === "Τσιτομή - Φωκίδα") {
        link.href = "Τσιτομη.html";
    } else if (rowData[1] === "Κρυάκουρας (Κριάκουρας) - Άρτα") {
        link.href = "Κρυακουρας.html";
    } else if (rowData[1] === "Φούρκα (Σελιό, Μουρτζιά) - Άρτα") {
        link.href = "Φουρκα.html";
    } else if (rowData[1] === "Αετοί - Άρτα") {
        link.href = "Αετοι.html";
    } else if (rowData[1] === "Φρούσια Όρη (Κόκκινα Στεφάνια) - Άρτα") {
        link.href = "ΦρουσιαΟρη.html";
    } else if (rowData[1] === "Όρη Φιλιατών - Θεσπρωτία") {
        link.href = "ΟρηΦιλιατων.html";
    } else if (rowData[1] === "Χιονίστρα (Σπάτα) - Θεσπρωτία") {
        link.href = "Χιονιστρα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Μαλούνι, Μαλόνι) - Θεσπρωτία") {
        link.href = "ΠροφητηςΗλιαςΜαλουνι.html";
    } else if (rowData[1] === "Όρη Βάλτου (Γάβροβο) - Αιτωλοακαρνανία, Άρτα") {
        link.href = "ΟρηΒαλτου.html";
    } else if (rowData[1] === "Καλογκέριτ (Λόκβατ) - Φλώρινα") {
        link.href = "Καλογκεριτ.html";
    } else if (rowData[1] === "Βροαστέργια (Βροατσέργια) - Φλώρινα") {
        link.href = "Βροαστεργια.html";
    } else if (rowData[1] === "Δοβράς (Φλάμπουρο) - Κοζάνη") {
        link.href = "Δοβρας.html";
    } else if (rowData[1] === "Κοκκινόλακκα (Κοκκινόλακκος) - Άρτα") {
        link.href = "Κοκκινολακκα.html";
    } else if (rowData[1] === "Τούρλα (Βουνό Μουζακαίικων) - Πρέβεζα") {
        link.href = "ΒουνοΜουζακαιικων.html";
    } else if (rowData[1] === "Τσουγκρί (Πύργος) - Άρτα") {
        link.href = "Τσουγκρι.html";
    } else if (rowData[1] === "Βουνό Βελαντίλας (Κρανίλα, Καμάρα) - Θεσπρωτία") {
        link.href = "ΒουνοΒελαντιλας.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Θεσπρωτία") {
        link.href = "ΠροφητηςΗλιαςΘεσπρωτιας.html";
    } else if (rowData[1] === "Ψηλό Βουνό - Θεσπρωτία") {
        link.href = "ΨηλοΒουνοΘεσπρωτιας.html";
    } else if (rowData[1] === "Σαρακίνα - Θεσπρωτία") {
        link.href = "Σαρακινα.html";
    } else if (rowData[1] === "Σουγλιάνι (Στρατονικό Όρος) - Θεσσαλονίκη, Χαλκιδική") {
        link.href = "Σουγλιανι.html";
    } else if (rowData[1] === "Ίταμος (Δραγουδέλης) - Χαλκιδική") {
        link.href = "ΙταμοςΧαλκιδικης.html";
    } else if (rowData[1] === "Όρη Παραμυθιάς (Γορίλλας, Γκορίλας, Κορύλλας) - Θεσπρωτία") {
        link.href = "ΟρηΠαραμυθιας.html";
    } else if (rowData[1] === "Βελούνα (Βουνό Χαραυγής) - Θεσπρωτία") {
        link.href = "Βελουνα.html";
    } else if (rowData[1] === "Λάγγαρη - Θεσπρωτία") {
        link.href = "Λαγγαρη.html";
    } else if (rowData[1] === "Δρίσκος - Ιωάννινα") {
        link.href = "Δρισκος.html";
    } else if (rowData[1] === "Φαρμακοβούνι - Θεσπρωτία") {
        link.href = "Φαρμακοβουνι.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Άρτα") {
        link.href = "ΠροφητηςΗλιαςΑρτας.html";
    } else if (rowData[1] === "Τρύπιο Λιθάρι - Άρτα") {
        link.href = "ΤρυπιοΛιθαρι.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Ιωάννινα") {
        link.href = "ΠροφητηςΗλιαςΙωαννινων.html";
    } else if (rowData[1] === "Χάρμα (Φλώρος, Τεροβίτικο) - Ιωάννινα") {
        link.href = "Χαρμα.html";
    } else if (rowData[1] === "Βουνά Μανολιάσας - Ιωάννινα") {
        link.href = "ΒουναΜανωλιασας.html";
    } else if (rowData[1] === "Αετοράχη - Ιωάννινα") {
        link.href = "Αετοραχη.html";
    } else if (rowData[1] === "Μεγάλη Τσούκα - Ιωάννινα") {
        link.href = "ΜεγαληΤσουκαΙωαννινων.html";
    } else if (rowData[1] === "Δεμάτι - Ιωάννινα") {
        link.href = "Δεματι.html";
    } else if (rowData[1] === "Όρη Κουρέντων (Όρη Λυκοστάνης) - Ιωάννινα") {
        link.href = "ΟρηΚουρεντων.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B - Ιωάννινα") {
        link.href = "ΠροφητηςΗλιαςΙωαννινων1217.html";
    } else if (rowData[1] === "Ζαρκόραχη (Θεσπρωτικά Όρη) - Ιωάννινα, Πρέβεζα") {
        link.href = "Ζαρκοραχη.html";
    } else if (rowData[1] === "Κουτσόκρανο - Ιωάννινα") {
        link.href = "Κουτσοκρανο.html";
    } else if (rowData[1] === "Λάπατα - Ιωάννινα") {
        link.href = "Λαπατα.html";
    } else if (rowData[1] === "Βουνά Μετσόβου (Καλιγωμένο Αλώνι) - Ιωάννινα") {
        link.href = "ΒουναΜετσοβου.html";
    } else if (rowData[1] === "Βουνά Γρεβενιτίου (Κερά Άννα, Κεράνα) - Ιωάννινα") {
        link.href = "ΒουναΓρεβενιτιου.html";
    } else if (rowData[1] === "Κασιδιάρης (Σούτιστα) - Ιωάννινα") {
        link.href = "ΚασιδιαρηςΣουτιστα.html";
    } else if (rowData[1] === "Βαλανιδιά - Ιωάννινα") {
        link.href = "Βαλανιδια.html";
    } else if (rowData[1] === "Όρη Σουλίου (Βριτζάχα ή Αλισσός) - Θεσπρωτία, Ιωάννινα") {
        link.href = "ΟρηΣουλιου.html";
    } else if (rowData[1] === "Στούρος (Στούρου, Σμίντελα) - Ιωάννινα") {
        link.href = "Στουρος.html";
    } else if (rowData[1] === "Ξεροβούνι (Ξηροβούνι) - Ιωάννινα, Πρέβεζα, Άρτα") {
        link.href = "ΞεροβουνιΞηροβουνι.html";
    } else if (rowData[1] === "Μακρύκαμπος (Τσούκα, Μπόζοβο) - Ιωάννινα") {
        link.href = "Μακρυκαμπος.html";
    } else if (rowData[1] === "Μουργκάνα (Όρη Τσαμαντά, Μαυροβούνι) - Θεσπρωτία, Ιωάννινα") {
        link.href = "Μουργκανα.html";
    } else if (rowData[1] === "Δύσωρο (Κρούσια Όρη, Μαυροβούνι) - Κιλκίς, Σέρρες") {
        link.href = "Δυσωρο.html";
    } else if (rowData[1] === "Άγιος Χριστόφορος - Κοζάνη") {
        link.href = "ΑγιοςΧριστοφοροςΚοζανης.html";
    } else if (rowData[1] === "Φλατσάτα - Καστοριά") {
        link.href = "Φλατσατα.html";
    } else if (rowData[1] === "Κερδύλιο (Κερδύλια Όρη) - Θεσσαλονίκη, Σέρρες") {
        link.href = "Κερδυλιο.html";
    } else if (rowData[1] === "Στρατονικό (Μπιάβιτσα, Πιαβίτσα, Κοντάρι) - Χαλκιδική") {
        link.href = "Στρατονικο.html";
    } else if (rowData[1] === "Κουτσόρραχος - Γρεβενά") {
        link.href = "Κουτσορραχος.html";
    } else if (rowData[1] === "Περίβλεπτο - Δράμα") {
        link.href = "Περιβλεπτο.html";
    } else if (rowData[1] === "Μοναστήρι - Κιλκίς") {
        link.href = "Μοναστηρι.html";
    } else if (rowData[1] === "Μεγάλη Ράχη - Κοζάνη") {
        link.href = "ΜεγαληΡαχη.html";
    } else if (rowData[1] === "Λευκάδιο - Κοζάνη") {
        link.href = "Λευκαδιο.html";
    } else if (rowData[1] === "Βουνά Λευκογείων - Δράμα") {
        link.href = "ΒουναΛευκογειων.html";
    } else if (rowData[1] === "Βουρσάνα - Κοζάνη") {
        link.href = "Βουρσανα.html";
    } else if (rowData[1] === "Ριζό - Κοζάνη") {
        link.href = "Ριζο.html";
    } else if (rowData[1] === "Τρίλοφο (Αλεότζ) - Καστοριά, Φλώρινα") {
        link.href = "ΤριλοφοΑλεοτζ.html";
    } else if (rowData[1] === "Κίσσαβος - Γρεβενά") {
        link.href = "ΚισσαβοςΓρεβενων.html";
    } else if (rowData[1] === "Σκρα (Σκρα ντι Λέγκεν, Γκιζέτ) - Κιλκίς, Πέλλα") {
        link.href = "Σκραντιλεγκεν.html";
    } else if (rowData[1] === "Χάρακας - Δράμα") {
        link.href = "Χαρακας.html";
    } else if (rowData[1] === "Τρέτιμος (Τρέτιμ Τεπέ) - Γρεβενά") {
        link.href = "Τρετιμος.html";
    } else if (rowData[1] === "Βουνά Ξινού Νερού - Φλώρινα") {
        link.href = "ΒουναΞινουΝερου.html";
    } else if (rowData[1] === "Μαύρο Πουλί (Χιντιρλίκ) - Κοζάνη, Φλώρινα") {
        link.href = "ΜαυροΠουλιΚοζανης.html";
    } else if (rowData[1] === "Καστανιές (Κεστενές) - Καβάλα") {
        link.href = "ΚαστανιεςΚεστενες.html";
    } else if (rowData[1] === "Γερμανικό - Κιλκίς") {
        link.href = "Γερμανικο.html";
    } else if (rowData[1] === "Καμήλα (Καμηλοβούνι) - Χαλκιδική") {
        link.href = "ΚαμηλαΚαμηλοβουνι.html";
    } else if (rowData[1] === "Κοζάκος - Ιωάννινα") {
        link.href = "Κοζακος.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Χαλκιδική") {
        link.href = "ΠροφητηςΗλιαςΧαλκιδικης.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Κοζάνη") {
        link.href = "ΠροφητηςΗλιαςΚοζανης.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αργολίδα") {
        link.href = "ΠροφητηςΗλιαςΑργολιδα856.html";
    } else if (rowData[1] === "Βουνά Γρεβενών - Γρεβενά") {
        link.href = "ΒουναΓρεβενων.html";
    } else if (rowData[1] === "Μεγαλοβούνι (Νοτζά Νταγ) - Δράμα") {
        link.href = "ΜεγαλοβουνιΝοτζαΝταγ.html";
    } else if (rowData[1] === "Βουνά Κοζάνης - Κοζάνη") {
        link.href = "ΒουναΚοζανης.html";
    } else if (rowData[1] === "Αλωνοράχη - Κοζάνη") {
        link.href = "Αλωνοραχη.html";
    } else if (rowData[1] === "Βερτίσκος - Θεσσαλονίκη") {
        link.href = "Βερτισκος.html";
    } else if (rowData[1] === "Χολομώντας - Χαλκιδική") {
        link.href = "Χολομωντας.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Τσιότινα) - Γρεβενά") {
        link.href = "ΠροφητηςΗλιαςΤσιοτινα.html";
    } else if (rowData[1] === "Αράκυνθος - Αιτωλοακαρνανία") {
        link.href = "Αρακυνθος.html";
    } else if (rowData[1] === "Άγιος Αρσένιος - Φωκίδα") {
        link.href = "ΑγιοςΑρσενιος.html";
    } else if (rowData[1] === "Ξερακιώνα - Βοιωτία") {
        link.href = "Ξερακιωνα.html";
    } else if (rowData[1] === "Λυκότρυπα - Γρεβενά") {
        link.href = "Λυκοτρυπα.html";
    } else if (rowData[1] === "Αετοράχη - Γρεβενά, Κοζάνη") {
        link.href = "ΑετοραχηΓρεβενων.html";
    } else if (rowData[1] === "Τσούκα Καραλή - Γρεβενά") {
        link.href = "ΤσουκαΚαραλη.html";
    } else if (rowData[1] === "Σκοπός - Κοζάνη") {
        link.href = "Σκοπος.html";
    } else if (rowData[1] === "Αετοβούνι - Κοζάνη") {
        link.href = "Αετοβουνι.html";
    } else if (rowData[1] === "Όρη Λεκάνης - Δράμα, Καβάλα") {
        link.href = "ΟρηΛεκανης.html";
    } else if (rowData[1] === "Κρούσσια Όρη (Μαυροβούνι, Καρά Νταγ) - Κιλκίς, Σέρρες") {
        link.href = "ΚρουσσιαΟρηΜαυροβουνι.html";
    } else if (rowData[1] === "Αμπέλια - Βοιωτία") {
        link.href = "Αμπελια.html";
    } else if (rowData[1] === "Αφρόσι - Εύβοια") {
        link.href = "Αφροσι.html";
    } else if (rowData[1] === "Βλαχοβούνι - Εύβοια") {
        link.href = "Βλαχοβουνι.html";
    } else if (rowData[1] === "Αμάλια - Βοιωτία") {
        link.href = "Αμαλια.html";
    } else if (rowData[1] === "Σταυρός - Αιτωλοακαρνανία") {
        link.href = "Σταυρος.html";
    } else if (rowData[1] === "Ζωιτός - Βοιωτία") {
        link.href = "Ζωιτος.html";
    } else if (rowData[1] === "Μπιρμπιλιώ - Φθιώτιδα") {
        link.href = "Μπιρμπιλιω.html";
    } else if (rowData[1] === "Άγιοι Θεόδωροι - Φθιώτιδα") {
        link.href = "ΑγιοιΘεοδωροι.html";
    } else if (rowData[1] === "Βουδόχη - Εύβοια") {
        link.href = "Βουδοχη.html";
    } else if (rowData[1] === "Αρκουδότρυπα - Εύβοια") {
        link.href = "Αρκουδοτρυπα.html";
    } else if (rowData[1] === "Κορομπίλι - Βοιωτία") {
        link.href = "Κορομπιλι.html";
    } else if (rowData[1] === "Σκοτεινή - Εύβοια") {
        link.href = "Σκοτεινη.html";
    } else if (rowData[1] === "Ορτάρι - Εύβοια") {
        link.href = "Ορταρι.html";
    } else if (rowData[1] === "Τελέθριο - Εύβοια") {
        link.href = "Τελεθριο.html";
    } else if (rowData[1] === "Ευβοϊκός Όλυμπος - Εύβοια") {
        link.href = "ΕυβοικοςΟλυμπος.html";
    } else if (rowData[1] === "Καλπακόβραχος - Εύβοια") {
        link.href = "Καλπακοβραχος.html";
    } else if (rowData[1] === "Πυξαριάς - Εύβοια") {
        link.href = "Πυξαριας.html";
    } else if (rowData[1] === "Όρη Λιδωρικίου - Φωκίδα") {
        link.href = "ΟρηΛιδωρικιου.html";
    } else if (rowData[1] === "Ταναΐδα - Εύβοια") {
        link.href = "Ταναιδα.html";
    } else if (rowData[1] === "Μεγάλα Όντρια (Όδρυα) - Καστοριά, Κοζάνη") {
        link.href = "ΜεγαλαΟντρια.html";
    } else if (rowData[1] === "Αλεβίτσα - Καστοριά") {
        link.href = "Αλεβιτσα.html";
    } else if (rowData[1] === "Τάλιαρος (Θανασούλας) - Γρεβενά, Καστοριά") {
        link.href = "Ταλιαρος.html";
    } else if (rowData[1] === "Λιάγκουνα (Κοπάνες) - Γρεβενά") {
        link.href = "Λιαγκουνα.html";
    } else if (rowData[1] === "Όρλιακας (Σπίλος) - Γρεβενά") {
        link.href = "Ορλιακας.html";
    } else if (rowData[1] === "Άγκιστρο (Τσιγγέλι) - Σέρρες") {
        link.href = "Αγκιστρο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B - Καστοριά") {
        link.href = "ΠροφητηςΗλιαςΚαστοριας.html";
    } else if (rowData[1] === "Τρίκορφο - Ευρυτανία") {
        link.href = "ΤρικορφοΕυρυτανιας.html";
    } else if (rowData[1] === "Λασποχώματα (Μπλος) - Ευρυτανία") {
        link.href = "Λασποχωματα.html";
    } else if (rowData[1] === "Ανάληψη - Αιτωλοακαρνανία") {
        link.href = "Αναληψη.html";
    } else if (rowData[1] === "Πάστρα - Αττική, Βοιωτία") {
        link.href = "Παστρα.html";
    } else if (rowData[1] === "Μεσσάπιον Όρος - Βοιωτία") {
        link.href = "ΜεσσαπιονΟρος.html";
    } else if (rowData[1] === "Πύργος - Εύβοια") {
        link.href = "ΠυργοςΕυβοιας.html";
    } else if (rowData[1] === "Σκαφίδα - Καρδίτσα") {
        link.href = "Σκαφιδα.html";
    } else if (rowData[1] === "Ελατιά (Καράντερε) - Δράμα") {
        link.href = "ΕλατιαΚαραντερε.html";
    } else if (rowData[1] === "Καζάνι Αποσκέπου - Καστοριά") {
        link.href = "ΚαζανιΑποσκεπου.html";
    } else if (rowData[1] === "Τζένα (Ζιώνα) - Πέλλα") {
        link.href = "Τζενα.html";
    } else if (rowData[1] === "Καμβούνια Όρη (Βουνάσα) - Γρεβενά, Κοζάνη") {
        link.href = "ΚαμβουνιαΟρη.html";
    } else if (rowData[1] === "Τσούκα Ρόσσα (Κοκκινόραχη) - Ιωάννινα") {
        link.href = "ΤσουκαΡοσσα.html";
    } else if (rowData[1] === "Φλάμπουρο (Καραβούνι, Καρβούνι) - Ιωάννινα") {
        link.href = "ΦλαμπουροΚαραβουνι.html";
    } else if (rowData[1] === "Ταμπούρι (Οχυρό) - Ιωάννινα") {
        link.href = "ΤαμπουριΟχυρο.html";
    } else if (rowData[1] === "Μιτσικέλι - Ιωάννινα") {
        link.href = "Μιτσικελι.html";
    } else if (rowData[1] === "Κουκουρούντζος - Ιωάννινα") {
        link.href = "ΚουκουρουντζοςΙωαννινα.html";
    } else if (rowData[1] === "Τόμαρος (Ολύτσικας) - Ιωάννινα") {
        link.href = "Τομαρος.html";
    } else if (rowData[1] === "Τραπεζίτσα - Ιωάννινα") {
        link.href = "Τραπεζιτσα.html";
    } else if (rowData[1] === "Τρικλάριο (Βάρμπα, Σφήκα, Βάρμπα) - Φλώρινα") {
        link.href = "Τρικλαριο.html";
    } else if (rowData[1] === "Βέλια (Μέλλια) - Κοζάνη") {
        link.href = "ΒελιαΜελλια.html";
    } else if (rowData[1] === "Λαϊλιάς (Όρη Βροντούς, Ανάληψη, Προφήτης Ηλίας) - Σέρρες") {
        link.href = "ΛαιλιαςΟρηΒροντους.html";
    } else if (rowData[1] === "Μπαλντενήσι - Ευρυτανία") {
        link.href = "Μπαλντενησι.html";
    } else if (rowData[1] === "Καμενίκ - Ιωάννινα") {
        link.href = "Καμενικ.html";
    } else if (rowData[1] === "Ζυγός (Άσπρα Λιθάρια, Ταμπούρια Θανασάκη, Βούλγαρης) - Ιωάννινα, Τρίκαλα") {
        link.href = "ΖυγοςΑσπραΛιθαρια.html";
    } else if (rowData[1] === "Φλέγγα (Μαυροβούνι) - Γρεβενά, Ιωάννινα") {
        link.href = "ΦλεγγαΜαυροβουνι.html";
    } else if (rowData[1] === "Κακοπλεύρι (Μηλιά) - Γρεβενά, Ιωάννινα") {
        link.href = "ΚακοπλευριΜηλια.html";
    } else if (rowData[1] === "Αυγό (Λύγκος) - Γρεβενά, Ιωάννινα") {
        link.href = "ΑυγοΛυγκος.html";
    } else if (rowData[1] === "Δούσκο (Ντεμέρτσκα, Μερόπη) - Ιωάννινα") {
        link.href = "ΔουσκοΝεμερτσκα.html";
    } else if (rowData[1] === "Βασιλίτσα - Γρεβενά, Ιωάννινα") {
        link.href = "Βασιλιτσα.html";
    } else if (rowData[1] === "Τζουμέρκα (Αθαμανικά Όρη) - Άρτα") {
        link.href = "ΤζουμερκαΑθαμανικαΟρη.html";
    } else if (rowData[1] === "Τύμφη - Ιωάννινα") {
        link.href = "Τυμφη.html";
    } else if (rowData[1] === "Γράμμος - Ιωάννινα, Καστοριά") {
        link.href = "Γραμμος.html";
    } else if (rowData[1] === "Σμόλικας - Ιωάννινα") {
        link.href = "Σμολικας.html";
    } else if (rowData[1] === "Βόρας (Καϊμακτσαλάν) - Πέλλα") {
        link.href = "Βορας.html";
    } else if (rowData[1] === "Βέρμιο - Ημαθία, Κοζάνη") {
        link.href = "Βερμιο.html";
    } else if (rowData[1] === "Σινιάτσικο (Άσκιο) - Κοζάνη") {
        link.href = "Σινιατσικο.html";
    } else if (rowData[1] === "Όρβηλος (Αλή Μπουτούς) - Σέρρες, Δράμα") {
        link.href = "Ορβηλος.html";
    } else if (rowData[1] === "Μουρίκι - Κοζάνη") {
        link.href = "Μουρικι.html";
    } else if (rowData[1] === "Βίτσι (Βέρνο) - Καστοριά, Φλώρινα") {
        link.href = "ΒιτσιΒερνο.html";
    } else if (rowData[1] === "Άθως (Άγιον Όρος) - Χαλκιδική") {
        link.href = "Αθως.html";
    } else if (rowData[1] === "Μπέλες (Μπέλλες, Κερκίνη) - Σέρρες") {
        link.href = "Μπελες.html";
    } else if (rowData[1] === "Πυροστιά (Μπάλνες) - Γρεβενά") {
        link.href = "Πυροστια.html";
    } else if (rowData[1] === "Βαρνούντας (Περιστέρι, Βαρνούς) - Φλώρινα") {
        link.href = "Βαρνουντας.html";
    } else if (rowData[1] === "Πίνοβο - Πέλλα") {
        link.href = "Πινοβο.html";
    } else if (rowData[1] === "Πιέρια Όρη - Κοζάνη, Πιερία") {
        link.href = "ΠιεριαΟρη.html";
    } else if (rowData[1] === "Φρακτό (Νταλιμπόσκα) - Δράμα") {
        link.href = "Φρακτο.html";
    } else if (rowData[1] === "Παγγαίο - Καβάλα, Σέρρες") {
        link.href = "Παγγαιο.html";
    } else if (rowData[1] === "Μενοίκιο (Σμιγίνιτσα) - Δράμα, Σέρρες") {
        link.href = "Μενοικιο.html";
    } else if (rowData[1] === "Βόιο - Καστοριά, Κοζάνη") {
        link.href = "Βοιο.html";
    } else if (rowData[1] === "Πέρδικα (Σκούρτζα) - Γρεβενά") {
        link.href = "Περδικα.html";
    } else if (rowData[1] === "Μπούτσι (Μάλι Μάδι) - Καστοριά, Φλώρινα") {
        link.href = "Μπουτσι.html";
    } else if (rowData[1] === "Άγιος Παύλος (Σιβρί Τεπέ, Γρανίτης) - Δράμα") {
        link.href = "ΑγιοςΠαυλος.html";
    } else if (rowData[1] === "Κίρκουρη - Γρεβενά, Καστοριά") {
        link.href = "Κιρκουρη.html";
    } else if (rowData[1] === "Βούρινος (Μπούρινος, Ντρισινίκος) - Γρεβενά, Κοζάνη") {
        link.href = "Βουρινος.html";
    } else if (rowData[1] === "Άγιο Πνεύμα - Δράμα") {
        link.href = "ΑγιοΠνευμα.html";
    } else if (rowData[1] === "Κολώνα (Γκόλνα) - Ημαθία") {
        link.href = "Κολωνα.html";
    } else if (rowData[1] === "Χορτιάτης - Θεσσαλονίκη, Χαλκιδική") {
        link.href = "Χορτιατης.html";
    } else if (rowData[1] === "Πάικο (Φιδωτά) - Κιλκίς, Πέλλα") {
        link.href = "Παικο.html";
    } else if (rowData[1] === "Πύργος - Αιτωλοακαρνανία") {
        link.href = "ΠυργοςΑιτωλοακαρνανιας.html";
    } else if (rowData[1] === "Βίτσι - Αιτωλοακαρνανία") {
        link.href = "ΒιτσιΑιτωλοακαρνανιας.html";
    } else if (rowData[1] === "Παναιτωλικό - Αιτωλοακαρνανία, Ευρυτανία") {
        link.href = "Παναιτωλικο.html";
    } else if (rowData[1] === "Οξυά - Ευρυτανία, Φθιώτιδα, Φωκίδα") {
        link.href = "Οξυα.html";
    } else if (rowData[1] === "Κοκκινάρι (Άγιος Ηλίας) - Φωκίδα") {
        link.href = "Κοκκιναρι.html";
    } else if (rowData[1] === "Προσηλιακό (Προσηλιάκι) - Ευρυτανία") {
        link.href = "Προσηλιακο.html";
    } else if (rowData[1] === "Κόψι (Άγραφα) - Ευρυτανία") {
        link.href = "Κοψι.html";
    } else if (rowData[1] === "Χελιδόνα (Χελιδώνα) - Ευρυτανία") {
        link.href = "Χελιδονα.html";
    } else if (rowData[1] === "Όρη Ναυπακτίας (Κοκκινιάς) - Αιτωλοακαρνανία") {
        link.href = "ΟρηΝαυπακτιας.html";
    } else if (rowData[1] === "Τριανταφυλλιά - Αιτωλοακαρνανία, Ευρυτανία") {
        link.href = "Τριανταφυλλια.html";
    } else if (rowData[1] === "Πλατανάκι (Πλατάνι, Ζάρα) - Αιτωλοακαρνανία, Ευρυτανία") {
        link.href = "Πλατανακι.html";
    } else if (rowData[1] === "Τσεκούρα - Αιτωλοακαρνανία") {
        link.href = "Τσεκουρα.html";
    } else if (rowData[1] === "Τσακαλάκι - Αιτωλοακαρνανία") {
        link.href = "Τσακαλακι.html";
    } else if (rowData[1] === "Κοκκάλια - Ευρυτανία, Φθιώτιδα") {
        link.href = "Κοκκαλια.html";
    } else if (rowData[1] === "Άννινος - Αιτωλοακαρνανία, Ευρυτανία") {
        link.href = "Αννινος.html";
    } else if (rowData[1] === "Αρδίνης - Αιτωλοακαρνανία") {
        link.href = "Αρδινης.html";
    } else if (rowData[1] === "Κερασοβούνι - Αιτωλοακαρνανία, Φωκίδα") {
        link.href = "Κερασοβουνι.html";
    } else if (rowData[1] === "Αλογοβούνι - Ευρυτανία, Φθιώτιδα") {
        link.href = "Αλογοβουνι.html";
    } else if (rowData[1] === "Δίρφυς (Δίρφη) - Εύβοια") {
        link.href = "Διρφυς.html";
    } else if (rowData[1] === "Καυκί (Άγραφα) - Ευρυτανία") {
        link.href = "Καυκι.html";
    } else if (rowData[1] === "Ελικώνας - Βοιωτία") {
        link.href = "Ελικωνας.html";
    } else if (rowData[1] === "Ξεροβούνι (Βλαχοβούνι) - Αιτωλοακαρνανία, Φωκίδα") {
        link.href = "ΞεροβουνιΒλαχοβουνι.html";
    } else if (rowData[1] === "Πυργούλια (Φονιάς) - Αιτωλοακαρνανία, Ευρυτανία") {
        link.href = "Πυργουλια.html";
    } else if (rowData[1] === "Ακαρνανικά Όρη (Όρη Ξηρόμερου) - Αιτωλοακαρνανία") {
        link.href = "ΑκαρνανικαΟρη.html";
    } else if (rowData[1] === "Τσούμα - Ευρυτανία") {
        link.href = "Τσουμα.html";
    } else if (rowData[1] === "Γεράνεια Όρη - Αττική, Κορινθία") {
        link.href = "ΓερανειαΟρη.html";
    } else if (rowData[1] === "Μπούμιστος (Ταμπούρια) - Αιτωλοακαρνανία") {
        link.href = "Μπουμιστος.html";
    } else if (rowData[1] === "Ξεροβούνι - Αιτωλοακαρνανία, Φωκίδα") {
        link.href = "ΞεροβουνιΑιτωλοακαρνανιας1502.html";
    } else if (rowData[1] === "Καρφοπεταλιάς - Αιτωλοακαρνανία") {
        link.href = "Καρφοπεταλιας.html";
    } else if (rowData[1] === "Μεγάλη Λούτσα (Καψάλα) - Βοιωτία") {
        link.href = "ΜεγαληΛουτσαΒοιωτοιας.html";
    } else if (rowData[1] === "Κουμπί - Ευρυτανία") {
        link.href = "Κουμπι.html";
    } else if (rowData[1] === "Ζαγαράς (Μοτσάρα, Ζάστανι) - Βοιωτία") {
        link.href = "Ζαγαρας.html";
    } else if (rowData[1] === "Λυκομνήματα - Ευρυτανία, Φθιώτιδα") {
        link.href = "Λυκομνηματα.html";
    } else if (rowData[1] === "Ξεροβούνι - Αιτωλοακαρνανία") {
        link.href = "ΞεροβουνιΑιτωλοακαρνανιας1571.html";
    } else if (rowData[1] === "Νεραϊδοβούνι - Ευρυτανία") {
        link.href = "ΝεραιδοβουνιΕυρυτανιας.html";
    } else if (rowData[1] === "Ριγάνι (Ορίγανον) - Αιτωλοακαρνανία") {
        link.href = "Ριγανι.html";
    } else if (rowData[1] === "Ανάληψη (Τσούκα) - Ευρυτανία") {
        link.href = "ΑναληψηΤσουκα.html";
    } else if (rowData[1] === "Γουλινάς - Φθιώτιδα") {
        link.href = "Γουλινας.html";
    } else if (rowData[1] === "Κολλιέδες (Ντρέβιζα) - Βοιωτία") {
        link.href = "Κολλιεδες.html";
    } else if (rowData[1] === "Αλωνάκι - Αιτωλοακαρνανία") {
        link.href = "Αλωνακι.html";
    } else if (rowData[1] === "Πάρνηθα (Καραβόλα) - Αττική") {
        link.href = "Παρνηθα.html";
    } else if (rowData[1] === "Κωνίσκος (Κόνισκος) - Ευρυτανία") {
        link.href = "Κωνισκος.html";
    } else if (rowData[1] === "Κιθαιρώνας - Αττική, Βοιωτία") {
        link.href = "Κιθαιρωνας.html";
    } else if (rowData[1] === "Κόμπολος (Κόμπιλο) - Ευρυτανία") {
        link.href = "Κομπολος.html";
    } else if (rowData[1] === "Καρδαράς - Αιτωλοακαρνανία") {
        link.href = "Καρδαρας.html";
    } else if (rowData[1] === "Καμαράκι - Ευρυτανία") {
        link.href = "Καμαρακι.html";
    } else if (rowData[1] === "Καντήλι - Εύβοια") {
        link.href = "Καντηλι.html";
    } else if (rowData[1] === "Κοτύλαια Όρη - Εύβοια") {
        link.href = "ΚοτυλαιαΟρη.html";
    } else if (rowData[1] === "Ξεροβούνι (Λαφύστιον Όρος) - Βοιωτία") {
        link.href = "ΞεροβουνιΒοιωτιας.html";
    } else if (rowData[1] === "Λημέρι - Αιτωλοακαρνανία") {
        link.href = "Λημερι.html";
    } else if (rowData[1] === "Υμηττός - Αττική") {
        link.href = "Υμηττος.html";
    } else if (rowData[1] === "Κλόκοβα - Αιτωλοακαρνανία") {
        link.href = "Κλοκοβα.html";
    } else if (rowData[1] === "Πέντε Κορυφές - Ευρυτανία") {
        link.href = "ΠεντεΚορυφες.html";
    } else if (rowData[1] === "Μακρυνόρος - Αιτωλοακαρνανία") {
        link.href = "ΜακρυνοροςΑιτωλοακαρνανιας.html";
    } else if (rowData[1] === "Ξεροβούνι - Φθιώτιδα") {
        link.href = "ΞεροβουνιΦθιωτιδας.html";
    } else if (rowData[1] === "Ξηρόν Ορος - Εύβοια") {
        link.href = "ΞηρονΟρος.html";
    } else if (rowData[1] === "Δίκορφο (Βελούτσα) - Αιτωλοακαρνανία") {
        link.href = "ΔικορφοΒελουτσα.html";
    } else if (rowData[1] === "Βαράσοβα (Σφυρί) - Αιτωλοακαρνανία") {
        link.href = "Βαρασοβα.html";
    } else if (rowData[1] === "Καλαβούνι (Κολοβούνι) - Αιτωλοακαρνανία") {
        link.href = "ΚαλαβουνιΚολοβουνι.html";
    } else if (rowData[1] === "Ξηροβούνι - Αιτωλοακαρνανία") {
        link.href = "ΞηροβουνιΑιτωλοακαρνανιας.html";
    } else if (rowData[1] === "Πεταλάς (Θύαμον όρος) - Αιτωλοακαρνανία") {
        link.href = "Πεταλας.html";
    } else if (rowData[1] === "Τραγόσταλος - Αιτωλοακαρνανία") {
        link.href = "Τραγοσταλος.html";
    } else if (rowData[1] === "Φροξυλιά - Αιτωλοακαρνανία") {
        link.href = "Φροξυλια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Γρανίτσας) - Βοιωτία") {
        link.href = "ΠροφητηςΗλιαςΓρανιτσας.html";
    } else if (rowData[1] === "Όρος Κίρφις (Επάνω Καρβούνι) - Βοιωτία") {
        link.href = "ΟροςΚιρφις.html";
    } else if (rowData[1] === "Νεραϊδολάκκωμα - Βοιωτία, Φωκίδα") {
        link.href = "Νεραιδολακκωμα.html";
    } else if (rowData[1] === "Γκιώνα (Ασέληνον Όρος) - Φωκίδα") {
        link.href = "Γκιωνα.html";
    } else if (rowData[1] === "Βαρδούσια (Κόραξ) - Βοιωτία, Φθιώτιδα") {
        link.href = "Βαρδουσια.html";
    } else if (rowData[1] === "Τυμφρηστός (Βελούχι) - Ευρυτανία, Φθιώτιδα") {
        link.href = "Τυμφρηστος.html";
    } else if (rowData[1] === "Οίτη (Καταβόθρα) - Φθιώτιδα, Φωκίδα") {
        link.href = "Οιτη.html";
    } else if (rowData[1] === "Καλλίδρομο (Σαρώματα) - Φθιώτιδα") {
        link.href = "Καλλιδρομο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Φθιώτιδα") {
        link.href = "ΠροφητηςΗλιαςΦθιωτιδας.html";
    } else if (rowData[1] === "Παρνασσός - Φωκίδα") {
        link.href = "Παρνασσος.html";
    } else if (rowData[1] === "Πατέρας - Αττική") {
        link.href = "Πατερας.html";
    } else if (rowData[1] === "Πεντέλη (Πεντελικό) - Αττική") {
        link.href = "Πεντελη.html";
    } else if (rowData[1] === "Πύργος - Ευρυτανία") {
        link.href = "ΠυργοςΕυρυτανιας1604.html";
    } else if (rowData[1] === "Τρία Σύνορα - Ευρυτανία") {
        link.href = "ΤριαΣυνορα.html";
    } else if (rowData[1] === "Φτέρη (Πτέρη) (Άγραφα) - Ευρυτανία") {
        link.href = "Φτερη.html";
    } else if (rowData[1] === "Καλιακούδα - Ευρυτανία") {
        link.href = "Καλιακουδα.html";
    } else if (rowData[1] === "Σβόνι (Μαράθια) (Άγραφα) - Ευρυτανία") {
        link.href = "Σβονι.html";
    } else if (rowData[1] === "Φουρκούλα (Κουκουρούντζος) (Άγραφα) - Ευρυτανία") {
        link.href = "Φουρκουλα.html";
    } else if (rowData[1] === "Όχη - Εύβοια") {
        link.href = "Οχη.html";
    } else if (rowData[1] === "Ξεροβούνι - Εύβοια") {
        link.href = "ΞεροβουνιΕυβοιας.html";
    } else if (rowData[1] === "Χλωμό - Φθιώτιδα") {
        link.href = "ΧλωμοΦθιωτιδας.html";
    } else if (rowData[1] === "Βλαχοβούνι - Φωκίδα") {
        link.href = "ΒλαχοβουνιΦωκιδας.html";
    } else if (rowData[1] === "Ακροκόρινθος - Κορινθία") {
        link.href = "Ακροκορινθος.html";
    } else if (rowData[1] === "Τσούμα Ανιάδας - Ευρυτανία") {
        link.href = "ΤσουμαΑνιαδας.html";
    } else if (rowData[1] === "Ποτίστρες (Κανάλα, Καλάνα) - Αιτωλοακαρνανία") {
        link.href = "Ποτιστρες.html";
    } else if (rowData[1] === "Λιάκουρα (Άγραφα) - Ευρυτανία") {
        link.href = "Λιακουρα.html";
    } else if (rowData[1] === "Μακρυνόρος - Αιτωλοακαρνανία (Ναυπακτία)") {
        link.href = "ΜακρυνοροςΑιτωλοακαρνανιας1561.html";
    } else if (rowData[1] === "Πέντε Πύργοι (Άγραφα) - Καρδίτσα") {
        link.href = "ΠεντεΠυργοι.html";
    } else if (rowData[1] === "Καταραχιάς - Ιωάννινα") {
        link.href = "Καταρραχιας.html";
    } else if (rowData[1] === "Βελιάς (Βελά) - Αχαΐα") {
        link.href = "Βελια.html";
    } else if (rowData[1] === "Μεγαλοβούνι - Αργολίδα") {
        link.href = "ΜεγαλοβουνιΑργολιδα.html";
    } else if (rowData[1] === "Καταραχιάς (Άγραφα) - Καρδίτσα") {
        link.href = "ΚαταραχιαςΑγραφα.html";
    } 

    else if (rowData[1] === "Δόβρος - Αιτωλοακαρνανία") {
        link.href = "Δοβρος.html";
    } else if (rowData[1] === "Κριθίνα - Λακωνία") {
        link.href = "Κριθινα.html";
    } else if (rowData[1] === "Τίμιος Σταυρός - Λασίθι") {
        link.href = "ΤιμιοςΣταυρος.html";
    } else if (rowData[1] === "Μαυροκορφή - Μαγνησία") {
        link.href = "Μαυροκορφη.html";
    } else if (rowData[1] === "Ψηλοκορφή - Κορινθία") {
        link.href = "Ψηλοκορφη.html";
    } else if (rowData[1] === "Κόχυλας - Σκύρος") {
        link.href = "Κοχυλας.html";
    } else if (rowData[1] === "Πυργίσκος - Λέσβος") {
        link.href = "Πυργισκος.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Ευρυτανία") {
        link.href = "ΠροφητηςΗλιαςΕυρυτανια786.html";
    } else if (rowData[1] === "Αδέρες - Αργολίδα") {
        link.href = "Αδερες.html";
    } else if (rowData[1] === "Σερβούνι - Εύβοια") {
        link.href = "Σερβουνι.html";
    } else if (rowData[1] === "Πτώο - Βοιωτία") {
        link.href = "Πτωο.html";
    } else if (rowData[1] === "Μπουρνιάς - Σάμος") {
        link.href = "Μπουρνιας.html";
    } else if (rowData[1] === "Λαπίθας - Ηλεία") {
        link.href = "Λαπιθας.html";
    } else if (rowData[1] === "Μεγάλη Κορυφή - Ηράκλειο") {
        link.href = "ΜεγαληΚορυφηΗρακλειοΚρητη.html";
    } else if (rowData[1] === "Ζαλόγγου Βουνά - Πρέβεζα") {
        link.href = "ΖαλογγουΒουνα.html";
    } else if (rowData[1] === "Παλιαγραπιδιά - Ευρυτανία") {
        link.href = "Παλιαγραπιδια.html";
    } else if (rowData[1] === "Κουκουρουφλιά - Τρίκαλα") {
        link.href = "Κουκουρουφλια.html";
    } else if (rowData[1] === "Χελμός - Αρκαδία, Λακωνία") {
        link.href = "ΧελμοςΑρκαδιαΛακωνια.html";
    } else if (rowData[1] === "Κοκκινίτσα - Θεσπρωτία") {
        link.href = "Κοκκινιτσα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Ευρυτανία") {
        link.href = "ΠροφητηςΗλιαςΕυρυτανια764.html";
    } else if (rowData[1] === "Πετράλωνα - Αιτωλοακαρνανία") {
        link.href = "Πετραλωνα.html";
    } else if (rowData[1] === "Πορί - Λακωνία") {
        link.href = "Πορι.html";
    } else if (rowData[1] === "Άγιοι Πάντες - Πάρος") {
        link.href = "ΑγιοιΠαντεςΠαρος.html";
    } else if (rowData[1] === "Γραμβούσα - Χανιά") {
        link.href = "Γραμβουσα.html";
    } else if (rowData[1] === "Στειρομάνδρα - Λασίθι") {
        link.href = "Στειρομανδρα.html";
    } else if (rowData[1] === "Βουνί (Οχθονιά) - Εύβοια") {
        link.href = "ΒουνιΕυβοια.html";
    } else if (rowData[1] === "Κρυοκεφάλα (Κρίμιανη) - Λασίθι") {
        link.href = "Κρυοκεφαλα.html";
    } else if (rowData[1] === "Κομποβούνι - Αχαΐα") {
        link.href = "Κομποβουνι.html";
    } else if (rowData[1] === "Παλιοπρέβεζα - Ευρυτανία") {
        link.href = "Παλιοπρεβεζα.html";
    } else if (rowData[1] === "Βραχιώνας - Ζάκυνθος") {
        link.href = "Βραχιωνας.html";
    } else if (rowData[1] === "Ντουσκάρας Βουνά - Ιωάννινα") {
        link.href = "Ντουσκαρας.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B - Αχαΐα") {
        link.href = "ΠροφητηςΗλιαςΑχαια.html";
    } else if (rowData[1] === "Μέγας Λάκκος - Λευκάδα") {
        link.href = "ΜεγαςΛακκοςΛευκαδα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Μήλος") {
        link.href = "ΠροφητηςΗλιαςΜηλος.html";
    } else if (rowData[1] === "Όνυχας - Χανιά") {
        link.href = "Ονυχας.html";
    } else if (rowData[1] === "Χρυσοβίτσας Βουνό - Αιτωλοακαρνανία") {
        link.href = "Χρυσοβιτσας.html";
    } else if (rowData[1] === "Φλιάμπουρι - Θεσπρωτία") {
        link.href = "Φλιαμπουρι.html";
    } else if (rowData[1] === "Σαγματάς - Βοιωτία") {
        link.href = "Σαγματας.html";
    } else if (rowData[1] === "Βουνί - Κάλαμος") {
        link.href = "ΒουνιΚαλαμος.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Λακωνία") {
        link.href = "ΠροφητηςΗλιαςΛακωνια744.html";
    } else if (rowData[1] === "Χελώνα (Χελώνη) - Αργολίδα") {
        link.href = "ΧελωναΧελωνη.html";
    } else if (rowData[1] === "Πυργάκι - Εύβοια") {
        link.href = "Πυργακι.html";
    } else if (rowData[1] === "Βενή Κορυφή (Βένι) - Ρέθυμνο") {
        link.href = "Βενη.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Αριά) - Άρτα") {
        link.href = "ΠροφητηςΗλιαςΑριαΑρτα.html";
    } else if (rowData[1] === "Ξεροσουβάλα - Εύβοια") {
        link.href = "Ξεροσουβαλα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Άγιος Ηλίας, Κουρί) - Θεσσαλονίκη") {
        link.href = "ΠροφητηςΗλιαςΘεσσαλονικηΚουρι.html";
    } else if (rowData[1] === "Γερακώνας (Γερακώνες) - Άνδρος") {
        link.href = "Γερακονας.html";
    } else if (rowData[1] === "Ξεροβούνι - Καρδίτσα") {
        link.href = "ΞεροβουνιΚαρδιτσα734.html";
    } else if (rowData[1] === "Βασιλικό - Ηράκλειο") {
        link.href = "ΒασιλικοΗρακλειο.html";
    } else if (rowData[1] === "Χασιού Κορυφή - Χανιά") {
        link.href = "ΧασιουΚορυφη.html";
    } else if (rowData[1] === "Κορυφή - Κορινθία") {
        link.href = "ΚορυφηΚορινθια731.html";
    } else if (rowData[1] === "Όρη Ζάρκου - Λάρισα, Τρίκαλα") {
        link.href = "ΖαρκουΟρηΘεσσαλια.html";
    } else if (rowData[1] === "Τσικνιάς - Τήνος") {
        link.href = "Τσικνιας.html";
    } else if (rowData[1] === "Μαυροβούνι (Χαλκοδόνιον, Καραντάου) - Λάρισα") {
        link.href = "ΜαυροβουνιΛαρισα725.html";
    } else if (rowData[1] === "Στρογγυλό - Κορινθία") {
        link.href = "Στρογγυλο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Άγιος Ηλίας) - Φθιώτιδα") {
        link.href = "ΠροφητηςΗλιαςΦθιωτιδα724.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Κορινθία") {
        link.href = "ΠροφητηςΗλιαςΚορινθια724.html";
    } else if (rowData[1] === "Τύμπανο (Κορακοβούνι) - Κορινθία") {
        link.href = "Τυμπανο.html";
    } else if (rowData[1] === "Περιστέρι (Γκαλόσι, Χήμι) - Εύβοια") {
        link.href = "ΠεριστεριΕυβοια.html";
    } else if (rowData[1] === "Μόβρη - Αχαΐα, Ηλεία") {
        link.href = "Μοβρη.html";
    } else if (rowData[1] === "Λούτσι - Λασίθι") {
        link.href = "ΛουτσιΛασιθι.html";
    } else if (rowData[1] === "Απιδιανά Βουνά - Λασίθι") {
        link.href = "Απιδιανα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Κάρπαθος") {
        link.href = "ΠροφητηςΗλιαςΚαρπαθος.html";
    } else if (rowData[1] === "Άγιοι Σαράντα - Άνδρος") {
        link.href = "ΑγιοιΣαρανταΑνδρος.html";
    } else if (rowData[1] === "Μαγκλαβάς - Μεσσηνία") {
        link.href = "Μαγκλαβας.html";
    } else if (rowData[1] === "Ετιανή Κεφάλα - Λασίθι") {
        link.href = "ΕτιανηΚεφαλα.html";
    } else if (rowData[1] === "Παλαιόκαστρο - Βοιωτία") {
        link.href = "Παλαιοκαστρο.html";
    } else if (rowData[1] === "Πύργος - Ίος") {
        link.href = "ΠυργοςΙος.html";
    } else if (rowData[1] === "Ορκίλλι - Κάρπαθος") {
        link.href = "Ορκιλλι.html";
    } else if (rowData[1] === "Πλακοκεφάλα - Λασίθι") {
        link.href = "Πλακοκεφαλα.html";
    } else if (rowData[1] === "Παλιοσαμαρίνα - Τρίκαλα") {
        link.href = "Παλιοσαμαρινα.html";
    } else if (rowData[1] === "Βαβύλα - Λακωνία") {
        link.href = "Βαβιλα.html";
    } else if (rowData[1] === "Κουλούρα - Κάρπαθος") {
        link.href = "ΚουλουραΚαρπαθος.html";
    } else if (rowData[1] === "Χρουσαίικο Βουνό - Αρκαδία") {
        link.href = "Χρουσαιικο.html";
    } else if (rowData[1] === "Βερσενίκος - Βοιωτία") {
        link.href = "Βερσενικος.html";
    } else if (rowData[1] === "Ψήλωμα (Βατόνια, Νέϊφτος) - Χαλκιδική") {
        link.href = "ΨηλωμαΧαλκιδικη.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αργολίδα") {
        link.href = "ΠροφητηςΗλιαςΑργολιδα702.html";
    } else if (rowData[1] === "Κάδιστο - Λασίθι") {
        link.href = "Καδιστο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Κορινθία") {
        link.href = "ΠροφητηςΗλιαςΚορινθια701.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Άρτα") {
        link.href = "ΠροφητηςΗλιαςΑρτα701.html";
    } else if (rowData[1] === "Μεγαβούνι (Πυργιώσα) - Αργολίδα") {
        link.href = "ΜεγαβουνιΑργολιδα.html";
    } else if (rowData[1] === "Μικρό - Ηράκλειο") {
        link.href = "ΜικροΗρακλειο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Αμοργός") {
        link.href = "ΠροφητηςΗλιαςΑμοργος.html";
    } else if (rowData[1] === "Χορεύτρα - Λέσβος") {
        link.href = "Χορευτρα.html";
    } else if (rowData[1] === "Γούπατα - Αιτωλοακαρνανία") {
        link.href = "Γουπατα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ - Νίσυρος") {
        link.href = "ΠροφητηςΗλιαςΝισυρος.html";
    } else if (rowData[1] === "Πασχαλιές - Βοιωτία") {
        link.href = "Πασχαλιες.html";
    } else if (rowData[1] === "Μέγα Όρος - Αιτωλοακαρνανία") {
        link.href = "ΜεγαΟροςΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Φθιώτιδα") {
        link.href = "ΠροφητηςΗλιαςΦθιωτιδα.html";
    } else if (rowData[1] === "Πυραμίδα - Κιλκίς") {
        link.href = "ΠυραμιδαΚιλκις.html";
    } else if (rowData[1] === "Βράχος - Δράμα") {
        link.href = "ΒραχοςΔραμα.html";
    } else if (rowData[1] === "Σύμβολο - Καβάλα") {
        link.href = "Συμβολο.html";
    } else if (rowData[1] === "Τίτανος (Δοβρούτσι) - Καρδίτσα, Λάρισα, Τρίκαλα") {
        link.href = "Τιτανος.html";
    } else if (rowData[1] === "Βλοχός - Αιτωλοακαρνανία") {
        link.href = "Βλοχος.html";
    } else if (rowData[1] === "Λαχανά Βουνά (Λαχανάς) - Θεσσαλονίκη") {
        link.href = "Λαχανας.html";
    } else if (rowData[1] === "Χόμαλης - Κάρπαθος") {
        link.href = "Χομαλης.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Άνδρος") {
        link.href = "ΠροφητηςΗλιαςΑνδρος684.html";
    } else if (rowData[1] === "Πυραμίς - Αιτωλοακαρνανία") {
        link.href = "ΠυραμιςΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Βίγλα - Ηράκλειο") {
        link.href = "ΒιγλαΗρακλειο.html";
    } else if (rowData[1] === "Στύρων Βουνά - Εύβοια") {
        link.href = "ΣτυρωνΒουνα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ - Σίφνος") {
        link.href = "ΠροφητηςΗλιαςΣιφνος.html";
    } else if (rowData[1] === "Πεζούλισες - Αχαΐα") {
        link.href = "Πεζουλισες.html";
    } else if (rowData[1] === "Ίσμαρος - Ροδόπη") {
        link.href = "ΙσμαροςΡοδοπη.html";
    } else if (rowData[1] === "Δέλφι - Σκόπελος") {
        link.href = "ΔελφιΣκοπελος.html";
    } else if (rowData[1] === "Μακρυά Λενιά - Εύβοια") {
        link.href = "ΜακρυαΛενια.html";
    } else if (rowData[1] === "Λυκοχωρίου Βουνό - Αρκαδία") {
        link.href = "ΛυκοχωριουΒουνο.html";
    } else if (rowData[1] === "Κουλές - Ρέθυμνο") {
        link.href = "ΚουλεςΡεθυμνο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ - Κάλυμνος") {
        link.href = "ΠροφητηςΗλιαςΚαλυμνος.html";
    } else if (rowData[1] === "Πριονόσκαλα - Αιτωλοακαρνανία") {
        link.href = "Πριονοσκαλα.html";
    } else if (rowData[1] === "Σκάρος - Λευκάδα") {
        link.href = "ΣκαροςΛευκαδα.html";
    } else if (rowData[1] === "Αητοράχη - Λέσβος") {
        link.href = "ΑητοραχηΛεσβος.html";
    } else if (rowData[1] === "Αντίμηλος - Αντίμηλος") {
        link.href = "Αντιμηλος.html";
    } else if (rowData[1] === "Ξυλόκαστρο - Αχαΐα") {
        link.href = "ΞυλοκαστροΑχαια.html";
    } else if (rowData[1] === "Νερόβουλο - Ιθάκη") {
        link.href = "ΝεροβουλοΙθακη.html";
    } else if (rowData[1] === "Κάστρο (Σιδηρόκαστρο) - Μεσσηνία") {
        link.href = "ΚαστροΜεσσηνια.html";
    } else if (rowData[1] === "Βόλβης Όρη - Θεσσαλονίκη") {
        link.href = "ΒολβηςΟρη.html";
    } else if (rowData[1] === "Ψηλή Ράχη - Αιτωλοακαρνανία") {
        link.href = "ΨηληΡαχη.html";
    } else if (rowData[1] === "Βάραθρο - Θεσπρωτία") {
        link.href = "Βαραθρο.html";
    } else if (rowData[1] === "Γριά Βίγλα - Ηράκλειο") {
        link.href = "ΓριαΒιγλαΗρακλειο.html";
    } else if (rowData[1] === "Φορτέτζα - Ρέθυμνο") {
        link.href = "ΦορτετζαΡεθυμνο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Φθιώτιδα") {
        link.href = "ΠροφητηςΗλιαςΦθιωτιδα655.html";
    } else if (rowData[1] === "Κορυφή - Έβρος") {
        link.href = "ΚορυφηΕβρος654.html";
    } else if (rowData[1] === "Προφήτης Ηλίας​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ - Τήλος") {
        link.href = "ΠροφητηςΗλιαςΤηλος.html";
    } else if (rowData[1] === "Γέρο Γιώργης - Αιτωλοακαρνανία") {
        link.href = "ΓεροΓιωργης.html";
    } else if (rowData[1] === "Διονυσοβούνι - Αττική") {
        link.href = "Διονυσοβουνι.html";
    } else if (rowData[1] === "Μεσοβούνι - Τήνος") {
        link.href = "ΜεσοβουνιΤηνος.html";
    } else if (rowData[1] === "Πάνειο - Αττική") {
        link.href = "ΠανειοΑττικη.html";
    } else if (rowData[1] === "Λίμη (Λουκίσσα) - Κεφαλληνία") {
        link.href = "ΛιμηΚεφαλληνια.html";
    } else if (rowData[1] === "Μύτη - Εύβοια") {
        link.href = "ΜυτηΕυβοια.html";
    } else if (rowData[1] === "Βαρνάβας (Μαυροβούνι) - Αττική") {
        link.href = "ΒαρναβαςΑττικη.html";
    } else if (rowData[1] === "Μαυρηνόρα (Μαυρονόρος) - Αττική") {
        link.href = "ΜαυρηνοραΑττικη.html";
    } else if (rowData[1] === "Πόρτες - Μαγνησία") {
        link.href = "ΠορτεςΜαγνησια.html";
    } else if (rowData[1] === "Τισαίο - Μαγνησία") {
        link.href = "ΤισαιοΜαγνησια.html";
    } else if (rowData[1] === "Κατσίκα - Χαλκιδική") {
        link.href = "ΚατσικαΧαλκιδικη.html";
    } else if (rowData[1] === "Παλαρράχη - Αιτωλοακαρνανία") {
        link.href = "Παλαρραχη.html";
    } else if (rowData[1] === "Τραγοβούνι - Μαγνησία, Φθιώτιδα") {
        link.href = "Τραγοβουνι.html";
    } else if (rowData[1] === "Ριζανών Βουνό - Κιλκίς, Σέρρες") {
        link.href = "ΡιζανωνΒουνο.html";
    } else if (rowData[1] === "Τρίκορφο - Εύβοια") {
        link.href = "ΤρικορφοΕυβοια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Βοιωτία, Φθιώτιδα") {
        link.href = "ΠροφητηςΗλιαςΒοιωτιαΦθιωτιδα637.html";
    } else if (rowData[1] === "Πέρδικας Βουνό - Θεσπρωτία") {
        link.href = "ΠερδικαςΒουνο.html";
    } else if (rowData[1] === "Κεφάλα - Ηράκλειο") {
        link.href = "ΚεφαλαΗρακλειο.html";
    } else if (rowData[1] === "Αχριανοβούνι - Αρκαδία") {
        link.href = "Αχριανοβουνι.html";
    } else if (rowData[1] === "Γυμνούλα - Θεσπρωτία") {
        link.href = "Γυμνουλα.html";
    } else if (rowData[1] === "Παχύ Βουνό - Σαρία") {
        link.href = "ΠαχυΒουνο.html";
    } else if (rowData[1] === "Παναγία (Πολύφεγγος) - Κορινθία") {
        link.href = "ΠαναγιαΚορινθια.html";
    } else if (rowData[1] === "Μετέωρα - Τρίκαλα") {
        link.href = "ΜετεωραΤρικαλα.html";
    } else if (rowData[1] === "Ορφανός - Τρίκαλα") {
        link.href = "ΟρφανοςΤρικαλα.html";
    } else if (rowData[1] === "Λόφος - Καβάλα") {
        link.href = "ΛοφοςΚαβαλα.html";
    } else if (rowData[1] === "Ύψωμα Αδελφών Ζαχαροπούλου (Κορύλοβο) - Δράμα") {
        link.href = "ΥψωμαΑδελφωνΖαχαροπουλου.html";
    } else if (rowData[1] === "Χούσακας - Ηράκλειο") {
        link.href = "ΧουσακαςΗρακλειο.html";
    } else if (rowData[1] === "Κεφάλι - Έβρος") {
        link.href = "ΚεφαλιΕβρος.html";
    } else if (rowData[1] === "Αγκαθερή - Λέσβος") {
        link.href = "ΑγκαθερηΛεσβος.html";
    } else if (rowData[1] === "Μεγαλοβούνι - Θεσπρωτία") {
        link.href = "ΜεγαλοβουνιΘεσπρωτια.html";
    } else if (rowData[1] === "Ανάβλοχας - Λασίθι") {
        link.href = "Αναβλοχας.html";
    } else if (rowData[1] === "Τσούκα - Κέρκυρα") {
        link.href = "ΤσουκαΚερκυρα.html";
    } else if (rowData[1] === "Κάψαλο - Έβρος") {
        link.href = "ΚαψαλοΕβρος.html";
    } else if (rowData[1] === "Θέρμου Βουνό - Αιτωλοακαρνανία") {
        link.href = "ΘερμουΒουνο.html";
    } else if (rowData[1] === "Βίγλα - Σύμη") {
        link.href = "ΒιγλαΣυμη.html";
    } else if (rowData[1] === "Μερέντα - Αττική") {
        link.href = "ΜερενταΑττικη.html";
    } else if (rowData[1] === "Νεραϊδίτης - Λάρισα, Μαγνησία") {
        link.href = "Νεραιδιτης.html";
    } else if (rowData[1] === "Παλιοβούνι - Έβρος") {
        link.href = "ΠαλιοβουνοΕβρος.html";
    } else if (rowData[1] === "Ψήλωμα - Βοιωτία") {
        link.href = "ΨηλωμαΒοιωτια.html";
    } else if (rowData[1] === "Ζούρβα (Βουνό Μαλάξας) - Χανιά") {
        link.href = "ΖουρβαΧανια.html";
    } else if (rowData[1] === "Κουκούλα - Κάλυμνος") {
        link.href = "ΚουκουλαΚαλυμνος.html";
    } else if (rowData[1] === "Αλογοβούνι - Αιτωλοακαρνανία") {
        link.href = "ΑλογοβουναΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Μεγάλο Βουνό - Ζάκυνθος") {
        link.href = "ΜεγαλοΒουνοΖακυνθος.html";
    } else if (rowData[1] === "Μεροβίγλι - Αιτωλοακαρνανία") {
        link.href = "ΜεροβιγλιΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Κεχροβούνι - Τήνος") {
        link.href = "ΚεχρουβουνιΤηνος.html";
    } else if (rowData[1] === "Ασφεντιλές - Χανιά") {
        link.href = "ΑσφεντιλεςΧανια.html";
    } else if (rowData[1] === "Λούτσα - Φθιώτιδα") {
        link.href = "ΛουτσαΦθιωτιδα.html";
    } else if (rowData[1] === "Τσίγγανη - Θεσπρωτία") {
        link.href = "ΤσιγγανηΘεσπρωτια.html";
    } else if (rowData[1] === "Παλιάμπελα - Θεσπρωτία") {
        link.href = "ΠαλιαμπελαΘεσπρωτια.html";
    } else if (rowData[1] === "Μεγάλος Πρίωνας - Κάσος") {
        link.href = "ΜεγαλοςΠριωναςΚασος.html";
    } else if (rowData[1] === "Μεροβίγλι - Χάλκη") {
        link.href = "ΜεροβιγλιΧαλκη.html";
    } else if (rowData[1] === "Ψηλή Παναγιά - Αιτωλοακαρνανία") {
        link.href = "ΨηληΠαναγιαΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Σουμάνι - Λακωνία") {
        link.href = "ΣουμανιΛακωνια.html";
    } else if (rowData[1] === "Πλαταριάς Βουνά - Θεσπρωτία") {
        link.href = "ΠλαταριαςΒουναΘεσπρωτια.html";
    } else if (rowData[1] === "Βουνοκορφή (Ψηλή Βίγλα) - Αργολίδα") {
        link.href = "ΒουνοκορφηΑργολιδα.html";
    } else if (rowData[1] === "Ανεμόμυλος - Ηράκλειο") {
        link.href = "ΑνεμομυλοςΗρακλειο.html";
    } else if (rowData[1] === "Μεγάλη Ράχη - Λακωνία") {
        link.href = "ΜεγαληΡαχηΛακωνια.html";
    } else if (rowData[1] === "Κορύφι - Κάρπαθος") {
        link.href = "ΚορυφιΚαρπαθος.html";
    } else if (rowData[1] === "Όψιον (Κορακόπετρα) - Λάρισα") {
        link.href = "ΟψιονΚορακοπετρα.html";
    } else if (rowData[1] === "Παλιόπυργος - Μαγνησία, Φθιώτιδα") {
        link.href = "ΠαλιοπυργοςΜαγνησιαΦθιωτιδα.html";
    } else if (rowData[1] === "Γαλατιανή - Κάλυμνος") {
        link.href = "ΓαλατιανηΚαλυμνος.html";
    } else if (rowData[1] === "Άντισσας Βουνά - Λέσβος") {
        link.href = "ΑντισσαςΒουναΛεσβος.html";
    } else if (rowData[1] === "Άγιος Ιωάννης Θεολόγος - Νίσυρος") {
        link.href = "ΑγιοςΙωαννηςΘεολογοςΝισυρος.html";
    } else if (rowData[1] === "Άκρος - Αργολίδα") {
        link.href = "ΑκροςΑργολιδα.html";
    } else if (rowData[1] === "Έρως - Ύδρα") {
        link.href = "ΕρωςΥδρα.html";
    } else if (rowData[1] === "Αστέρι - Ζάκυνθος") {
        link.href = "ΑστεριΖακυνθος.html";
    } else if (rowData[1] === "Τρούλλος - Σέριφος") {
        link.href = "ΤρουλλοςΣεριφος.html";
    } else if (rowData[1] === "Βίγλα - Ανάφη") {
        link.href = "ΒιγλαΑναφη.html";
    } else if (rowData[1] === "Πηγαδούλα - Αιτωλοακαρνανία") {
        link.href = "ΠηγαδουλαΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Πρινοβούνι) - Λέσβος") {
        link.href = "ΠροφητηςΗλιαςΠρινοβουνιΛεσβος.html";
    } else if (rowData[1] === "Φλαμουριά - Θεσπρωτία") {
        link.href = "ΦλαμουριαΘεσπρωτια.html";
    } else if (rowData[1] === "Μηλιανός - Κάλυμνος") {
        link.href = "ΜηλιανοςΚαλυμνος.html";
    } else if (rowData[1] === "Πυργιά - Ηράκλειο") {
        link.href = "ΠυργιαΗρακλειο.html";
    } else if (rowData[1] === "Παράριο - Βοιωτία, Φθιώτιδα") {
        link.href = "ΠαραριοΒοιωτια.html";
    } else if (rowData[1] === "Αϊλιάς - Λακωνία") {
        link.href = "ΑιλιαςΛακωνια.html";
    } else if (rowData[1] === "Δαμιανού Σωρός - Ηράκλειο") {
        link.href = "ΔαμιανουΣωροςΗρακλειο.html";
    } else if (rowData[1] === "Καλλιφώνιο - Αχαΐα") {
        link.href = "Καλλιφωνιο.html";
    } else if (rowData[1] === "Περδικούλα - Κορινθία") {
        link.href = "Περδικουλα.html";
    } else if (rowData[1] === "Σωρός - Ρέθυμνο") {
        link.href = "ΣωροςΡεθυμνο.html";
    } else if (rowData[1] === "Πετρόκαμπος - Ιωάννινα, Τρίκαλα") {
        link.href = "Πετροκαμπος.html";
    } else if (rowData[1] === "Βυρσίνη - Ροδόπη") {
        link.href = "Βυρσινη.html";
    } else if (rowData[1] === "Καθαρό (Τσίβι, Αλόιδα) - Λασίθι") {
        link.href = "Καθαρο.html";
    } else if (rowData[1] === "Πινακάκια - Ευρυτανία") {
        link.href = "Πινακακια.html";
    } else if (rowData[1] === "Κουβελαίικο Βουνό (Άγιος Ηλίας) - Μεσσηνία") {
        link.href = "ΚουβελαιικοΒουνο.html";
    } else if (rowData[1] === "Όρδυμνος - Λέσβος") {
        link.href = "Ορδυμνος.html";
    } else if (rowData[1] === "Αιγάλεω - Αττική") {
        link.href = "ΑιγαλεωοροςΑττικη.html";
    } else if (rowData[1] === "Ποικίλο - Αττική") {
        link.href = "ΠοικιλοΑττικη.html";
    }

    

    else if (rowData[1] === "Γαρδίκι - Φωκίδα") {
        link.href = "ΓαρδικιΦωκιδα.html";
    } else if (rowData[1] === "Βουνί - Γιούρα") {
        link.href = "ΒουνιΓιουρα.html";
    } else if (rowData[1] === "Άγιοι Δέκα - Κέρκυρα") {
        link.href = "ΑγιοιΔεκαΚερκυρα.html";
    } else if (rowData[1] === "Βουνοκορφή - Αττική") {
        link.href = "ΒουνοκορφηΑττικη.html";
    } else if (rowData[1] === "Παλαιόκαστρο - Κεφαλληνία") {
        link.href = "ΠαλαιοκαστροΚεφαλληνια.html";
    } else if (rowData[1] === "Κουτσούτης - Ρόδος") {
        link.href = "ΚουτσουτηςΡοδος.html";
    } else if (rowData[1] === "Πευκώνας - Κορινθία") {
        link.href = "ΠευκωναςΚορινθια.html";
    } else if (rowData[1] === "Καμήλα - Θεσσαλονίκη, Κιλκίς") {
        link.href = "ΚαμηλαΘεσσαλονικηΚιλκις.html";
    } else if (rowData[1] === "Παλούκι - Σκόπελος") {
        link.href = "ΠαλουκιΣκοπελος.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Σαντορίνη") {
        link.href = "ΠροφητηςΗλιαςΣαντορινη.html";
    } else if (rowData[1] === "Σφίγγιον - Βοιωτία") {
        link.href = "ΣφιγγιονΒοιωτια.html";
    } else if (rowData[1] === "Μπετσίκι - Μεσσηνία") {
        link.href = "ΜπετσικιΜεσσηνια.html";
    } else if (rowData[1] === "Γαλατσίδα - Βοιωτία") {
        link.href = "ΓαλατσιδαΒοιωτια.html";
    } else if (rowData[1] === "Τρίκορφο - Αιτωλοακαρνανία") {
        link.href = "ΤρικορφοΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Κέα") {
        link.href = "ΠροφητηςΗλιαςΚεα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Πρέβεζα") {
        link.href = "ΠροφητηςΗλιαςΠρεβεζα.html";
    } else if (rowData[1] === "Κορυφή - Θεσσαλονίκη") {
        link.href = "ΚορυφηΘεσσαλονικη.html";
    } else if (rowData[1] === "Κούκουμας - Εύβοια") {
        link.href = "ΚουκουμαςΕυβοια.html";
    } else if (rowData[1] === "Καμάρι - Αττική") {
        link.href = "ΚαμαριΑττικη.html";
    } else if (rowData[1] === "Αγριλίκι - Αττική") {
        link.href = "ΑγριλικιΑττικη.html";
    } else if (rowData[1] === "Κουκούμα - Θεσπρωτία") {
        link.href = "ΚουκουμαΘεσπρωτια.html";
    } else if (rowData[1] === "Μαυροβούνι - Λακωνία") {
        link.href = "ΜαυροβουνιΛακωνια.html";
    } else if (rowData[1] === "Πύργος - Αιτωλοακαρνανία") {
        link.href = "ΠυργοςΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Άγιος Γεώργιος - Μεσσηνία") {
        link.href = "ΑγιοςΓεωργιοςΜεσσηνια.html";
    } else if (rowData[1] === "Μικρή Τούμπα - Καβάλα") {
        link.href = "ΜικρηΤουμπαΚαβαλα.html";
    } else if (rowData[1] === "Τρίλοφο - Λέσβος") {
        link.href = "ΤριλοφοΛεσβος.html";
    } else if (rowData[1] === "Τρούλλος - Σίκινος") {
        link.href = "ΤρουλλοςΣικινος.html";
    } else if (rowData[1] === "Μαργαρίτα - Πρέβεζα") {
        link.href = "ΜαργαριταΠρεβεζα.html";
    } else if (rowData[1] === "Πυργάρι - Εύβοια") {
        link.href = "ΠυργαριΕυβοια.html";
    } else if (rowData[1] === "Μεγαβούνι - Μαγνησία") {
        link.href = "ΜεγαβουνιΜαγνησια.html";
    } else if (rowData[1] === "Παλιοβούνα - Βοιωτία, Φθιώτιδα") {
        link.href = "ΠαλιοβουναΒοιωτιαΦθιωτιδα.html";
    } else if (rowData[1] === "Αλογομάνδρα - Αργολίδα") {
        link.href = "ΑλογομανδραΑργολιδα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Κεφαλληνία") {
        link.href = "ΠροφητηςΗλιαςΚεφαλληνια.html";
    } else if (rowData[1] === "Στεφάνια - Βοιωτία, Φθιώτιδα") {
        link.href = "ΣτεφανιαΒοιωτιαΦθιωτιδα.html";
    } else if (rowData[1] === "Κουρτερή - Λέσβος") {
        link.href = "ΚουρτερηΛεσβος.html";
    } else if (rowData[1] === "Μόδι - Λασίθι") {
        link.href = "ΜοδιΛασιθι.html";
    } else if (rowData[1] === "Ερμίτης - Θεσπρωτία, Πρέβεζα") {
        link.href = "ΕρμιτηςΘεσπρωτιαΠρεβεζα.html";
    } else if (rowData[1] === "Κάστρο - Λευκάδα") {
        link.href = "ΚαστροΛευκαδα.html";
    } else if (rowData[1] === "Βελανιδιά - Μαγνησία") {
        link.href = "ΒελανιδιαΜαγνησια.html";
    } else if (rowData[1] === "Δύο Βουνά - Τήνος") {
        link.href = "ΔυοΒουναΤηνος.html";
    } else if (rowData[1] === "Πυραμίδα (Βελατούρι) - Αττική") {
        link.href = "ΠυραμιδαΒελατουριΑττικη.html";
    } else if (rowData[1] === "Πύρλιας - Αχαΐα") {
        link.href = "ΠυρλιαςΑχαια.html";
    } else if (rowData[1] === "Όρος - Αίγινα") {
        link.href = "ΟροςΑιγινα.html";
    } else if (rowData[1] === "Φυλλήϊον - Λάρισα, Τρίκαλα") {
        link.href = "ΦυλληιονΛαρισαΤρικαλα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Ψαρά") {
        link.href = "ΠροφητηςΗλιαςΨαρα.html";
    } else if (rowData[1] === "Φωτεινό - Ροδόπη") {
        link.href = "ΦωτεινοΡοδοπη.html";
    } else if (rowData[1] === "Σαργού Κεφάλα - Λασίθι") {
        link.href = "ΣαργουΚεφαλαΛασιθι.html";
    } else if (rowData[1] === "Δραπανοκεφάλα - Χανιά") {
        link.href = "ΔραπανοκεφαλαΧανια.html";
    } else if (rowData[1] === "Μαυροβούνι - Μαγνησία") {
        link.href = "ΜαυροβουνιΜαγνησια.html";
    } else if (rowData[1] === "Σκλόπα - Χανιά") {
        link.href = "ΣκλοπαΧανια.html";
    } else if (rowData[1] === "Κόρακας - Αμοργός") {
        link.href = "ΚορακαςΑμοργος.html";
    } else if (rowData[1] === "Μαυρόπολι - Εύβοια") {
        link.href = "ΜαυροπολιΕυβοια.html";
    } else if (rowData[1] === "Κεφάλα - Χανιά") {
        link.href = "ΚεφαλαΧανια.html";
    } else if (rowData[1] === "Μισοπέτρι - Εύβοια") {
        link.href = "ΜισοπετριΕυβοια.html";
    } else if (rowData[1] === "Λυγκοβίτσι - Αιτωλοακαρνανία") {
        link.href = "ΛυγκοβιτσιΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Γρίβας - Λάρισα") {
        link.href = "ΓριβαςΛαρισα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Φωκίδα") {
        link.href = "ΠροφητηςΗλιαςΦωκιδα.html";
    } else if (rowData[1] === "Χαβαλάς - Λακωνία") {
        link.href = "ΧαβαλαςΛακωνια.html";
    } else if (rowData[1] === "Όρος - Λακωνία") {
        link.href = "ΟροςΛακωνια.html";
    } else if (rowData[1] === "Θύλακας - Λασίθι") {
        link.href = "ΘυλακαςΛασιθι.html";
    } else if (rowData[1] === "Κοκκινόβραχος - Βοιωτία") {
        link.href = "ΚοκκινοβραχοςΒοιωτια.html";
    } else if (rowData[1] === "Ντουχέρα - Ιθάκη") {
        link.href = "ΝτουχεραΙθακη.html";
    } else if (rowData[1] === "Βραχάκι - Εύβοια") {
        link.href = "ΒραχακιΕυβοια.html";
    } else if (rowData[1] === "Ζαρναούρα - Μαγνησία") {
        link.href = "ΖαρναουραΜαγνησια.html";
    } else if (rowData[1] === "Ομπόρι - Ύδρα") {
        link.href = "ΟμποριΥδρα.html";
    } else if (rowData[1] === "Λαχτιές - Κεφαλληνία") {
        link.href = "ΛαχτιεςΚεφαλληνια.html";
    } else if (rowData[1] === "Λυκοβούνι - Λακωνία") {
        link.href = "ΛυκοβουνιΛακωνια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Ρόδος") {
        link.href = "ΠροφητηςΗλιαςΡοδος.html";
    } else if (rowData[1] === "Τραγόσταλος - Λασίθι") {
        link.href = "ΤραγοσταλοςΛασιθι.html";
    } else if (rowData[1] === "Μεγάλο Βουνό - Εύβοια") {
        link.href = "ΜεγαλοΒουνοΕυβοια.html";
    } else if (rowData[1] === "Κούτσικο - Εύβοια") {
        link.href = "ΚουτσικοΕυβοια.html";
    } else if (rowData[1] === "Κόρακας - Φούρνοι") {
        link.href = "ΚορακαςΦουρνοι.html";
    } else if (rowData[1] === "Όρος - Σέριφος") {
        link.href = "ΟροςΣεριφος.html";
    } else if (rowData[1] === "Μαύρον Όρος - Θεσπρωτία") {
        link.href = "ΜαυρονΟροςΘεσπρωτια.html";
    } else if (rowData[1] === "Σαρακηνόκαστρο - Εύβοια") {
        link.href = "ΣαρακηνοκαστροΕυβοια.html";
    } else if (rowData[1] === "Κουρμούτσι - Φωκίδα") {
        link.href = "ΚουρμουτσιΦωκιδα.html";
    } else if (rowData[1] === "Στέρνα - Αιτωλοακαρνανία") {
        link.href = "ΣτερναΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Ξεροβούνι - Θεσπρωτία") {
        link.href = "ΞεροβουνιΘεσπρωτια.html";
    } else if (rowData[1] === "Ηρακλής - Κέρκυρα") {
        link.href = "ΗρακληςΚερκυρα.html";
    } else if (rowData[1] === "Μερμηγκάρης - Κύθηρα") {
        link.href = "ΜερμηγκαρηςΚυθηρα.html";
    } else if (rowData[1] === "Κλαδάρες - Λάρισα") {
        link.href = "ΚλαδαρεςΛαρισα.html";
    } else if (rowData[1] === "Μαύρη Ώρα - Κορινθία") {
        link.href = "ΜαυρηΩραΚορινθια.html";
    } else if (rowData[1] === "Κάψαλος (Περιόλας) - Κάσος") {
        link.href = "ΚαψαλοςΠεριολαςΚασος.html";
    } else if (rowData[1] === "Κάστρο - Αργολίδα") {
        link.href = "ΚαστροΑργολιδα.html";
    } else if (rowData[1] === "Κακό Τσουρούμι - Ρόδος") {
        link.href = "ΚακοΤσουρουμιΡοδος.html";
    } else if (rowData[1] === "Αυγό - Θεσπρωτία") {
        link.href = "ΑυγοΘεσπρωτια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Φωκίδα") {
        link.href = "ΠροφητηςΗλιαςΦωκιδα.html";
    } else if (rowData[1] === "Γέρακας - Ρόδος") {
        link.href = "ΓερακαςΡοδος.html";
    } else if (rowData[1] === "Ακόντιο - Βοιωτία") {
        link.href = "ΑκοντιοΒοιωτια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Κάρπαθος") {
        link.href = "ΠροφητηςΗλιαςΚαρπαθος.html";
    } else if (rowData[1] === "Πεντεσκούφι - Κορινθία") {
        link.href = "ΠεντεσκουφιΚορινθια.html";
    }
    
    


    
    // Add more conditions for other mountains if needed
    
    link.textContent = rowData[1]; // Set the text content of the link
    secondCell.appendChild(link); // Append the link to the second cell
    row.appendChild(secondCell); // Append the second cell to the row
    
    // Create the remaining cells
    for (let i = 2; i < rowData.length; i++) {
        const cell = document.createElement('td'); // Create a table cell
        cell.textContent = rowData[i]; // Set the cell's content
        row.appendChild(cell); // Append the cell to the row
    }
    
    tableBody.appendChild(row); // Append the row to the table body
});

async function handleEnter(event) {
    if (event.key === "Enter") {
        event.preventDefault(); // Prevents default actions, such as form submission
        await search(); // Calls the search function
    }
}


// Search function to dynamically generate search results
async function search() {
    const searchTerm = convertToGreekLatin(removeDiacritics(document.getElementById('searchInput').value.trim().toLowerCase()));

    const searchResults = document.getElementById('searchResults');


    searchResults.innerHTML = '';

    if (searchTerm) {
        const ul = document.createElement('ul');
        ul.id = 'resultsList'; // ✅ Add this line
                
        
        data.forEach(rowData => {
            const normalizedFirstColumnData = convertToGreekLatin(removeDiacritics(rowData[1].toLowerCase()));
            const normalizedSpecifiedColumnData = convertToGreekLatin(removeDiacritics(rowData[2].toLowerCase())); // Assuming the specified column is the third column
            
            if (normalizedFirstColumnData.includes(searchTerm) || normalizedSpecifiedColumnData.includes(searchTerm)) {
                const li = document.createElement('li'); 
                
                const link = document.createElement('a');
                link.textContent = rowData[1];
                
                // Adjust the URL based on the row data
                if (rowData[1] === "Όλυμπος - Λάρισα, Πιερία") {
                    link.href = "Ολυμπος.html";
                } else if (rowData[1] === "Σμόλικας - Ιωάννινα") {
                    link.href = "Σμολικας.html";
                } else if (rowData[1] === "Γράμμος - Ιωάννινα, Καστοριά") {
                    link.href = "Γραμμος.html";
                } else if (rowData[1] === "Τύμφη - Ιωάννινα") {
                    link.href = "Τυμφη.html";
                } else if (rowData[1] === "Ψηλορείτης (Ίδη) - Ηράκλειο, Ρέθυμνο") {
                    link.href = "Ψηλορειτης.html";
                } else if (rowData[1] === "Λευκά Όρη (Μαδάρες) - Χανιά") {
                    link.href = "Λευκα Ορη.html";
                } else if (rowData[1] === "Κακαρδίτσα - Ιωάννινα, Τρίκαλα, Άρτα") {
                    link.href = "Κακαρδιτσα.html";
                } else if (rowData[1] === "Ταΰγετος - Λακωνία, Μεσσηνία") {
                    link.href = "Ταυγετος.html";
                } else if (rowData[1] === "Ζήρεια (Κυλλήνη) - Κορινθία") {
                    link.href = "Ζηρεια.html";
                } else if (rowData[1] === "Χελμός (Αροάνια) - Αχαΐα") {
                    link.href = "Χελμος.html";
                } else if (rowData[1] === "Βασιλίτσα - Γρεβενά, Ιωάννινα") {
                    link.href = "Βασιλιτσα.html";
                } else if (rowData[1] === "Περιστέρι (Λάκμος) - Ιωάννινα, Τρίκαλα") {
                    link.href = "Λακμος.html";
                } else if (rowData[1] === "Φαλακρό (Μποζ Νταγ) - Δράμα") {
                    link.href = "Φαλακρο.html";
                } else if (rowData[1] === "Δοκίμι (Δοκίμι Χαλικίου) - Ιωάννινα, Τρίκαλα") {
                    link.href = "Δοκιμι.html";
                } else if (rowData[1] === "Τίταρος (Μικρό Φλάμπουρο) - Κοζάνη, Λάρισα") {
                    link.href = "Τιταρος.html";
                } else if (rowData[1] === "Βουνά Κάρδαμου - Ροδόπη") {
                    link.href = "ΒουναΚαρδαμου.html";
                } else if (rowData[1] === "Βουνά Κύμης - Ροδόπη") {
                    link.href = "ΒουναΚυμης.html";
                } else if (rowData[1] === "Ιερό (Μπουκατέ Νταγ) - Έβρος, Ροδόπη") {
                    link.href = "Ιερο.html";
                } else if (rowData[1] === "Ορφέας - Έβρος, Ροδόπη") {
                    link.href = "Ορφεας.html";
                } else if (rowData[1] === "Βουνά Καλότυχου - Ξάνθη") {
                    link.href = "ΒουναΚαλοτυχου.html";
                } else if (rowData[1] === "Βουνά Οργάνης - Ροδόπη") {
                    link.href = "ΒουναΟργανης.html";
                } else if (rowData[1] === "Βουνά Μύτικα - Ροδόπη") {
                    link.href = "ΒουναΜυτικα.html";
                } else if (rowData[1] === "Σάπκα - Ροδόπη, Έβρος") {
                    link.href = "Σαπκα.html";
                } else if (rowData[1] === "Χαράκωμα (Σίλο) - Έβρος, Ροδόπη") {
                    link.href = "Χαρακωμα.html";
                } else if (rowData[1] === "Βυρσίνη - Ροδόπη") {
                    link.href = "Βυρσινη.html";
                } else if (rowData[1] === "Καμερτζή (Μαυροπαίδι, Καρά Ογλάν) - Ξάνθη") {
                    link.href = "Καμερτζη.html";
                } else if (rowData[1] === "Όρη Μελίβοιας - Ξάνθη") {
                    link.href = "ΟρηΜελιβοιας.html";
                } else if (rowData[1] === "Όρη Θερμών - Ξάνθη") {
                    link.href = "ΟρηΘερμων.html";
                } else if (rowData[1] === "Φινέας - Ξάνθη") {
                    link.href = "Φινεας.html";
                } else if (rowData[1] === "Θρακικά Μετέωρα - Ροδόπη") {
                    link.href = "ΘρακικαΜετεωρα.html";
                } else if (rowData[1] === "Μέλτη - Ξάνθη") {
                    link.href = "Μελτη.html";
                } else if (rowData[1] === "Παπίκιο (Καρλίκ Νταγ) - Ροδόπη") {
                    link.href = "Παπικιο.html";
                } else if (rowData[1] === "Μαύρο Ίσιωμα - Ξάνθη") {
                    link.href = "ΜαυροΙσιωμα.html";
                } else if (rowData[1] === "Αχλάτ Τσαλ (Αχλαδόβουνο) - Ξάνθη") {
                    link.href = "ΑχλαΤσαλ.html";
                } else if (rowData[1] === "Γεράνεια - Ξάνθη") {
                    link.href = "ΓερανειαΚορυφη.html";
                } else if (rowData[1] === "Αυγό (Σταύρος Τσακίρης) - Ξάνθη") {
                    link.href = "ΣταυροςΤσακιρης.html";
                } else if (rowData[1] === "Στάμνα (Τζούρα, Κουσλάρι, Κιτρινοβούνι, Ψήλωμα) - Δράμα") {
                    link.href = "ΣταμναΡοδοπη.html";
                } else if (rowData[1] === "Ερμάριο - Ξάνθη") {
                    link.href = "Ερμαριο.html";
                } else if (rowData[1] === "Χαϊντού (Ερύμανθος, Γυφτόκαστρο) - Δράμα, Ξάνθη") {
                    link.href = "Χαιντου.html";
                } else if (rowData[1] === "Μπρινιάς (Δρυζές, Πρινιάς) - Λασίθι") {
                    link.href = "Μπρινιας.html";
                } else if (rowData[1] === "Ασφεντιλιάς (Ανατολικά Αστερούσια) - Ηράκλειο") {
                    link.href = "Ασφεντιλιας.html";
                } else if (rowData[1] === "Πλαγιές (Βουνά Ζίρου) - Λασίθι") {
                    link.href = "Πλαγιες.html";
                } else if (rowData[1] === "Αστερούσια Όρη - Ηράκλειο") {
                    link.href = "Αστερουσια.html";
                } else if (rowData[1] === "Κουλούκωνας (Ταλλαία Όρη) - Ρέθυμνο") {
                    link.href = "Κουλουκωνας.html";
                } else if (rowData[1] === "Οξύ Κεφάλι - Ηράκλειο") {
                    link.href = "ΟξυΚεφαλι.html";
                } else if (rowData[1] === "Γιούχτας - Ηράκλειο") {
                    link.href = "Γιουχτας.html";
                } else if (rowData[1] === "Στρούμπουλας - Ηράκλειο") {
                    link.href = "Στρουμπουλας.html";
                } else if (rowData[1] === "Βρύσινας - Ρέθυμνο") {
                    link.href = "Βρυσινας.html";
                } else if (rowData[1] === "Βουβάλα - Ρέθυμνο") {
                    link.href = "Βουβαλα.html";
                } else if (rowData[1] === "Κουρούπα - Ρέθυμνο") {
                    link.href = "Κουρουπα.html";
                } else if (rowData[1] === "Καψάς - Λασίθι") {
                    link.href = "Καψας.html";
                } else if (rowData[1] === "Δίκτη (Λασιθιώτικα Βουνά) - Ηράκλειο, Λασίθι") {
                    link.href = "Δικτη.html";
                } else if (rowData[1] === "Κέδρος (Ανάληψη) - Ρέθυμνο") {
                    link.href = "Κεδρος.html";
                } else if (rowData[1] === "Ψηλορείτης (Ίδη) - Ηράκλειο, Ρέθυμνο") {
                    link.href = "Ψηλορειτης.html";
                } else if (rowData[1] === "Λευκά Όρη (Μαδάρες) - Χανιά") {
                    link.href = "ΛευκαΟρη.html";
                } else if (rowData[1] === "Σελένα - Ηράκλειο, Λασίθι") {
                    link.href = "Σελενα.html";
                } else if (rowData[1] === "Μονοδένδρι - Ηράκλειο") {
                    link.href = "Μονοδενδρι.html";
                } else if (rowData[1] === "Καταλύματα - Λασίθι") {
                    link.href = "Καταλυματα.html";
                } else if (rowData[1] === "Πλακάκια - Χανιά") {
                    link.href = "Πλακακια.html";
                } else if (rowData[1] === "Ξηρό - Ρέθυμνο") {
                    link.href = "Ξηρο.html";
                } else if (rowData[1] === "Ρωμανάτη - Λασίθι") {
                    link.href = "Ρωμανατη.html";
                } else if (rowData[1] === "Κουτρούλης - Χανιά") {
                    link.href = "Κουτρουλης.html";
                }  else if (rowData[1] === "Μεγάλη Κορυφή - Λασίθι") {
                    link.href = "ΜεγαληΚορυφη.html";
                }  else if (rowData[1] === "Κουτρούλης - Χανιά") {
                    link.href = "Κουτρουλης.html";
                } else if (rowData[1] === "Τουρλί (Τρουλλί) - Χανιά") {
                    link.href = "Τουρλι.html";
                } else if (rowData[1] === "Κρανιά - Αχαΐα") {
                    link.href = "Κρανια.html";
                } else if (rowData[1] === "Σάμιτος - Ρέθυμνο") {
                    link.href = "Σαμιτος.html";
                } else if (rowData[1] === "Κατσονύχι - Ρέθυμνο") {
                    link.href = "Κατσονυχι.html";
                } else if (rowData[1] === "Λουλουδάκης - Ηράκλειο, Λασίθι") {
                    link.href = "Λουλουδακης.html";
                } else if (rowData[1] === "Σιδέρωτας (Ασιδέρωτο, Ανάληψη) - Ρέθυμνο") {
                    link.href = "Σιδερωτας.html";
                } else if (rowData[1] === "Άγιος Δίκαιος - Χανιά") {
                    link.href = "ΑγιοςΔικαιος.html";
                } else if (rowData[1] === "Αποπηγάδι - Χανιά") {
                    link.href = "Αποπηγαδι.html";
                } else if (rowData[1] === "Θρυπτή (Αφέντης Σταυρωμένος) - Λασίθι") {
                    link.href = "ΟρηΘρυπτης.html";
                } else if (rowData[1] === "Πλατιά Κορφή (Ανεφαλάκος) - Λασίθι") {
                    link.href = "ΠλατιαΚορφη.html";
                } else if (rowData[1] === "Αγκαθές (Χορεύτρες) - Χανιά") {
                    link.href = "Αγκαθες.html";
                } else if (rowData[1] === "Σαρακηνός - Ηράκλειο, Λασίθι") {
                    link.href = "Σαρακηνος.html";
                } else if (rowData[1] === "Βολακιάς - Χανιά") {
                    link.href = "Βολακιας.html";
                } else if (rowData[1] === "Ορνό - Λασίθι") {
                    link.href = "Ορνο.html";
                } else if (rowData[1] === "Σητειακά Όρη- Λασίθι") {
                    link.href = "ΣητειακαΟρη.html";
                } else if (rowData[1] === "Κορυφή Ξενογιώργη - Λασίθι") {
                    link.href = "Ξενογιωργη.html";
                } else if (rowData[1] === "Καλόν Ορος - Κεφαλληνία") {
                    link.href = "ΚαλονΟρος.html";
                } else if (rowData[1] === "Καστρί - Κεφαλληνία") {
                    link.href = "Καστρι.html";
                } else if (rowData[1] === "Προφήτης Ηλίας - Ρόδος") {
                    link.href = "ΠροφητηςΗλιαςΡοδου.html";
                } else if (rowData[1] === "Νήριτο Όρος - Ιθάκη") {
                    link.href = "ΝηριτοΟρος.html";
                } else if (rowData[1] === "Αμανή - Χίος") {
                    link.href = "Αμανη.html";
                } else if (rowData[1] === "Σπηλακιά (Αίπος, Κοχλιός) - Χίος") {
                    link.href = "Σπηλακια.html";
                } else if (rowData[1] === "Αυγό - Κεφαλληνία") {
                    link.href = "ΑυγοΚεφαλλονιας.html";
                } else if (rowData[1] === "Όλυμπος - Λέσβος") {
                    link.href = "ΟλυμποςΛεσβου.html";
                } else if (rowData[1] === "Λεπέτυμνος Αγιολιάς - Λέσβος") {
                    link.href = "Λεπετυμνος.html";
                } else if (rowData[1] === "Λάστος - Κάρπαθος") {
                    link.href = "Λαστος.html";
                } else if (rowData[1] === "Υψάριο (Ψαριό) - Θάσος") {
                    link.href = "Υψαριο.html";
                } else if (rowData[1] === "Άγιος Ηλίας - Λευκάδα") {
                    link.href = "ΑγιοςΗλιας.html";
                } else if (rowData[1] === "Αγία Δυνατή - Κεφαλληνία") {
                    link.href = "ΑγιαΔυνατη.html";
                } else if (rowData[1] === "Καρβούνης - Σάμος") {
                    link.href = "Καρβουνης.html";
                } else if (rowData[1] === "Ζας (Ζευς) - Νάξος") {
                    link.href = "Ζας.html";
                } else if (rowData[1] === "Κορωνός - Νάξος") {
                    link.href = "Κορωνος.html";
                } else if (rowData[1] === "Κουβάρα - Ανδρος") {
                    link.href = "Κουβαρα.html";
                } else if (rowData[1] === "Ακραμύτης - Ρόδος") {
                    link.href = "Ακραμυτης.html";
                } else if (rowData[1] === "Κρούκελλος - Αμοργός") {
                    link.href = "Κρουκελλος.html";
                } else if (rowData[1] === "Δίκαιος - Κως") {
                    link.href = "Δικαιος.html";
                } else if (rowData[1] === "Φανάρι - Νάξος") {
                    link.href = "Φαναρι.html";
                } else if (rowData[1] === "Άτρος - Κεφαλληνία") {
                    link.href = "Ατρος.html";
                } else if (rowData[1] === "Παντοκράτωρ - Κέρκυρα") {
                    link.href = "Παντοκρατωρ.html";
                } else if (rowData[1] === "Ημεροβίγλι (Μεροβίγλι) - Κεφαλληνία") {
                    link.href = "Ημεροβιγλι.html";
                } else if (rowData[1] === "Αθέρας - Ικαρία") {
                    link.href = "Αθερας.html";
                } else if (rowData[1] === "Μέλισσα - Ικαρία") {
                    link.href = "Μελισσα.html";
                } else if (rowData[1] === "Προφήτης Ηλίας - Λέσβος") {
                    link.href = "ΠροφητηςΗλιαςΛεσβου.html";
                } else if (rowData[1] === "Σάος - Σαμοθράκη") {
                    link.href = "Σαος.html";
                } else if (rowData[1] === "Αίνος - Κεφαλληνία") {
                    link.href = "Αινος.html";
                } else if (rowData[1] === "Αττάβυρος - Ρόδος") {
                    link.href = "Ατταβυρος.html";
                } else if (rowData[1] === "Πελινναίον - Χίος") {
                    link.href = "Πελινναιον.html";
                } else if (rowData[1] === "Κερκετεύς (Κέρκης) - Σάμος") {
                    link.href = "Κερκετευς.html";
                } else if (rowData[1] === "Κρυονερίτης - Ρέθυμνο") {
                    link.href = "Κρυονεριτης.html";
                } else if (rowData[1] === "Ξηχόρτι - Ηλεία") {
                    link.href = "Ξηχορτι.html";
                } else if (rowData[1] === "Σουρμπάς - Αχαΐα") {
                    link.href = "Σουρμπας.html";
                } else if (rowData[1] === "Άγιος Κωνσταντίνος - Λακωνία") {
                    link.href = "ΑγιοςΚωνσταντινοςΛακ.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B - Μεσσηνία") {
                    link.href = "ΠροφητηςΗλιαςMess.html";
                } else if (rowData[1] === "Ράχη - Αργολίδα") {
                    link.href = "Ραχη.html";
                } else if (rowData[1] === "Μπούρα - Μεσσηνία") {
                    link.href = "Μπουρα.html";
                } else if (rowData[1] === "Βουνό Ρούσσου (Ρούσο Βουνό) - Λακωνία") {
                    link.href = "ΒουνοΡουσσου.html";
                } else if (rowData[1] === "Νεραϊδοβούνι - Αχαΐα") {
                    link.href = "Νεραιδοβουνι.html";
                } else if (rowData[1] === "Εκκλησάκι - Κορινθία") {
                    link.href = "Εκκλησακι.html";
                } else if (rowData[1] === "Ευαγγελίστρια - Κορινθία") {
                    link.href = "Ευαγγελιστρια.html";
                } else if (rowData[1] === "Λάκκα Κοκκίνη (Κερνίκελο, Μάλια Λένι) - Αργολίδα, Κορινθία") {
                    link.href = "ΛακκαΚοκκινη.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αρκαδία") {
                    link.href = "ΠροφητηςΗλιας1117.html";
                } else if (rowData[1] === "Όρη Τροπαίων - Αρκαδία") {
                    link.href = "ΟρηΤροπαιων.html";
                } else if (rowData[1] === "Δρακοβούνι - Αρκαδία") {
                    link.href = "Δρακοβουνι.html";
                } else if (rowData[1] === "Καλογεροβούνι - Λακωνία") {
                    link.href = "Καλογεροβουνι.html";
                } else if (rowData[1] === "Τριαντάφυλλα - Αρκαδία") {
                    link.href = "Τριανταφυλλα.html";
                } else if (rowData[1] === "Άγιος Κωνσταντίνος - Αρκαδία") {
                    link.href = "ΑγιοςΚωνσταντινοςΑρκαδιας.html";
                } else if (rowData[1] === "Αλογομάνδρα - Αρκαδία, Λακωνία") {
                    link.href = "Αλογομανδρα.html";
                } else if (rowData[1] === "Μακρυλάκκωμα - Λακωνία") {
                    link.href = "Μακρυλακκωμα.html";
                } else if (rowData[1] === "Σγουριάς - Αρκαδία") {
                    link.href = "Σγουριας.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αχαΐα") {
                    link.href = "ΠροφητηςΗλιαςΑχαια754.html";
                } 
                else if (rowData[1] === "Κακοβούνια - Λακωνία") {
                    link.href = "Κακοβουνια.html";
                } else if (rowData[1] === "Βερντάτση - Μεσσηνία") {
                    link.href = "Βερντατση.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αρκαδία") {
                    link.href = "ΠροφητηςΗλιας850.html";
                } else if (rowData[1] === "Άγιοι Ασώματοι - Αχαΐα") {
                    link.href = "ΑγιοιΑσωματοι.html";
                } else if (rowData[1] === "Κεραύσιον Όρος (Ματεσαίικο Βουνό) - Ηλεία") {
                    link.href = "ΚεραυσιονΟρος.html";
                } else if (rowData[1] === "Μαυροβούνι - Αργολίδα") {
                    link.href = "Μαυροβουνι.html";
                } else if (rowData[1] === "Δροσοβούνι - Αρκαδία") {
                    link.href = "Δροσοβουνι.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B - Αχαΐα") {
                    link.href = "ΠροφητηςΗλιας1142.html";
                } else if (rowData[1] === "Καστέλλια - Αχαΐα") {
                    link.href = "Καστελλια.html";
                } else if (rowData[1] === "Κράβαρης (Γκράβαρης, Βόρειον) - Αρκαδία") {
                    link.href = "Κραβαρης.html";
                } else if (rowData[1] === "Άγιος Χριστόφορος - Αρκαδία") {
                    link.href = "ΑγιοςΧριστοφοροςΑρκαδιας.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αρκαδία") {
                    link.href = "ΠροφητηςΗλιας1119.html";
                } else if (rowData[1] === "Κουλοχέρα - Λακωνία") {
                    link.href = "Κουλοχερα.html";
                } else if (rowData[1] === "Κούκουρας - Αρκαδία") {
                    link.href = "Κουκουρας.html";
                } else if (rowData[1] === "Προφήτης Ηλίας - Αχαΐα") {
                    link.href = "ΠροφητηςΗλιας808.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Μεσσηνία") {
                    link.href = "ΠροφητηςΗλιας1006.html";
                } else if (rowData[1] === "Τουρτούλα - Αρκαδία") {
                    link.href = "Τουρτουλα.html";
                } else if (rowData[1] === "Στρογγυλοβούνι (Καστανοβούνι) - Κορινθία") {
                    link.href = "Στρογγυλοβουνι.html";
                } else if (rowData[1] === "Παραβουνάκι - Αργολίδα") {
                    link.href = "Παραβουνακι.html";
                } else if (rowData[1] === "Δραγουνέρα (Πιτσαδέικο Βουνό, Σωτήρα) - Κορινθία") {
                    link.href = "Δραγουνερα.html";
                } else if (rowData[1] === "Κουτρούφι - Αρκαδία") {
                    link.href = "Κουτρουφι.html";
                } else if (rowData[1] === "Πικερνιώτικο - Αρκαδία") {
                    link.href = "Πικερνιωτικο.html";
                } else if (rowData[1] === "Βουνά Χαλανδρίτσας - Αχαΐα") {
                    link.href = "ΒουναΧαλανδριτσας.html";
                } else if (rowData[1] === "Γαϊδουροβούνι - Λακωνία") {
                    link.href = "Γαιδουροβουνι.html";
                } else if (rowData[1] === "Βέσιζα - Κορινθία") {
                    link.href = "Βεσιζα.html";
                } else if (rowData[1] === "Καστανιά - Αρκαδία") {
                    link.href = "Καστανια.html";
                } else if (rowData[1] === "Τσεμπερού - Αρκαδία") {
                    link.href = "Τσεμπερου.html";
                } else if (rowData[1] === "Ρεζενίκος - Αρκαδία") {
                    link.href = "Ρεζενικος.html";
                } else if (rowData[1] === "Βρωμοβρυσέικα Βουνά - Μεσσηνία") {
                    link.href = "ΒρωμοβρυσεικαΒουνα.html";
                } else if (rowData[1] === "Άγιος Γεώργιος - Αρκαδία") {
                    link.href = "ΑγιοςΓεωργιοςΑρκαδιας.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B - Αχαΐα") {
                    link.href = "ΠροφητηςΗλιας1338.html";
                } else if (rowData[1] === "Βύθουλας (Βίτουλα) - Αρκαδία") {
                    link.href = "Βυθουλας.html";
                } else if (rowData[1] === "Ζέμπη - Αχαΐα") {
                    link.href = "Ζεμπη.html";
                } else if (rowData[1] === "Σκιαδοβούνι - Αχαΐα, Ηλεία") {
                    link.href = "Σκιαδοβουνι.html";
                } else if (rowData[1] === "Ψηλό Βουνό - Αρκαδία") {
                    link.href = "ΨηλοΒουνοΑρκαδιας.html";
                } else if (rowData[1] === "Άγιος Αθανάσιος (Βουνό Μαμαλούκας) - Αχαΐα") {
                    link.href = "ΒουνοΜαμαλουκας.html";
                } else if (rowData[1] === "Σκεπαστό (Όρος Κερύνεια) - Αχαΐα") {
                    link.href = "Σκεπαστο.html";
                } else if (rowData[1] === "Μπαρμπάς - Αχαΐα") {
                    link.href = "Μπαρμπας.html";
                } else if (rowData[1] === "Τρεις Γυναίκες - Αχαΐα") {
                    link.href = "ΤρειςΓυναικες.html";
                } else if (rowData[1] === "Ρούσκιο - Αχαΐα") {
                    link.href = "Ρουσκιο.html";
                } else if (rowData[1] === "Τάρταρης - Αχαΐα") {
                    link.href = "Ταρταρης.html";
                } else if (rowData[1] === "Λύκαιον Όρος - Αρκαδία, Μεσσηνία") {
                    link.href = "ΛυκαιονΟρος.html";
                } else if (rowData[1] === "Τετράζι (Νόμια Όρη) - Αρκαδία, Μεσσηνία") {
                    link.href = "Τετραζι.html";
                } else if (rowData[1] === "Αργυρόκαστρο - Αρκαδία") {
                    link.href = "Αργυροκαστρο.html";
                } else if (rowData[1] === "Γορτυνιακά Όρη - Αρκαδία") {
                    link.href = "ΓορτυνιακαΟρη.html";
                } else if (rowData[1] === "Αραχναίο - Αργολίδα") {
                    link.href = "Αραχναιο.html";
                } else if (rowData[1] === "Προφήτης Ηλίας (Βελανιδιά, Κυνόρτιον) - Αργολίδα") {
                    link.href = "Κυνορτιον.html";
                } else if (rowData[1] === "Πετραλώνι - Μεσσηνία") {
                    link.href = "Πετραλωνι.html";
                } else if (rowData[1] === "Ιθώμη - Μεσσηνία") {
                    link.href = "Ιθωμη.html";
                } else if (rowData[1] === "Φολόη - Ηλεία") {
                    link.href = "Φολοη.html";
                } else if (rowData[1] === "Χαρβάτι - Αργολίδα, Κορινθία") {
                    link.href = "Χαρβατι.html";
                } else if (rowData[1] === "Παρθένι - Αργολίδα, Αρκαδία") {
                    link.href = "Παρθενι.html";
                } else if (rowData[1] === "Τρίκορφο (Βουνά Δερβενακίων) - Αργολίδα") {
                    link.href = "Τρικορφο.html";
                } else if (rowData[1] === "Ντουρντουβάνα (Πεντέλεια) - Αχαΐα, Κορινθία") {
                    link.href = "Ντουρντουβανα.html";
                } else if (rowData[1] === "Μαρμάτι (Νεραϊδόρραχη) - Αχαΐα") {
                    link.href = "Μαρματι.html";
                } else if (rowData[1] === "Παναχαϊκό Όρος (Βοϊδιάς) - Αχαΐα") {
                    link.href = "Παναχαικο.html";
                } else if (rowData[1] === "Φαρμακάς (Αβυζές) - Αργολίδα") {
                    link.href = "Φαρμακας.html";
                } else if (rowData[1] === "Μεγαλοβούνι - Αργολίδα, Κορινθία") {
                    link.href = "Μεγαλοβουνι.html";
                } else if (rowData[1] === "Σανταμέρι (Σκόλλις, Πορτέικο, Πορτοβούνι) - Αχαΐα") {
                    link.href = "Σανταμερι.html";
                } else if (rowData[1] === "Σαγγιάς - Λακωνία") {
                    link.href = "Σαγγιας.html";
                } else if (rowData[1] === "Αιγάλεω (Όρη Κυπαρισσίας) - Μεσσηνία") {
                    link.href = "ΑιγαλεωΚυπαρισσιας.html";
                } else if (rowData[1] === "Χιονοβούνι - Λακωνία") {
                    link.href = "Χιονοβουνι.html";
                } else if (rowData[1] === "Τούρλα (Λιβαδάκι) - Αχαΐα, Κορινθία") {
                    link.href = "Τουρλα.html";
                } else if (rowData[1] === "Φουκάς - Κορινθία") {
                    link.href = "Φουκας.html";
                } else if (rowData[1] === "Ομπλός - Αχαΐα") {
                    link.href = "Ομπλος.html";
                } else if (rowData[1] === "Κουρκούλα (Στρογγύλο) - Λακωνία") {
                    link.href = "Κουρκουλα.html";
                } else if (rowData[1] === "Μακροβούνι (Μαυροβούνι) - Γρεβενά") {
                    link.href = "Μακροβουνι.html";
                } else if (rowData[1] === "Λυκόδημο Όρος - Μεσσηνία") {
                    link.href = "Λυκοδημο.html";
                } else if (rowData[1] === "Τούρλα - Αργολίδα, Αρκαδία") {
                    link.href = "ΤουρλαΑργολιδας.html";
                } else if (rowData[1] === "Αφροδίσιο - Αρκαδία, Αχαΐα") {
                    link.href = "Αφροδισιο.html";
                } else if (rowData[1] === "Μελιδόνι (Αη-Λιάς) - Αργολίδα") {
                    link.href = "Μελιδονι.html";
                } else if (rowData[1] === "Προφήτης Ηλίας (Αηλιάς, Μελίσσι) - Αχαΐα") {
                    link.href = "Αηλιας.html";
                } else if (rowData[1] === "Μπουχουμέρα (Μπουκουμέρα) - Αχαΐα") {
                    link.href = "Μπουχουμερα.html";
                } else if (rowData[1] === "Καλάθιο - Μεσσηνία") {
                    link.href = "Καλαθιο.html";
                } else if (rowData[1] === "Όρη Λαγκαδιών - Αρκαδία") {
                    link.href = "ΟρηΛαγκαδιων.html";
                } else if (rowData[1] === "Μίνθη (Άλβαινα, Άλβενα) - Ηλεία") {
                    link.href = "Μινθη.html";
                } else if (rowData[1] === "Σερβόβουνο - Αρκαδία") {
                    link.href = "Σερβοβουνο.html";
                } else if (rowData[1] === "Όνεια Όρη - Κορινθία") {
                    link.href = "ΟνειαΟρη.html";
                } else if (rowData[1] === "Μαδερό - Αχαΐα, Κορινθία") {
                    link.href = "Μαδερο.html";
                } else if (rowData[1] === "Χτενιάς (Κτενιάς, Κρύον Όρος) - Αργολίδα, Αρκαδία") {
                    link.href = "Χτενιας.html";
                } else if (rowData[1] === "Άγιος Ηλίας - Αρκαδία") {
                    link.href = "ΑγιοςΗλιαςΑρκαδιας.html";
                } else if (rowData[1] === "Ζάβιτσα (Τιμένιον Όρος) - Αργολίδα, Αρκαδία") {
                    link.href = "Ζαβιτσα.html";
                } else if (rowData[1] === "Νυφίτσα - Κορινθία") {
                    link.href = "Νυφιτσα.html";
                } else if (rowData[1] === "Ορθολίθι - Αργολίδα") {
                    link.href = "Ορθολιθι.html";
                } else if (rowData[1] === "Σταυραετός - Κορινθία") {
                    link.href = "Σταυραετος.html";
                } else if (rowData[1] === "Δίδυμο (Δίδυμα, Κονί) - Αργολίδα") {
                    link.href = "Διδυμο.html";
                } else if (rowData[1] === "Βελιάς (Βελά) - Αχαΐα") {
                    link.href = "Βελια.html";
                } else if (rowData[1] === "Τραπεζώνα - Αργολίδα, Κορινθία") {
                    link.href = "Τραπεζωνα.html";
                } else if (rowData[1] === "Μαγκλάβι - Μεσσηνία") {
                    link.href = "Μαγκλάβι.html";
                } else if (rowData[1] === "Γαβριάς - Κορινθία") {
                    link.href = "Γαβριας.html";
                } else if (rowData[1] === "Μαδάρα - Αρκαδία, Λακωνία") {
                    link.href = "Μαδαρα.html";
                } else if (rowData[1] === "Λάμπεια - Ηλεία") {
                    link.href = "Λαμπεια.html";
                } else if (rowData[1] === "Λύρκειο (Φραγκοκούκουρα) - Αργολίδα, Αρκαδία") {
                    link.href = "Λυρκειο.html";
                } else if (rowData[1] === "Αρτεμίσιο - Αργολίδα, Αρκαδία") {
                    link.href = "Αρτεμισιο.html";
                } else if (rowData[1] === "Μαύρο Όρος (Μαυρονόρος, Προφήτης Ηλίας) - Κορινθία") {
                    link.href = "ΜαυροΟρος.html";
                } else if (rowData[1] === "Κλωκός (Φτέρη, Παναγία) - Αχαΐα") {
                    link.href = "Κλωκος.html";
                } else if (rowData[1] === "Σκίαθις (Καταφύγιο, Ζάρα) - Αργολίδα, Αρκαδία") {
                    link.href = "Σκιαθις.html";
                } else if (rowData[1] === "Σαϊτάς (Όρυξις) - Κορινθία, Αρκαδία, Αχαΐα") {
                    link.href = "Σαιτας.html";
                } else if (rowData[1] === "Δυτικό Μαίναλο - Αρκαδία") {
                    link.href = "ΔυτικοΜαιναλο.html";
                } else if (rowData[1] === "Χελμός (Αροάνια) - Αχαΐα") {
                    link.href = "Χελμος.html";
                } else if (rowData[1] === "Ερύμανθος - Αχαΐα") {
                    link.href = "Ερυμανθος.html";
                } else if (rowData[1] === "Γερόντιο Όρος - Κορινθία") {
                    link.href = "Γεροντιο.html";
                } else if (rowData[1] === "Ζήρεια (Κυλλήνη) - Κορινθία") {
                    link.href = "Ζηρεια.html";
                } else if (rowData[1] === "Τραχύ (Καρούμπαλο) - Αργολίδα, Αρκαδία") {
                    link.href = "Τραχυ.html";
                } else if (rowData[1] === "Ολίγυρτος - Αργολίδα, Αρκαδία, Κορινθία") {
                    link.href = "Ολιγυρτος.html";
                } else if (rowData[1] === "Πάρνωνας (Μαλεβός) - Αρκαδία, Λακωνία") {
                    link.href = "Παρνωνας.html";
                } else if (rowData[1] === "Ταΰγετος - Λακωνία, Μεσσηνία") {
                    link.href = "Ταυγετος.html";
                } else if (rowData[1] === "Μαίναλο - Αρκαδία") {
                    link.href = "Μαιναλο.html";
                } else if (rowData[1] === "Μάρτσα - Ευρυτανία, Καρδίτσα") {
                    link.href = "Μαρτσα.html";
                } else if (rowData[1] === "Βουλγάρα (Άγραφα) - Ευρυτανία, Καρδίτσα") {
                    link.href = "ΒουλγαραΕυρυτανιας.html";
                } else if (rowData[1] === "Ντεληδήμι (Αυγό, Τσουρνάτα) (Άγραφα) - Καρδίτσα, Ευρυτανία") {
                    link.href = "Ντεληδημι.html";
                } else if (rowData[1] === "Μπορλέρο (Μπουρλέρος) (Άγραφα) - Ευρυτανία, Καρδίτσα") {
                    link.href = "Μπορλερο.html";
                } else if (rowData[1] === "Πύργος - Ευρυτανία, Καρδίτσα") {
                    link.href = "ΠυργοςΕυρυτανιας1804.html";
                } else if (rowData[1] === "Φλυτζάνι (Καλύβια, Νιάλα) - Ευρυτανία, Καρδίτσα") {
                    link.href = "Φλυτζανι.html";
                } else if (rowData[1] === "Βουλγάρα - Λάρισα, Πιερία") {
                    link.href = "ΒουλγαραΛαρισας.html";
                } else if (rowData[1] === "Αρχοντική (Αμάρμπεης) - Κοζάνη, Λάρισα") {
                    link.href = "Αρχοντικη.html";
                } else if (rowData[1] === "Χλωμό - Μαγνησία") {
                    link.href = "Χλωμο.html";
                } else if (rowData[1] === "Κατάχλωμο (Κατάχλωρο, Ταμάσιον Όρος) - Καρδίτσα") {
                    link.href = "Καταχλωμο.html";
                } else if (rowData[1] === "Τρόχαλος - Λάρισα") {
                    link.href = "Τροχαλος.html";
                } else if (rowData[1] === "Παπαλίβαδο - Λάρισα") {
                    link.href = "Παπαλιβαδο.html";
                } else if (rowData[1] === "Σουλιώτης - Κοζάνη, Λάρισα") {
                    link.href = "Σουλιωτης.html";
                } else if (rowData[1] === "Προφήτης Ηλίας (Παλιοαηλιάς, Άτυνο Μύλο) - Λάρισα") {
                    link.href = "ΠροφητηςΗλιαςΛαρισας.html";
                } else if (rowData[1] === "Κουκουργιάκος (Κοκκοριάκος) - Καρδίτσα") {
                    link.href = "Κουκουργιακος.html";
                } else if (rowData[1] === "Μαυροβούνι (Σκούτλη) - Λάρισα") {
                    link.href = "ΜαυροβουνιΛαρισας.html";
                } else if (rowData[1] === "Ψηλή Ράχη - Καρδίτσα") {
                    link.href = "ΨηληΡαχηΚαρδιτσας.html";
                } else if (rowData[1] === "Αμάραντος - Καρδίτσα") {
                    link.href = "Αμαραντος.html";
                } else if (rowData[1] === "Ίταμος (Τσιούκα) (Άγραφα) - Καρδίτσα") {
                    link.href = "ΙταμοςΤσιουκα.html";
                } else if (rowData[1] === "Ράχη Κούτρα - Λάρισα") {
                    link.href = "ΡαχηΚουτρα.html";
                } else if (rowData[1] === "Κονισκός (Παγκάκαινα) - Τρίκαλα") {
                    link.href = "Κονισκος.html";
                } else if (rowData[1] === "Αντιχάσια (Ράχη Τσέτσιλα, Μαμαλή) - Λάρισα, Τρίκαλα") {
                    link.href = "Αντιχασια.html";
                } else if (rowData[1] === "Καπροβούνι (Άγραφα) - Καρδίτσα") {
                    link.href = "Καπροβουνι.html";
                } else if (rowData[1] === "Αμμουτσέλος (Αμοντζέλος) - Τρίκαλα") {
                    link.href = "Αμμουτσελος.html";
                } else if (rowData[1] === "Ίταμος - Καρδίτσα, Τρίκαλα") {
                    link.href = "ΙταμοςΤρικαλων.html";
                } else if (rowData[1] === "Μυρμιτζάλα (Μυρμηγκιά) - Καρδίτσα") {
                    link.href = "Μυρμιτζαλα.html";
                } else if (rowData[1] === "Χάσια - Τρίκαλα") {
                    link.href = "Χασια.html";
                } else if (rowData[1] === "Κορυφή - Τρίκαλα") {
                    link.href = "ΚορυφηΤρικαλων.html";
                } else if (rowData[1] === "Λυκοζόρι (Τσέβροχο) - Τρίκαλα") {
                    link.href = "Λυκοζορι.html";
                } else if (rowData[1] === "Πυργούλι - Καρδίτσα") {
                    link.href = "Πυργουλι.html";
                } else if (rowData[1] === "Λεωνίδας - Τρίκαλα") {
                    link.href = "Λεωνιδας.html";
                } else if (rowData[1] === "Αγούρος - Τρίκαλα") {
                    link.href = "Αγουρος.html";
                } else if (rowData[1] === "Πυραμίδα (Μετερίζια) - Λάρισα, Τρίκαλα") {
                    link.href = "Πυραμιδα.html";
                } else if (rowData[1] === "Προφήτης Ηλίας (Άγιος Ηλίας) - Τρίκαλα") {
                    link.href = "ΠροφητηςΗλιαςΑγιοςΗλιαςΤρικαλων.html";
                } else if (rowData[1] === "Βουτσικάκι (Γκαβέλ) (Άγραφα) - Καρδίτσα") {
                    link.href = "Βουτσικακι.html";
                } else if (rowData[1] === "Χατζή - Τρίκαλα") {
                    link.href = "ΧατζηΤρικαλων.html";
                } else if (rowData[1] === "Δοκίμι Παχτουρίου (Τσιγκάρι, Τσουγκότι) - Τρίκαλα") {
                    link.href = "ΔοκιμιΠαχτουριου.html";
                } else if (rowData[1] === "Παπαδημήτρης (Άγραφα) - Καρδίτσα") {
                    link.href = "Παπαδημητρης.html";
                } else if (rowData[1] === "Καραβούλα (Άγραφα) - Καρδίτσα, Τρίκαλα") {
                    link.href = "Καραβουλα.html";
                } else if (rowData[1] === "Γαλάτσι (Ασήμι) (Άγραφα) - Καρδίτσα") {
                    link.href = "Γαλατσι.html";
                } else if (rowData[1] === "Μοράβα (Κυνηγός) - Τρίκαλα") {
                    link.href = "Μοραβα.html";
                } else if (rowData[1] === "Σουφλί (Μπούτσος) - Καρδίτσα") {
                    link.href = "Σουφλι.html";
                } else if (rowData[1] === "Κέδρος (Τρία Σύνορα) - Τρίκαλα") {
                    link.href = "ΚεδροςΤρικαλων.html";
                } else if (rowData[1] === "Κατούνα (Καυκιά, Τούρλα) - Καρδίτσα, Τρίκαλα") {
                    link.href = "Κατουνα.html";
                } else if (rowData[1] === "Προφήτης Ηλίας (Βερούσια) - Καρδίτσα") {
                    link.href = "Βερουσια.html";
                } else if (rowData[1] === "Μαυροπούλι - Τρίκαλα") {
                    link.href = "Μαυροπουλι.html";
                } else if (rowData[1] === "Χαλικόβουνο (Νεράιδα, Μπούτζα) - Τρίκαλα") {
                    link.href = "Χαλικοβουνο.html";
                } else if (rowData[1] === "Κίσσαβος (Όσσα) - Λάρισα") {
                    link.href = "Κισσαβος.html";
                } else if (rowData[1] === "Κόζιακας (Κερκέτιον Όρος) - Τρίκαλα") {
                    link.href = "Κοζιακας.html";
                } else if (rowData[1] === "Καράβα (Σχιζοκάραβο) (Άγραφα) - Καρδίτσα") {
                    link.href = "Καραβα.html";
                } else if (rowData[1] === "Αυγό - Τρίκαλα") {
                    link.href = "ΑυγοΤρικαλων.html";
                } else if (rowData[1] === "Τριγγία (Τριγία) - Τρίκαλα") {
                    link.href = "Τριγγια.html";
                } else if (rowData[1] === "Αρκούδα - Τρίκαλα") {
                    link.href = "Αρκουδα.html";
                } else if (rowData[1] === "Ναρθάκι (Κασιδιάρης) - Λάρισα, Φθιώτιδα") {
                    link.href = "Ναρθακι.html";
                } else if (rowData[1] === "Όθρυς - Μαγνησία, Φθιώτιδα") {
                    link.href = "Οθρυς.html";
                } else if (rowData[1] === "Πετρόκαμπος - Ιωάννινα, Τρίκαλα") {
                    link.href = "Πετροκαμπος.html";
                } else if (rowData[1] === "Κάτω Όλυμπος (Μεταμόρφωση) - Λάρισα, Πιερία") {
                    link.href = "ΚατωΟλυμπος.html";
                } else if (rowData[1] === "Πήλιο - Μαγνησία") {
                    link.href = "Πηλιο.html";
                } else if (rowData[1] === "Λουνάκι - Τρίκαλα") {
                    link.href = "Λουνακι.html";
                } else if (rowData[1] === "Ψηλή Ράχη - Καρδίτσα, Φθιώτιδα") {
                    link.href = "ΨηληΡαχηΦθιωτιδας.html";
                } else if (rowData[1] === "Μαυρόραχη (Καρά Ράχη) - Καρδίτσα, Φθιώτιδα") {
                    link.href = "Μαυροραχη.html";
                } else if (rowData[1] === "Τσεκούρι (Τσεκουράτ) - Πρέβεζα") {
                    link.href = "ΤσεκουριΤσεκουρατ.html";
                } else if (rowData[1] === "Τσούκα - Άρτα") {
                    link.href = "Τσουκα.html";
                } else if (rowData[1] === "Πενταλώνι - Ιωάννινα") {
                    link.href = "Πενταλωνι.html";
                } else if (rowData[1] === "Γορίλας (Γκορίλα, Κουρύλας) - Ιωάννινα") {
                    link.href = "Γοριλας.html";
                } else if (rowData[1] === "Μέγα Πλάι - Ιωάννινα") {
                    link.href = "ΜεγαΠλαι.html";
                } else if (rowData[1] === "Κιντζιρέλου - Ιωάννινα") {
                    link.href = "Κιντζιρελου.html";
                } else if (rowData[1] === "Ακρορράχη - Ιωάννινα") {
                    link.href = "Ακρορραχη.html";
                } else if (rowData[1] === "Όρη Πάργας (Κρανιά) - Πρέβεζα") {
                    link.href = "ΟρηΠαργας.html";
                } else if (rowData[1] === "Μέγα Ίσωμα - Φθιώτιδα") {
                    link.href = "ΜεγαΙσωμα.html";
                } else if (rowData[1] === "Μαυρότοπος - Φθιώτιδα") {
                    link.href = "Μαυροτοπος.html";
                } else if (rowData[1] === "Μεγάλη Τσούκα - Πρέβεζα") {
                    link.href = "ΜεγαληΤσουκαΠρεβεζας.html";
                } else if (rowData[1] === "Καμήλα - Θεσπρωτία") {
                    link.href = "Καμηλα.html";
                } else if (rowData[1] === "Γράμματα - Άρτα") {
                    link.href = "Γραμματα.html";
                } else if (rowData[1] === "Βροντερό (Τσουτσούλι) - Φλώρινα") {
                    link.href = "Βροντερο.html";
                } else if (rowData[1] === "Ντέβας - Φλώρινα") {
                    link.href = "Ντεβας.html";
                } else if (rowData[1] === "Κορησός (Αηδονάκος) - Καστοριά") {
                    link.href = "Κορησος.html";
                } else if (rowData[1] === "Αγία Τριάδα (Απόσκεπος, Σαρακήνα) - Καστοριά") {
                    link.href = "ΑγιαΤριαδαΚαστοριας.html";
                } else if (rowData[1] === "Τρίκορφο (Όρη Λιδωρικίου) - Φωκίδα") {
                    link.href = "ΤρικορφοΦωκιδας.html";
                } else if (rowData[1] === "Κνημίδα - Φθιώτιδα") {
                    link.href = "Κνημιδα.html";
                } else if (rowData[1] === "Αετόπετρα - Φωκίδα") {
                    link.href = "Αετοπετρα.html";
                } else if (rowData[1] === "Κουτσουρός - Φωκίδα") {
                    link.href = "Κουτσουρος.html";
                } else if (rowData[1] === "Κούτσουρας - Φωκίδα") {
                    link.href = "Κουτσουρας.html";
                } else if (rowData[1] === "Δανιήλ - Φωκίδα") {
                    link.href = "Δανιηλ.html";
                } else if (rowData[1] === "Τσιτομή - Φωκίδα") {
                    link.href = "Τσιτομη.html";
                } else if (rowData[1] === "Κρυάκουρας (Κριάκουρας) - Άρτα") {
                    link.href = "Κρυακουρας.html";
                } else if (rowData[1] === "Φούρκα (Σελιό, Μουρτζιά) - Άρτα") {
                    link.href = "Φουρκα.html";
                } else if (rowData[1] === "Αετοί - Άρτα") {
                    link.href = "Αετοι.html";
                } else if (rowData[1] === "Φρούσια Όρη (Κόκκινα Στεφάνια) - Άρτα") {
                    link.href = "ΦρουσιαΟρη.html";
                } else if (rowData[1] === "Όρη Φιλιατών - Θεσπρωτία") {
                    link.href = "ΟρηΦιλιατων.html";
                } else if (rowData[1] === "Χιονίστρα (Σπάτα) - Θεσπρωτία") {
                    link.href = "Χιονιστρα.html";
                } else if (rowData[1] === "Προφήτης Ηλίας (Μαλούνι, Μαλόνι) - Θεσπρωτία") {
                    link.href = "ΠροφητηςΗλιαςΜαλουνι.html";
                } else if (rowData[1] === "Όρη Βάλτου (Γάβροβο) - Αιτωλοακαρνανία, Άρτα") {
                    link.href = "ΟρηΒαλτου.html";
                } else if (rowData[1] === "Καλογκέριτ (Λόκβατ) - Φλώρινα") {
                    link.href = "Καλογκεριτ.html";
                } else if (rowData[1] === "Βροαστέργια (Βροατσέργια) - Φλώρινα") {
                    link.href = "Βροαστεργια.html";
                } else if (rowData[1] === "Δοβράς (Φλάμπουρο) - Κοζάνη") {
                    link.href = "Δοβρας.html";
                } else if (rowData[1] === "Κοκκινόλακκα (Κοκκινόλακκος) - Άρτα") {
                    link.href = "Κοκκινολακκα.html";
                } else if (rowData[1] === "Τούρλα (Βουνό Μουζακαίικων) - Πρέβεζα") {
                    link.href = "ΒουνοΜουζακαιικων.html";
                } else if (rowData[1] === "Τσουγκρί (Πύργος) - Άρτα") {
                    link.href = "Τσουγκρι.html";
                } else if (rowData[1] === "Βουνό Βελαντίλας (Κρανίλα, Καμάρα) - Θεσπρωτία") {
                    link.href = "ΒουνοΒελαντιλας.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Θεσπρωτία") {
                    link.href = "ΠροφητηςΗλιαςΘεσπρωτιας.html";
                } else if (rowData[1] === "Ψηλό Βουνό - Θεσπρωτία") {
                    link.href = "ΨηλοΒουνοΘεσπρωτιας.html";
                } else if (rowData[1] === "Σαρακίνα - Θεσπρωτία") {
                    link.href = "Σαρακινα.html";
                } else if (rowData[1] === "Σουγλιάνι (Στρατονικό Όρος) - Θεσσαλονίκη, Χαλκιδική") {
                    link.href = "Σουγλιανι.html";
                } else if (rowData[1] === "Ίταμος (Δραγουδέλης) - Χαλκιδική") {
                    link.href = "ΙταμοςΧαλκιδικης.html";
                } else if (rowData[1] === "Όρη Παραμυθιάς (Γορίλλας, Γκορίλας, Κορύλλας) - Θεσπρωτία") {
                    link.href = "ΟρηΠαραμυθιας.html";
                } else if (rowData[1] === "Βελούνα (Βουνό Χαραυγής) - Θεσπρωτία") {
                    link.href = "Βελουνα.html";
                } else if (rowData[1] === "Λάγγαρη - Θεσπρωτία") {
                    link.href = "Λαγγαρη.html";
                } else if (rowData[1] === "Δρίσκος - Ιωάννινα") {
                    link.href = "Δρισκος.html";
                } else if (rowData[1] === "Φαρμακοβούνι - Θεσπρωτία") {
                    link.href = "Φαρμακοβουνι.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Άρτα") {
                    link.href = "ΠροφητηςΗλιαςΑρτας.html";
                }  else if (rowData[1] === "Τρύπιο Λιθάρι - Άρτα") {
                    link.href = "ΤρυπιοΛιθαρι.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Ιωάννινα") {
                    link.href = "ΠροφητηςΗλιαςΙωαννινων.html";
                } else if (rowData[1] === "Χάρμα (Φλώρος, Τεροβίτικο) - Ιωάννινα") {
                    link.href = "Χαρμα.html";
                } else if (rowData[1] === "Βουνά Μανολιάσας - Ιωάννινα") {
                    link.href = "ΒουναΜανωλιασας.html";
                } else if (rowData[1] === "Αετοράχη - Ιωάννινα") {
                    link.href = "Αετοραχη.html";
                } else if (rowData[1] === "Μεγάλη Τσούκα - Ιωάννινα") {
                    link.href = "ΜεγαληΤσουκαΙωαννινων.html";
                } else if (rowData[1] === "Δεμάτι - Ιωάννινα") {
                    link.href = "Δεματι.html";
                } else if (rowData[1] === "Όρη Κουρέντων (Όρη Λυκοστάνης) - Ιωάννινα") {
                    link.href = "ΟρηΚουρεντων.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B - Ιωάννινα") {
                    link.href = "ΠροφητηςΗλιαςΙωαννινων1217.html";
                } else if (rowData[1] === "Ζαρκόραχη (Θεσπρωτικά Όρη) - Ιωάννινα, Πρέβεζα") {
                    link.href = "Ζαρκοραχη.html";
                } else if (rowData[1] === "Κουτσόκρανο - Ιωάννινα") {
                    link.href = "Κουτσοκρανο.html";
                } else if (rowData[1] === "Λάπατα - Ιωάννινα") {
                    link.href = "Λαπατα.html";
                } else if (rowData[1] === "Βουνά Μετσόβου (Καλιγωμένο Αλώνι) - Ιωάννινα") {
                    link.href = "ΒουναΜετσοβου.html";
                } else if (rowData[1] === "Βουνά Γρεβενιτίου (Κερά Άννα, Κεράνα) - Ιωάννινα") {
                    link.href = "ΒουναΓρεβενιτιου.html";
                } else if (rowData[1] === "Κασιδιάρης (Σούτιστα) - Ιωάννινα") {
                    link.href = "ΚασιδιαρηςΣουτιστα.html";
                } else if (rowData[1] === "Βαλανιδιά - Ιωάννινα") {
                    link.href = "Βαλανιδια.html";
                } else if (rowData[1] === "Όρη Σουλίου (Βριτζάχα ή Αλισσός) - Θεσπρωτία, Ιωάννινα") {
                    link.href = "ΟρηΣουλιου.html";
                } else if (rowData[1] === "Στούρος (Στούρου, Σμίντελα) - Ιωάννινα") {
                    link.href = "Στουρος.html";
                } else if (rowData[1] === "Ξεροβούνι (Ξηροβούνι) - Ιωάννινα, Πρέβεζα, Άρτα") {
                    link.href = "ΞεροβουνιΞηροβουνι.html";
                } else if (rowData[1] === "Μακρύκαμπος (Τσούκα, Μπόζοβο) - Ιωάννινα") {
                    link.href = "Μακρυκαμπος.html";
                } else if (rowData[1] === "Μουργκάνα (Όρη Τσαμαντά, Μαυροβούνι) - Θεσπρωτία, Ιωάννινα") {
                    link.href = "Μουργκανα.html";
                } else if (rowData[1] === "Δύσωρο (Κρούσια Όρη, Μαυροβούνι) - Κιλκίς, Σέρρες") {
                    link.href = "Δυσωρο.html";
                } else if (rowData[1] === "Άγιος Χριστόφορος - Κοζάνη") {
                    link.href = "ΑγιοςΧριστοφοροςΚοζανης.html";
                } else if (rowData[1] === "Φλατσάτα - Καστοριά") {
                    link.href = "Φλατσατα.html";
                } else if (rowData[1] === "Κερδύλιο (Κερδύλια Όρη) - Θεσσαλονίκη, Σέρρες") {
                    link.href = "Κερδυλιο.html";
                } else if (rowData[1] === "Στρατονικό (Μπιάβιτσα, Πιαβίτσα, Κοντάρι) - Χαλκιδική") {
                    link.href = "Στρατονικο.html";
                } else if (rowData[1] === "Κουτσόρραχος - Γρεβενά") {
                    link.href = "Κουτσορραχος.html";
                } else if (rowData[1] === "Περίβλεπτο - Δράμα") {
                    link.href = "Περιβλεπτο.html";
                } else if (rowData[1] === "Μοναστήρι - Κιλκίς") {
                    link.href = "Μοναστηρι.html";
                } else if (rowData[1] === "Μεγάλη Ράχη - Κοζάνη") {
                    link.href = "ΜεγαληΡαχη.html";
                } else if (rowData[1] === "Λευκάδιο - Κοζάνη") {
                    link.href = "Λευκαδιο.html";
                } else if (rowData[1] === "Βουνά Λευκογείων - Δράμα") {
                    link.href = "ΒουναΛευκογειων.html";
                } else if (rowData[1] === "Βουρσάνα - Κοζάνη") {
                    link.href = "Βουρσανα.html";
                } else if (rowData[1] === "Ριζό - Κοζάνη") {
                    link.href = "Ριζο.html";
                } else if (rowData[1] === "Τρίλοφο (Αλεότζ) - Καστοριά, Φλώρινα") {
                    link.href = "ΤριλοφοΑλεοτζ.html";
                } else if (rowData[1] === "Κίσσαβος - Γρεβενά") {
                    link.href = "ΚισσαβοςΓρεβενων.html";
                } else if (rowData[1] === "Σκρα (Σκρα ντι Λέγκεν, Γκιζέτ) - Κιλκίς, Πέλλα") {
                    link.href = "Σκραντιλεγκεν.html";
                } else if (rowData[1] === "Χάρακας - Δράμα") {
                    link.href = "Χαρακας.html";
                } else if (rowData[1] === "Τρέτιμος (Τρέτιμ Τεπέ) - Γρεβενά") {
                    link.href = "Τρετιμος.html";
                } else if (rowData[1] === "Βουνά Ξινού Νερού - Φλώρινα") {
                    link.href = "ΒουναΞινουΝερου.html";
                } else if (rowData[1] === "Μαύρο Πουλί (Χιντιρλίκ) - Κοζάνη, Φλώρινα") {
                    link.href = "ΜαυροΠουλιΚοζανης.html";
                } else if (rowData[1] === "Καστανιές (Κεστενές) - Καβάλα") {
                    link.href = "ΚαστανιεςΚεστενες.html";
                } else if (rowData[1] === "Γερμανικό - Κιλκίς") {
                    link.href = "Γερμανικο.html";
                } else if (rowData[1] === "Καμήλα (Καμηλοβούνι) - Χαλκιδική") {
                    link.href = "ΚαμηλαΚαμηλοβουνι.html";
                } else if (rowData[1] === "Κοζάκος - Ιωάννινα") {
                    link.href = "Κοζακος.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Χαλκιδική") {
                    link.href = "ΠροφητηςΗλιαςΧαλκιδικης.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Κοζάνη") {
                    link.href = "ΠροφητηςΗλιαςΚοζανης.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αργολίδα") {
                    link.href = "ΠροφητηςΗλιαςΑργολιδα856.html";
                } else if (rowData[1] === "Βουνά Γρεβενών - Γρεβενά") {
                    link.href = "ΒουναΓρεβενων.html";
                } else if (rowData[1] === "Μεγαλοβούνι (Νοτζά Νταγ) - Δράμα") {
                    link.href = "ΜεγαλοβουνιΝοτζαΝταγ.html";
                } else if (rowData[1] === "Βουνά Κοζάνης - Κοζάνη") {
                    link.href = "ΒουναΚοζανης.html";
                } else if (rowData[1] === "Αλωνοράχη - Κοζάνη") {
                    link.href = "Αλωνοραχη.html";
                } else if (rowData[1] === "Βερτίσκος - Θεσσαλονίκη") {
                    link.href = "Βερτισκος.html";
                } else if (rowData[1] === "Χολομώντας - Χαλκιδική") {
                    link.href = "Χολομωντας.html";
                } else if (rowData[1] === "Προφήτης Ηλίας (Τσιότινα) - Γρεβενά") {
                    link.href = "ΠροφητηςΗλιαςΤσιοτινα.html";
                } else if (rowData[1] === "Αράκυνθος - Αιτωλοακαρνανία") {
                    link.href = "Αρακυνθος.html";
                } else if (rowData[1] === "Άγιος Αρσένιος - Φωκίδα") {
                    link.href = "ΑγιοςΑρσενιος.html";
                } else if (rowData[1] === "Ξερακιώνα - Βοιωτία") {
                    link.href = "Ξερακιωνα.html";
                } else if (rowData[1] === "Λυκότρυπα - Γρεβενά") {
                    link.href = "Λυκοτρυπα.html";
                } else if (rowData[1] === "Αετοράχη - Γρεβενά, Κοζάνη") {
                    link.href = "ΑετοραχηΓρεβενων.html";
                } else if (rowData[1] === "Τσούκα Καραλή - Γρεβενά") {
                    link.href = "ΤσουκαΚαραλη.html";
                } else if (rowData[1] === "Σκοπός - Κοζάνη") {
                    link.href = "Σκοπος.html";
                } else if (rowData[1] === "Αετοβούνι - Κοζάνη") {
                    link.href = "Αετοβουνι.html";
                } else if (rowData[1] === "Όρη Λεκάνης - Δράμα, Καβάλα") {
                    link.href = "ΟρηΛεκανης.html";
                } else if (rowData[1] === "Κρούσσια Όρη (Μαυροβούνι, Καρά Νταγ) - Κιλκίς, Σέρρες") {
                    link.href = "ΚρουσσιαΟρηΜαυροβουνι.html";
                } else if (rowData[1] === "Αμπέλια - Βοιωτία") {
                    link.href = "Αμπελια.html";
                } else if (rowData[1] === "Αφρόσι - Εύβοια") {
                    link.href = "Αφροσι.html";
                } else if (rowData[1] === "Βλαχοβούνι - Εύβοια") {
                    link.href = "Βλαχοβουνι.html";
                } else if (rowData[1] === "Αμάλια - Βοιωτία") {
                    link.href = "Αμαλια.html";
                } else if (rowData[1] === "Σταυρός - Αιτωλοακαρνανία") {
                    link.href = "Σταυρος.html";
                } else if (rowData[1] === "Ζωιτός - Βοιωτία") {
                    link.href = "Ζωιτος.html";
                } else if (rowData[1] === "Μπιρμπιλιώ - Φθιώτιδα") {
                    link.href = "Μπιρμπιλιω.html";
                } else if (rowData[1] === "Άγιοι Θεόδωροι - Φθιώτιδα") {
                    link.href = "ΑγιοιΘεοδωροι.html";
                } else if (rowData[1] === "Βουδόχη - Εύβοια") {
                    link.href = "Βουδοχη.html";
                } else if (rowData[1] === "Αρκουδότρυπα - Εύβοια") {
                    link.href = "Αρκουδοτρυπα.html";
                } else if (rowData[1] === "Κορομπίλι - Βοιωτία") {
                    link.href = "Κορομπιλι.html";
                } else if (rowData[1] === "Σκοτεινή - Εύβοια") {
                    link.href = "Σκοτεινη.html";
                } else if (rowData[1] === "Ορτάρι - Εύβοια") {
                    link.href = "Ορταρι.html";
                } else if (rowData[1] === "Τελέθριο - Εύβοια") {
                    link.href = "Τελεθριο.html";
                } else if (rowData[1] === "Ευβοϊκός Όλυμπος - Εύβοια") {
                    link.href = "ΕυβοικοςΟλυμπος.html";
                } else if (rowData[1] === "Καλπακόβραχος - Εύβοια") {
                    link.href = "Καλπακοβραχος.html";
                } else if (rowData[1] === "Πυξαριάς - Εύβοια") {
                    link.href = "Πυξαριας.html";
                } else if (rowData[1] === "Όρη Λιδωρικίου - Φωκίδα") {
                    link.href = "ΟρηΛιδωρικιου.html";
                } else if (rowData[1] === "Ταναΐδα - Εύβοια") {
                    link.href = "Ταναιδα.html";
                } else if (rowData[1] === "Μεγάλα Όντρια (Όδρυα) - Καστοριά, Κοζάνη") {
                    link.href = "ΜεγαλαΟντρια.html";
                } else if (rowData[1] === "Αλεβίτσα - Καστοριά") {
                    link.href = "Αλεβιτσα.html";
                } else if (rowData[1] === "Τάλιαρος (Θανασούλας) - Γρεβενά, Καστοριά") {
                    link.href = "Ταλιαρος.html";
                } 
                else if (rowData[1] === "Λιάγκουνα (Κοπάνες) - Γρεβενά") {
                    link.href = "Λιαγκουνα.html";
                } 
                else if (rowData[1] === "Όρλιακας (Σπίλος) - Γρεβενά") {
                    link.href = "Ορλιακας.html";
                } else if (rowData[1] === "Άγκιστρο (Τσιγγέλι) - Σέρρες") {
                    link.href = "Αγκιστρο.html";
                } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B - Καστοριά") {
                    link.href = "ΠροφητηςΗλιαςΚαστοριας.html";
                } else if (rowData[1] === "Τρίκορφο - Ευρυτανία") {
                    link.href = "ΤρικορφοΕυρυτανιας.html";
                } else if (rowData[1] === "Λασποχώματα (Μπλος) - Ευρυτανία") {
                    link.href = "Λασποχωματα.html";
                } else if (rowData[1] === "Ανάληψη - Αιτωλοακαρνανία") {
                    link.href = "Αναληψη.html";
                } else if (rowData[1] === "Πάστρα - Αττική, Βοιωτία") {
                    link.href = "Παστρα.html";
                } else if (rowData[1] === "Μεσσάπιον Όρος - Βοιωτία") {
                    link.href = "ΜεσσαπιονΟρος.html";
                } else if (rowData[1] === "Πύργος - Εύβοια") {
                    link.href = "ΠυργοςΕυβοιας.html";
                } else if (rowData[1] === "Σκαφίδα - Καρδίτσα") {
                    link.href = "Σκαφιδα.html";
                } else if (rowData[1] === "Ελατιά (Καράντερε) - Δράμα") {
                    link.href = "ΕλατιαΚαραντερε.html";
                } else if (rowData[1] === "Καζάνι Αποσκέπου - Καστοριά") {
                    link.href = "ΚαζανιΑποσκεπου.html";
                } else if (rowData[1] === "Τζένα (Ζιώνα) - Πέλλα") {
                    link.href = "Τζενα.html";
                } else if (rowData[1] === "Καμβούνια Όρη (Βουνάσα) - Γρεβενά, Κοζάνη") {
                    link.href = "ΚαμβουνιαΟρη.html";
                } else if (rowData[1] === "Τσούκα Ρόσσα (Κοκκινόραχη) - Ιωάννινα") {
                    link.href = "ΤσουκαΡοσσα.html";
                } else if (rowData[1] === "Φλάμπουρο (Καραβούνι, Καρβούνι) - Ιωάννινα") {
                    link.href = "ΦλαμπουροΚαραβουνι.html";
                } else if (rowData[1] === "Ταμπούρι (Οχυρό) - Ιωάννινα") {
                    link.href = "ΤαμπουριΟχυρο.html";
                } else if (rowData[1] === "Μιτσικέλι - Ιωάννινα") {
                    link.href = "Μιτσικελι.html";
                } else if (rowData[1] === "Κουκουρούντζος - Ιωάννινα") {
                    link.href = "ΚουκουρουντζοςΙωαννινα.html";
                } else if (rowData[1] === "Τόμαρος (Ολύτσικας) - Ιωάννινα") {
                    link.href = "Τομαρος.html";
                } else if (rowData[1] === "Τραπεζίτσα - Ιωάννινα") {
                    link.href = "Τραπεζιτσα.html";
                } else if (rowData[1] === "Τρικλάριο (Βάρμπα, Σφήκα, Βάρμπα) - Φλώρινα") {
                    link.href = "Τρικλαριο.html";
                } else if (rowData[1] === "Βέλια (Μέλλια) - Κοζάνη") {
                    link.href = "ΒελιαΜελλια.html";
                } else if (rowData[1] === "Λαϊλιάς (Όρη Βροντούς, Ανάληψη, Προφήτης Ηλίας) - Σέρρες") {
                    link.href = "ΛαιλιαςΟρηΒροντους.html";
                } else if (rowData[1] === "Μπαλντενήσι - Ευρυτανία") {
                    link.href = "Μπαλντενησι.html";
                } else if (rowData[1] === "Καμενίκ - Ιωάννινα") {
                    link.href = "Καμενικ.html";
                }  else if (rowData[1] === "Ζυγός (Άσπρα Λιθάρια, Ταμπούρια Θανασάκη, Βούλγαρης) - Ιωάννινα, Τρίκαλα") {
                    link.href = "ΖυγοςΑσπραΛιθαρια.html";
                } else if (rowData[1] === "Φλέγγα (Μαυροβούνι) - Γρεβενά, Ιωάννινα") {
                    link.href = "ΦλεγγαΜαυροβουνι.html";
                } else if (rowData[1] === "Κακοπλεύρι (Μηλιά) - Γρεβενά, Ιωάννινα") {
                    link.href = "ΚακοπλευριΜηλια.html";
                } else if (rowData[1] === "Αυγό (Λύγκος) - Γρεβενά, Ιωάννινα") {
                    link.href = "ΑυγοΛυγκος.html";
                } else if (rowData[1] === "Δούσκο (Ντεμέρτσκα, Μερόπη) - Ιωάννινα") {
                    link.href = "ΔουσκοΝεμερτσκα.html";
                } else if (rowData[1] === "Βασιλίτσα - Γρεβενά, Ιωάννινα") {
                    link.href = "Βασιλιτσα.html";
                } else if (rowData[1] === "Τζουμέρκα (Αθαμανικά Όρη) - Άρτα") {
                    link.href = "ΤζουμερκαΑθαμανικαΟρη.html";
                } else if (rowData[1] === "Τύμφη - Ιωάννινα") {
                    link.href = "Τυμφη.html";
                } else if (rowData[1] === "Γράμμος - Ιωάννινα, Καστοριά") {
                    link.href = "Γραμμος.html";
                } else if (rowData[1] === "Σμόλικας - Ιωάννινα") {
                    link.href = "Σμολικας.html";
                } else if (rowData[1] === "Ακροκόρινθος - Κορινθία") {
                    link.href = "Ακροκορινθος.html";
                } else if (rowData[1] === "Τσούμα Ανιάδας - Ευρυτανία") {
                    link.href = "ΤσουμαΑνιαδας.html";
                } else if (rowData[1] === "Βόρας (Καϊμακτσαλάν) - Πέλλα") {
        link.href = "Βορας.html";
    } else if (rowData[1] === "Βέρμιο - Ημαθία, Κοζάνη") {
        link.href = "Βερμιο.html";
    } else if (rowData[1] === "Σινιάτσικο (Άσκιο) - Κοζάνη") {
        link.href = "Σινιατσικο.html";
    } else if (rowData[1] === "Όρβηλος (Αλή Μπουτούς) - Σέρρες, Δράμα") {
        link.href = "Ορβηλος.html";
    } else if (rowData[1] === "Μουρίκι - Κοζάνη") {
        link.href = "Μουρικι.html";
    } else if (rowData[1] === "Βίτσι (Βέρνο) - Καστοριά, Φλώρινα") {
        link.href = "ΒιτσιΒερνο.html";
    } else if (rowData[1] === "Άθως (Άγιον Όρος) - Χαλκιδική") {
        link.href = "Αθως.html";
    } else if (rowData[1] === "Μπέλες (Μπέλλες, Κερκίνη) - Σέρρες") {
        link.href = "Μπελες.html";
    } else if (rowData[1] === "Πυροστιά (Μπάλνες) - Γρεβενά") {
        link.href = "Πυροστια.html";
    } else if (rowData[1] === "Βαρνούντας (Περιστέρι, Βαρνούς) - Φλώρινα") {
        link.href = "Βαρνουντας.html";
    } else if (rowData[1] === "Πίνοβο - Πέλλα") {
        link.href = "Πινοβο.html";
    } else if (rowData[1] === "Πιέρια Όρη - Κοζάνη, Πιερία") {
        link.href = "ΠιεριαΟρη.html";
    } else if (rowData[1] === "Φρακτό (Νταλιμπόσκα) - Δράμα") {
        link.href = "Φρακτο.html";
    } else if (rowData[1] === "Παγγαίο - Καβάλα, Σέρρες") {
        link.href = "Παγγαιο.html";
    } else if (rowData[1] === "Μενοίκιο (Σμιγίνιτσα) - Δράμα, Σέρρες") {
        link.href = "Μενοικιο.html";
    } else if (rowData[1] === "Βόιο - Καστοριά, Κοζάνη") {
        link.href = "Βοιο.html";
    } else if (rowData[1] === "Πέρδικα (Σκούρτζα) - Γρεβενά") {
        link.href = "Περδικα.html";
    } else if (rowData[1] === "Μπούτσι (Μάλι Μάδι) - Καστοριά, Φλώρινα") {
        link.href = "Μπουτσι.html";
    } else if (rowData[1] === "Άγιος Παύλος (Σιβρί Τεπέ, Γρανίτης) - Δράμα") {
        link.href = "ΑγιοςΠαυλος.html";
    } else if (rowData[1] === "Κίρκουρη - Γρεβενά, Καστοριά") {
        link.href = "Κιρκουρη.html";
    } else if (rowData[1] === "Βούρινος (Μπούρινος, Ντρισινίκος) - Γρεβενά, Κοζάνη") {
        link.href = "Βουρινος.html";
    } else if (rowData[1] === "Άγιο Πνεύμα - Δράμα") {
        link.href = "ΑγιοΠνευμα.html";
    } else if (rowData[1] === "Κολώνα (Γκόλνα) - Ημαθία") {
        link.href = "Κολωνα.html";
    } else if (rowData[1] === "Χορτιάτης - Θεσσαλονίκη, Χαλκιδική") {
        link.href = "Χορτιατης.html";
    } else if (rowData[1] === "Πάικο (Φιδωτά) - Κιλκίς, Πέλλα") {
        link.href = "Παικο.html";
    } else if (rowData[1] === "Πύργος - Αιτωλοακαρνανία") {
        link.href = "ΠυργοςΑιτωλοακαρνανιας.html";
    } else if (rowData[1] === "Βίτσι - Αιτωλοακαρνανία") {
        link.href = "ΒιτσιΑιτωλοακαρνανιας.html";
    } else if (rowData[1] === "Παναιτωλικό - Αιτωλοακαρνανία, Ευρυτανία") {
        link.href = "Παναιτωλικο.html";
    } else if (rowData[1] === "Οξυά - Ευρυτανία, Φθιώτιδα, Φωκίδα") {
        link.href = "Οξυα.html";
    } else if (rowData[1] === "Κοκκινάρι (Άγιος Ηλίας) - Φωκίδα") {
        link.href = "Κοκκιναρι.html";
    } else if (rowData[1] === "Προσηλιακό (Προσηλιάκι) - Ευρυτανία") {
        link.href = "Προσηλιακο.html";
    } else if (rowData[1] === "Κόψι (Άγραφα) - Ευρυτανία") {
        link.href = "Κοψι.html";
    } else if (rowData[1] === "Χελιδόνα (Χελιδώνα) - Ευρυτανία") {
        link.href = "Χελιδονα.html";
    } else if (rowData[1] === "Όρη Ναυπακτίας (Κοκκινιάς) - Αιτωλοακαρνανία") {
        link.href = "ΟρηΝαυπακτιας.html";
    } else if (rowData[1] === "Τριανταφυλλιά - Αιτωλοακαρνανία, Ευρυτανία") {
        link.href = "Τριανταφυλλια.html";
    } else if (rowData[1] === "Πλατανάκι (Πλατάνι, Ζάρα) - Αιτωλοακαρνανία, Ευρυτανία") {
        link.href = "Πλατανακι.html";
    } else if (rowData[1] === "Τσεκούρα - Αιτωλοακαρνανία") {
        link.href = "Τσεκουρα.html";
    } else if (rowData[1] === "Τσακαλάκι - Αιτωλοακαρνανία") {
        link.href = "Τσακαλακι.html";
    } else if (rowData[1] === "Κοκκάλια - Ευρυτανία, Φθιώτιδα") {
        link.href = "Κοκκαλια.html";
    } else if (rowData[1] === "Άννινος - Αιτωλοακαρνανία, Ευρυτανία") {
        link.href = "Αννινος.html";
    } else if (rowData[1] === "Αρδίνης - Αιτωλοακαρνανία") {
        link.href = "Αρδινης.html";
    } else if (rowData[1] === "Κερασοβούνι - Αιτωλοακαρνανία, Φωκίδα") {
        link.href = "Κερασοβουνι.html";
    } else if (rowData[1] === "Αλογοβούνι - Ευρυτανία, Φθιώτιδα") {
        link.href = "Αλογοβουνι.html";
    } else if (rowData[1] === "Δίρφυς (Δίρφη) - Εύβοια") {
        link.href = "Διρφυς.html";
    } else if (rowData[1] === "Καυκί (Άγραφα) - Ευρυτανία") {
        link.href = "Καυκι.html";
    } else if (rowData[1] === "Ελικώνας - Βοιωτία") {
        link.href = "Ελικωνας.html";
    } else if (rowData[1] === "Ξεροβούνι (Βλαχοβούνι) - Αιτωλοακαρνανία, Φωκίδα") {
        link.href = "ΞεροβουνιΒλαχοβουνι.html";
    } else if (rowData[1] === "Πυργούλια (Φονιάς) - Αιτωλοακαρνανία, Ευρυτανία") {
        link.href = "Πυργουλια.html";
    } else if (rowData[1] === "Ακαρνανικά Όρη (Όρη Ξηρόμερου) - Αιτωλοακαρνανία") {
        link.href = "ΑκαρνανικαΟρη.html";
    } else if (rowData[1] === "Τσούμα – Ευρυτανία") {
        link.href = "Τσουμα.html";
    } else if (rowData[1] === "Γεράνεια Όρη - Αττική, Κορινθία") {
        link.href = "ΓερανειαΟρη.html";
    } else if (rowData[1] === "Μπούμιστος (Ταμπούρια) - Αιτωλοακαρνανία") {
        link.href = "Μπουμιστος.html";
    } else if (rowData[1] === "Ξεροβούνι - Αιτωλοακαρνανία, Φωκίδα") {
        link.href = "ΞεροβουνιΑιτωλοακαρνανιας1502.html";
    } else if (rowData[1] === "Καρφοπεταλιάς - Αιτωλοακαρνανία") {
        link.href = "Καρφοπεταλιας.html";
    } else if (rowData[1] === "Μεγάλη Λούτσα (Καψάλα) - Βοιωτία") {
        link.href = "ΜεγαληΛουτσαΒοιωτοιας.html";
    } else if (rowData[1] === "Κουμπί - Ευρυτανία") {
        link.href = "Κουμπι.html";
    } else if (rowData[1] === "Ζαγαράς (Μοτσάρα, Ζάστανι) - Βοιωτία") {
        link.href = "Ζαγαρας.html";
    } else if (rowData[1] === "Λυκομνήματα - Ευρυτανία, Φθιώτιδα") {
        link.href = "Λυκομνηματα.html";
    } else if (rowData[1] === "Τσούμα - Ευρυτανία") {
        link.href = "Τσουμα.html";
    } else if (rowData[1] === "Ξεροβούνι - Αιτωλοακαρνανία") {
        link.href = "ΞεροβουνιΑιτωλοακαρνανιας1571.html";
    } else if (rowData[1] === "Νεραϊδοβούνι - Ευρυτανία") {
        link.href = "ΝεραιδοβουνιΕυρυτανιας.html";
    } else if (rowData[1] === "Ριγάνι (Ορίγανον) - Αιτωλοακαρνανία") {
        link.href = "Ριγανι.html";
    } else if (rowData[1] === "Ανάληψη (Τσούκα) - Ευρυτανία") {
        link.href = "ΑναληψηΤσουκα.html";
    } else if (rowData[1] === "Γουλινάς - Φθιώτιδα") {
        link.href = "Γουλινας.html";
    } else if (rowData[1] === "Κολλιέδες (Ντρέβιζα) - Βοιωτία") {
        link.href = "Κολλιεδες.html";
    } else if (rowData[1] === "Αλωνάκι - Αιτωλοακαρνανία") {
        link.href = "Αλωνακι.html";
    } else if (rowData[1] === "Πάρνηθα (Καραβόλα) - Αττική") {
        link.href = "Παρνηθα.html";
    } else if (rowData[1] === "Κωνίσκος (Κόνισκος) - Ευρυτανία") {
        link.href = "Κωνισκος.html";
    } else if (rowData[1] === "Κιθαιρώνας - Αττική, Βοιωτία") {
        link.href = "Κιθαιρωνας.html";
    } else if (rowData[1] === "Κόμπολος (Κόμπιλο) - Ευρυτανία") {
        link.href = "Κομπολος.html";
    } else if (rowData[1] === "Καρδαράς - Αιτωλοακαρνανία") {
        link.href = "Καρδαρας.html";
    } else if (rowData[1] === "Καμαράκι - Ευρυτανία") {
        link.href = "Καμαρακι.html";
    } else if (rowData[1] === "Καντήλι - Εύβοια") {
        link.href = "Καντηλι.html";
    } else if (rowData[1] === "Κοτύλαια Όρη - Εύβοια") {
        link.href = "ΚοτυλαιαΟρη.html";
    } else if (rowData[1] === "Ξεροβούνι (Λαφύστιον Όρος) - Βοιωτία") {
        link.href = "ΞεροβουνιΒοιωτιας.html";
    } else if (rowData[1] === "Λημέρι - Αιτωλοακαρνανία") {
        link.href = "Λημερι.html";
    } else if (rowData[1] === "Υμηττός - Αττική") {
        link.href = "Υμηττος.html";
    } else if (rowData[1] === "Κλόκοβα - Αιτωλοακαρνανία") {
        link.href = "Κλοκοβα.html";
    } else if (rowData[1] === "Πέντε Κορυφές - Ευρυτανία") {
        link.href = "ΠεντεΚορυφες.html";
    } else if (rowData[1] === "Μακρυνόρος - Αιτωλοακαρνανία") {
        link.href = "ΜακρυνοροςΑιτωλοακαρνανιας.html";
    } else if (rowData[1] === "Ξεροβούνι - Φθιώτιδα") {
        link.href = "ΞεροβουνιΦθιωτιδας.html";
    } else if (rowData[1] === "Ξηρόν Ορος - Εύβοια") {
        link.href = "ΞηρονΟρος.html";
    } else if (rowData[1] === "Δίκορφο (Βελούτσα) - Αιτωλοακαρνανία") {
        link.href = "ΔικορφοΒελουτσα.html";
    } else if (rowData[1] === "Βαράσοβα (Σφυρί) - Αιτωλοακαρνανία") {
        link.href = "Βαρασοβα.html";
    } else if (rowData[1] === "Καλαβούνι (Κολοβούνι) - Αιτωλοακαρνανία") {
        link.href = "ΚαλαβουνιΚολοβουνι.html";
    } else if (rowData[1] === "Ξηροβούνι - Αιτωλοακαρνανία") {
        link.href = "ΞηροβουνιΑιτωλοακαρνανιας.html";
    } else if (rowData[1] === "Πεταλάς (Θύαμον όρος) - Αιτωλοακαρνανία") {
        link.href = "Πεταλας.html";
    } else if (rowData[1] === "Τραγόσταλος - Αιτωλοακαρνανία") {
        link.href = "Τραγοσταλος.html";
    } else if (rowData[1] === "Φροξυλιά - Αιτωλοακαρνανία") {
        link.href = "Φροξυλια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Γρανίτσας) - Βοιωτία") {
        link.href = "ΠροφητηςΗλιαςΓρανιτσας.html";
    } else if (rowData[1] === "Όρος Κίρφις (Επάνω Καρβούνι) - Βοιωτία") {
        link.href = "ΟροςΚιρφις.html";
    } else if (rowData[1] === "Νεραϊδολάκκωμα - Βοιωτία, Φωκίδα") {
        link.href = "Νεραιδολακκωμα.html";
    } else if (rowData[1] === "Γκιώνα (Ασέληνον Όρος) - Φωκίδα") {
        link.href = "Γκιωνα.html";
    } else if (rowData[1] === "Βαρδούσια (Κόραξ) - Βοιωτία, Φθιώτιδα") {
        link.href = "Βαρδουσια.html";
    } else if (rowData[1] === "Τυμφρηστός (Βελούχι) - Ευρυτανία, Φθιώτιδα") {
        link.href = "Τυμφρηστος.html";
    } else if (rowData[1] === "Οίτη (Καταβόθρα) - Φθιώτιδα, Φωκίδα") {
        link.href = "Οιτη.html";
    } else if (rowData[1] === "Καλλίδρομο (Σαρώματα) - Φθιώτιδα") {
        link.href = "Καλλιδρομο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Φθιώτιδα") {
        link.href = "ΠροφητηςΗλιαςΦθιωτιδας.html";
    } else if (rowData[1] === "Παρνασσός - Φωκίδα") {
        link.href = "Παρνασσος.html";
    } else if (rowData[1] === "Πατέρας - Αττική") {
        link.href = "Πατερας.html";
    } else if (rowData[1] === "Πεντέλη (Πεντελικό) - Αττική") {
        link.href = "Πεντελη.html";
    } else if (rowData[1] === "Πύργος - Ευρυτανία") {
        link.href = "ΠυργοςΕυρυτανιας1604.html";
    } else if (rowData[1] === "Τρία Σύνορα - Ευρυτανία") {
        link.href = "ΤριαΣυνορα.html";
    } else if (rowData[1] === "Φτέρη (Πτέρη) (Άγραφα) - Ευρυτανία") {
        link.href = "Φτερη.html";
    } else if (rowData[1] === "Καλιακούδα - Ευρυτανία") {
        link.href = "Καλιακουδα.html";
    } else if (rowData[1] === "Σβόνι (Μαράθια) (Άγραφα) - Ευρυτανία") {
        link.href = "Σβονι.html";
    } else if (rowData[1] === "Φουρκούλα (Κουκουρούντζος) (Άγραφα) - Ευρυτανία") {
        link.href = "Φουρκουλα.html";
    } else if (rowData[1] === "Όχη - Εύβοια") {
        link.href = "Οχη.html";
    } else if (rowData[1] === "Ξεροβούνι - Εύβοια") {
        link.href = "ΞεροβουνιΕυβοιας.html";
    } else if (rowData[1] === "Χλωμό - Φθιώτιδα") {
        link.href = "ΧλωμοΦθιωτιδας.html";
    } else if (rowData[1] === "Βλαχοβούνι - Φωκίδα") {
        link.href = "ΒλαχοβουνιΦωκιδας.html";
    } else if (rowData[1] === "Ποτίστρες (Κανάλα, Καλάνα) - Αιτωλοακαρνανία") {
        link.href = "Ποτιστρες.html";
    } else if (rowData[1] === "Λιάκουρα (Άγραφα) - Ευρυτανία") {
        link.href = "Λιακουρα.html";
    } else if (rowData[1] === "Μακρυνόρος - Αιτωλοακαρνανία (Ναυπακτία)") {
        link.href = "ΜακρυνοροςΑιτωλοακαρνανιας1561.html";
    } else if (rowData[1] === "Πέντε Πύργοι (Άγραφα) - Καρδίτσα") {
        link.href = "ΠεντεΠυργοι.html";
    } else if (rowData[1] === "Καταραχιάς - Ιωάννινα") {
        link.href = "Καταρραχιας.html";
    } else if (rowData[1] === "Μεγαλοβούνι - Αργολίδα") {
        link.href = "ΜεγαλοβουνιΑργολιδα.html";
    } else if (rowData[1] === "Καταραχιάς (Άγραφα) - Καρδίτσα") {
        link.href = "ΚαταραχιαςΑγραφα.html";
    } 
    
    else if (rowData[1] === "Δόβρος - Αιτωλοακαρνανία") {
        link.href = "Δοβρος.html";
    } else if (rowData[1] === "Κριθίνα - Λακωνία") {
        link.href = "Κριθινα.html";
    } else if (rowData[1] === "Τίμιος Σταυρός - Λασίθι") {
        link.href = "ΤιμιοςΣταυρος.html";
    } else if (rowData[1] === "Μαυροκορφή - Μαγνησία") {
        link.href = "Μαυροκορφη.html";
    } else if (rowData[1] === "Ψηλοκορφή - Κορινθία") {
        link.href = "Ψηλοκορφη.html";
    } else if (rowData[1] === "Κόχυλας - Σκύρος") {
        link.href = "Κοχυλας.html";
    } else if (rowData[1] === "Πυργίσκος - Λέσβος") {
        link.href = "Πυργισκος.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Ευρυτανία") {
        link.href = "ΠροφητηςΗλιαςΕυρυτανια786.html";
    } else if (rowData[1] === "Αδέρες - Αργολίδα") {
        link.href = "Αδερες.html";
    } else if (rowData[1] === "Σερβούνι - Εύβοια") {
        link.href = "Σερβουνι.html";
    } else if (rowData[1] === "Πτώο - Βοιωτία") {
        link.href = "Πτωο.html";
    } else if (rowData[1] === "Μπουρνιάς - Σάμος") {
        link.href = "Μπουρνιας.html";
    } else if (rowData[1] === "Λαπίθας - Ηλεία") {
        link.href = "Λαπιθας.html";
    } else if (rowData[1] === "Μεγάλη Κορυφή - Ηράκλειο") {
        link.href = "ΜεγαληΚορυφηΗρακλειοΚρητη.html";
    } else if (rowData[1] === "Ζαλόγγου Βουνά - Πρέβεζα") {
        link.href = "ΖαλογγουΒουνα.html";
    } else if (rowData[1] === "Παλιαγραπιδιά - Ευρυτανία") {
        link.href = "Παλιαγραπιδια.html";
    } else if (rowData[1] === "Κουκουρουφλιά - Τρίκαλα") {
        link.href = "Κουκουρουφλια.html";
    } else if (rowData[1] === "Χελμός - Αρκαδία, Λακωνία") {
        link.href = "ΧελμοςΑρκαδιαΛακωνια.html";
    } else if (rowData[1] === "Κοκκινίτσα - Θεσπρωτία") {
        link.href = "Κοκκινιτσα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Ευρυτανία") {
        link.href = "ΠροφητηςΗλιαςΕυρυτανια764.html";
    } else if (rowData[1] === "Πετράλωνα - Αιτωλοακαρνανία") {
        link.href = "Πετραλωνα.html";
    } else if (rowData[1] === "Πορί - Λακωνία") {
        link.href = "Πορι.html";
    } else if (rowData[1] === "Άγιοι Πάντες - Πάρος") {
        link.href = "ΑγιοιΠαντεςΠαρος.html";
    } else if (rowData[1] === "Γραμβούσα - Χανιά") {
        link.href = "Γραμβουσα.html";
    } else if (rowData[1] === "Στειρομάνδρα - Λασίθι") {
        link.href = "Στειρομανδρα.html";
    } else if (rowData[1] === "Βουνί (Οχθονιά) - Εύβοια") {
        link.href = "ΒουνιΕυβοια.html";
    } else if (rowData[1] === "Κρυοκεφάλα (Κρίμιανη) - Λασίθι") {
        link.href = "Κρυοκεφαλα.html";
    } else if (rowData[1] === "Κομποβούνι - Αχαΐα") {
        link.href = "Κομποβουνι.html";
    } else if (rowData[1] === "Παλιοπρέβεζα - Ευρυτανία") {
        link.href = "Παλιοπρεβεζα.html";
    } else if (rowData[1] === "Βραχιώνας - Ζάκυνθος") {
        link.href = "Βραχιωνας.html";
    } else if (rowData[1] === "Ντουσκάρας Βουνά - Ιωάννινα") {
        link.href = "Ντουσκαρας.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B - Αχαΐα") {
        link.href = "ΠροφητηςΗλιαςΑχαια.html";
    } else if (rowData[1] === "Μέγας Λάκκος - Λευκάδα") {
        link.href = "ΜεγαςΛακκοςΛευκαδα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Μήλος") {
        link.href = "ΠροφητηςΗλιαςΜηλος.html";
    } else if (rowData[1] === "Όνυχας - Χανιά") {
        link.href = "Ονυχας.html";
    } else if (rowData[1] === "Χρυσοβίτσας Βουνό - Αιτωλοακαρνανία") {
        link.href = "Χρυσοβιτσας.html";
    } else if (rowData[1] === "Φλιάμπουρι - Θεσπρωτία") {
        link.href = "Φλιαμπουρι.html";
    } else if (rowData[1] === "Σαγματάς - Βοιωτία") {
        link.href = "Σαγματας.html";
    } else if (rowData[1] === "Βουνί - Κάλαμος") {
        link.href = "ΒουνιΚαλαμος.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Λακωνία") {
        link.href = "ΠροφητηςΗλιαςΛακωνια744.html";
    } else if (rowData[1] === "Χελώνα (Χελώνη) - Αργολίδα") {
        link.href = "ΧελωναΧελωνη.html";
    } else if (rowData[1] === "Πυργάκι - Εύβοια") {
        link.href = "Πυργακι.html";
    } else if (rowData[1] === "Βενή Κορυφή (Βένι) - Ρέθυμνο") {
        link.href = "Βενη.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Αριά) - Άρτα") {
        link.href = "ΠροφητηςΗλιαςΑριαΑρτα.html";
    } else if (rowData[1] === "Ξεροσουβάλα - Εύβοια") {
        link.href = "Ξεροσουβαλα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Άγιος Ηλίας, Κουρί) - Θεσσαλονίκη") {
        link.href = "ΠροφητηςΗλιαςΘεσσαλονικηΚουρι.html";
    } else if (rowData[1] === "Γερακώνας (Γερακώνες) - Άνδρος") {
        link.href = "Γερακονας.html";
    } else if (rowData[1] === "Ξεροβούνι - Καρδίτσα") {
        link.href = "ΞεροβουνιΚαρδιτσα734.html";
    } else if (rowData[1] === "Βασιλικό - Ηράκλειο") {
        link.href = "ΒασιλικοΗρακλειο.html";
    } else if (rowData[1] === "Χασιού Κορυφή - Χανιά") {
        link.href = "ΧασιουΚορυφη.html";
    } else if (rowData[1] === "Κορυφή - Κορινθία") {
        link.href = "ΚορυφηΚορινθια731.html";
    } else if (rowData[1] === "Όρη Ζάρκου - Λάρισα, Τρίκαλα") {
        link.href = "ΖαρκουΟρηΘεσσαλια.html";
    } else if (rowData[1] === "Τσικνιάς - Τήνος") {
        link.href = "Τσικνιας.html";
    } else if (rowData[1] === "Μαυροβούνι (Χαλκοδόνιον, Καραντάου) - Λάρισα") {
        link.href = "ΜαυροβουνιΛαρισα725.html";
    } else if (rowData[1] === "Στρογγυλό - Κορινθία") {
        link.href = "Στρογγυλο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Άγιος Ηλίας) - Φθιώτιδα") {
        link.href = "ΠροφητηςΗλιαςΦθιωτιδα724.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Κορινθία") {
        link.href = "ΠροφητηςΗλιαςΚορινθια724.html";
    } else if (rowData[1] === "Τύμπανο (Κορακοβούνι) - Κορινθία") {
        link.href = "Τυμπανο.html";
    } else if (rowData[1] === "Περιστέρι (Γκαλόσι, Χήμι) - Εύβοια") {
        link.href = "ΠεριστεριΕυβοια.html";
    } else if (rowData[1] === "Μόβρη - Αχαΐα, Ηλεία") {
        link.href = "Μοβρη.html";
    } else if (rowData[1] === "Λούτσι - Λασίθι") {
        link.href = "ΛουτσιΛασιθι.html";
    } else if (rowData[1] === "Απιδιανά Βουνά - Λασίθι") {
        link.href = "Απιδιανα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Κάρπαθος") {
        link.href = "ΠροφητηςΗλιαςΚαρπαθος.html";
    } else if (rowData[1] === "Άγιοι Σαράντα - Άνδρος") {
        link.href = "ΑγιοιΣαρανταΑνδρος.html";
    } else if (rowData[1] === "Μαγκλαβάς - Μεσσηνία") {
        link.href = "Μαγκλαβας.html";
    } else if (rowData[1] === "Ετιανή Κεφάλα - Λασίθι") {
        link.href = "ΕτιανηΚεφαλα.html";
    } else if (rowData[1] === "Παλαιόκαστρο - Βοιωτία") {
        link.href = "Παλαιοκαστρο.html";
    } else if (rowData[1] === "Πύργος - Ίος") {
        link.href = "ΠυργοςΙος.html";
    } else if (rowData[1] === "Ορκίλλι - Κάρπαθος") {
        link.href = "Ορκιλλι.html";
    } else if (rowData[1] === "Πλακοκεφάλα - Λασίθι") {
        link.href = "Πλακοκεφαλα.html";
    } else if (rowData[1] === "Παλιοσαμαρίνα - Τρίκαλα") {
        link.href = "Παλιοσαμαρινα.html";
    } else if (rowData[1] === "Βαβύλα - Λακωνία") {
        link.href = "Βαβιλα.html";
    } else if (rowData[1] === "Κουλούρα - Κάρπαθος") {
        link.href = "ΚουλουραΚαρπαθος.html";
    } else if (rowData[1] === "Χρουσαίικο Βουνό - Αρκαδία") {
        link.href = "Χρουσαιικο.html";
    } else if (rowData[1] === "Βερσενίκος - Βοιωτία") {
        link.href = "Βερσενικος.html";
    } else if (rowData[1] === "Ψήλωμα (Βατόνια, Νέϊφτος) - Χαλκιδική") {
        link.href = "ΨηλωμαΧαλκιδικη.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Αργολίδα") {
        link.href = "ΠροφητηςΗλιαςΑργολιδα702.html";
    } else if (rowData[1] === "Κάδιστο - Λασίθι") {
        link.href = "Καδιστο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Κορινθία") {
        link.href = "ΠροφητηςΗλιαςΚορινθια701.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Άρτα") {
        link.href = "ΠροφητηςΗλιαςΑρτα701.html";
    } else if (rowData[1] === "Μεγαβούνι (Πυργιώσα) - Αργολίδα") {
        link.href = "ΜεγαβουνιΑργολιδα.html";
    } else if (rowData[1] === "Μικρό - Ηράκλειο") {
        link.href = "ΜικροΗρακλειο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Αμοργός") {
        link.href = "ΠροφητηςΗλιαςΑμοργος.html";
    } else if (rowData[1] === "Χορεύτρα - Λέσβος") {
        link.href = "Χορευτρα.html";
    } else if (rowData[1] === "Γούπατα - Αιτωλοακαρνανία") {
        link.href = "Γουπατα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ - Νίσυρος") {
        link.href = "ΠροφητηςΗλιαςΝισυρος.html";
    } else if (rowData[1] === "Πασχαλιές - Βοιωτία") {
        link.href = "Πασχαλιες.html";
    } else if (rowData[1] === "Μέγα Όρος - Αιτωλοακαρνανία") {
        link.href = "ΜεγαΟροςΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Φθιώτιδα") {
        link.href = "ΠροφητηςΗλιαςΦθιωτιδα.html";
    } else if (rowData[1] === "Πυραμίδα - Κιλκίς") {
        link.href = "ΠυραμιδαΚιλκις.html";
    } else if (rowData[1] === "Βράχος - Δράμα") {
        link.href = "ΒραχοςΔραμα.html";
    } else if (rowData[1] === "Σύμβολο - Καβάλα") {
        link.href = "Συμβολο.html";
    } else if (rowData[1] === "Τίτανος (Δοβρούτσι) - Καρδίτσα, Λάρισα, Τρίκαλα") {
        link.href = "Τιτανος.html";
    } else if (rowData[1] === "Βλοχός - Αιτωλοακαρνανία") {
        link.href = "Βλοχος.html";
    } else if (rowData[1] === "Λαχανά Βουνά (Λαχανάς) - Θεσσαλονίκη") {
        link.href = "Λαχανας.html";
    } else if (rowData[1] === "Χόμαλης - Κάρπαθος") {
        link.href = "Χομαλης.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Άνδρος") {
        link.href = "ΠροφητηςΗλιαςΑνδρος684.html";
    } else if (rowData[1] === "Πυραμίς - Αιτωλοακαρνανία") {
        link.href = "ΠυραμιςΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Βίγλα - Ηράκλειο") {
        link.href = "ΒιγλαΗρακλειο.html";
    } else if (rowData[1] === "Στύρων Βουνά - Εύβοια") {
        link.href = "ΣτυρωνΒουνα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ - Σίφνος") {
        link.href = "ΠροφητηςΗλιαςΣιφνος.html";
    } else if (rowData[1] === "Πεζούλισες - Αχαΐα") {
        link.href = "Πεζουλισες.html";
    } else if (rowData[1] === "Ίσμαρος - Ροδόπη") {
        link.href = "ΙσμαροςΡοδοπη.html";
    } else if (rowData[1] === "Δέλφι - Σκόπελος") {
        link.href = "ΔελφιΣκοπελος.html";
    } else if (rowData[1] === "Μακρυά Λενιά - Εύβοια") {
        link.href = "ΜακρυαΛενια.html";
    } else if (rowData[1] === "Λυκοχωρίου Βουνό - Αρκαδία") {
        link.href = "ΛυκοχωριουΒουνο.html";
    } else if (rowData[1] === "Κουλές - Ρέθυμνο") {
        link.href = "ΚουλεςΡεθυμνο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ - Κάλυμνος") {
        link.href = "ΠροφητηςΗλιαςΚαλυμνος.html";
    } else if (rowData[1] === "Πριονόσκαλα - Αιτωλοακαρνανία") {
        link.href = "Πριονοσκαλα.html";
    } else if (rowData[1] === "Σκάρος - Λευκάδα") {
        link.href = "ΣκαροςΛευκαδα.html";
    } else if (rowData[1] === "Αητοράχη - Λέσβος") {
        link.href = "ΑητοραχηΛεσβος.html";
    } else if (rowData[1] === "Αντίμηλος - Αντίμηλος") {
        link.href = "Αντιμηλος.html";
    } else if (rowData[1] === "Ξυλόκαστρο - Αχαΐα") {
        link.href = "ΞυλοκαστροΑχαια.html";
    } else if (rowData[1] === "Νερόβουλο - Ιθάκη") {
        link.href = "ΝεροβουλοΙθακη.html";
    } else if (rowData[1] === "Κάστρο (Σιδηρόκαστρο) - Μεσσηνία") {
        link.href = "ΚαστροΜεσσηνια.html";
    } else if (rowData[1] === "Βόλβης Όρη - Θεσσαλονίκη") {
        link.href = "ΒολβηςΟρη.html";
    } else if (rowData[1] === "Ψηλή Ράχη - Αιτωλοακαρνανία") {
        link.href = "ΨηληΡαχη.html";
    } else if (rowData[1] === "Βάραθρο - Θεσπρωτία") {
        link.href = "Βαραθρο.html";
    } else if (rowData[1] === "Γριά Βίγλα - Ηράκλειο") {
        link.href = "ΓριαΒιγλαΗρακλειο.html";
    } else if (rowData[1] === "Φορτέτζα - Ρέθυμνο") {
        link.href = "ΦορτετζαΡεθυμνο.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Φθιώτιδα") {
        link.href = "ΠροφητηςΗλιαςΦθιωτιδα655.html";
    } else if (rowData[1] === "Κορυφή - Έβρος") {
        link.href = "ΚορυφηΕβρος654.html";
    } else if (rowData[1] === "Προφήτης Ηλίας​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​ - Τήλος") {
        link.href = "ΠροφητηςΗλιαςΤηλος.html";
    } else if (rowData[1] === "Γέρο Γιώργης - Αιτωλοακαρνανία") {
        link.href = "ΓεροΓιωργης.html";
    } else if (rowData[1] === "Διονυσοβούνι - Αττική") {
        link.href = "Διονυσοβουνι.html";
    } else if (rowData[1] === "Μεσοβούνι - Τήνος") {
        link.href = "ΜεσοβουνιΤηνος.html";
    } else if (rowData[1] === "Πάνειο - Αττική") {
        link.href = "ΠανειοΑττικη.html";
    } else if (rowData[1] === "Λίμη (Λουκίσσα) - Κεφαλληνία") {
        link.href = "ΛιμηΚεφαλληνια.html";
    } else if (rowData[1] === "Μύτη - Εύβοια") {
        link.href = "ΜυτηΕυβοια.html";
    } else if (rowData[1] === "Βαρνάβας (Μαυροβούνι) - Αττική") {
        link.href = "ΒαρναβαςΑττικη.html";
    } else if (rowData[1] === "Μαυρηνόρα (Μαυρονόρος) - Αττική") {
        link.href = "ΜαυρηνοραΑττικη.html";
    } else if (rowData[1] === "Πόρτες - Μαγνησία") {
        link.href = "ΠορτεςΜαγνησια.html";
    } else if (rowData[1] === "Τισαίο - Μαγνησία") {
        link.href = "ΤισαιοΜαγνησια.html";
    } else if (rowData[1] === "Κατσίκα - Χαλκιδική") {
        link.href = "ΚατσικαΧαλκιδικη.html";
    } else if (rowData[1] === "Παλαρράχη - Αιτωλοακαρνανία") {
        link.href = "Παλαρραχη.html";
    } else if (rowData[1] === "Τραγοβούνι - Μαγνησία, Φθιώτιδα") {
        link.href = "Τραγοβουνοι.html";
    } else if (rowData[1] === "Ριζανών Βουνό - Κιλκίς, Σέρρες") {
        link.href = "ΡιζανωνΒουνο.html";
    } else if (rowData[1] === "Τρίκορφο - Εύβοια") {
        link.href = "ΤρικορφοΕυβοια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B\u200B - Βοιωτία, Φθιώτιδα") {
        link.href = "ΠροφητηςΗλιαςΒοιωτιαΦθιωτιδα637.html";
    } else if (rowData[1] === "Πέρδικας Βουνό - Θεσπρωτία") {
        link.href = "ΠερδικαςΒουνο.html";
    } else if (rowData[1] === "Κεφάλα - Ηράκλειο") {
        link.href = "ΚεφαλαΗρακλειο.html";
    } else if (rowData[1] === "Αχριανοβούνι - Αρκαδία") {
        link.href = "Αχριανοβουνι.html";
    } else if (rowData[1] === "Γυμνούλα - Θεσπρωτία") {
        link.href = "Γυμνουλα.html";
    } else if (rowData[1] === "Παχύ Βουνό - Σαρία") {
        link.href = "ΠαχυΒουνο.html";
    } else if (rowData[1] === "Παναγία (Πολύφεγγος) - Κορινθία") {
        link.href = "ΠαναγιαΚορινθια.html";
    } else if (rowData[1] === "Μετέωρα - Τρίκαλα") {
        link.href = "ΜετεωραΤρικαλα.html";
    } else if (rowData[1] === "Ορφανός - Τρίκαλα") {
        link.href = "ΟρφανοςΤρικαλα.html";
    } else if (rowData[1] === "Λόφος - Καβάλα") {
        link.href = "ΛοφοςΚαβαλα.html";
    } else if (rowData[1] === "Ύψωμα Αδελφών Ζαχαροπούλου (Κορύλοβο) - Δράμα") {
        link.href = "ΥψωμαΑδελφωνΖαχαροπουλου.html";
    } else if (rowData[1] === "Χούσακας - Ηράκλειο") {
        link.href = "ΧουσακαςΗρακλειο.html";
    } else if (rowData[1] === "Κεφάλι - Έβρος") {
        link.href = "ΚεφαλιΕβρος.html";
    } else if (rowData[1] === "Αγκαθερή - Λέσβος") {
        link.href = "ΑγκαθερηΛεσβος.html";
    } else if (rowData[1] === "Μεγαλοβούνι - Θεσπρωτία") {
        link.href = "ΜεγαλοβουνιΘεσπρωτια.html";
    } else if (rowData[1] === "Ανάβλοχας - Λασίθι") {
        link.href = "Αναβλοχας.html";
    } else if (rowData[1] === "Τσούκα - Κέρκυρα") {
        link.href = "ΤσουκαΚερκυρα.html";
    } else if (rowData[1] === "Κάψαλο - Έβρος") {
        link.href = "ΚαψαλοΕβρος.html";
    } else if (rowData[1] === "Θέρμου Βουνό - Αιτωλοακαρνανία") {
        link.href = "ΘερμουΒουνο.html";
    } else if (rowData[1] === "Βίγλα - Σύμη") {
        link.href = "ΒιγλαΣυμη.html";
    } else if (rowData[1] === "Μερέντα - Αττική") {
        link.href = "ΜερενταΑττικη.html";
    } else if (rowData[1] === "Νεραϊδίτης - Λάρισα, Μαγνησία") {
        link.href = "Νεραιδιτης.html";
    } else if (rowData[1] === "Παλιοβούνι - Έβρος") {
        link.href = "ΠαλιοβουνοΕβρος.html";
    } else if (rowData[1] === "Ψήλωμα - Βοιωτία") {
        link.href = "ΨηλωμαΒοιωτια.html";
    } else if (rowData[1] === "Ζούρβα (Βουνό Μαλάξας) - Χανιά") {
        link.href = "ΖουρβαΧανια.html";
    } else if (rowData[1] === "Κουκούλα - Κάλυμνος") {
        link.href = "ΚουκουλαΚαλυμνος.html";
    } else if (rowData[1] === "Αλογοβούνι - Αιτωλοακαρνανία") {
        link.href = "ΑλογοβουναΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Μεγάλο Βουνό - Ζάκυνθος") {
        link.href = "ΜεγαλοΒουνοΖακυνθος.html";
    } else if (rowData[1] === "Μεροβίγλι - Αιτωλοακαρνανία") {
        link.href = "ΜεροβιγλιΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Κεχροβούνι - Τήνος") {
        link.href = "ΚεχρουβουνιΤηνος.html";
    } else if (rowData[1] === "Ασφεντιλές - Χανιά") {
        link.href = "ΑσφεντιλεςΧανια.html";
    } else if (rowData[1] === "Λούτσα - Φθιώτιδα") {
        link.href = "ΛουτσαΦθιωτιδα.html";
    } else if (rowData[1] === "Τσίγγανη - Θεσπρωτία") {
        link.href = "ΤσιγγανηΘεσπρωτια.html";
    } else if (rowData[1] === "Παλιάμπελα - Θεσπρωτία") {
        link.href = "ΠαλιαμπελαΘεσπρωτια.html";
    } else if (rowData[1] === "Μεγάλος Πρίωνας - Κάσος") {
        link.href = "ΜεγαλοςΠριωναςΚασος.html";
    } else if (rowData[1] === "Μεροβίγλι - Χάλκη") {
        link.href = "ΜεροβιγλιΧαλκη.html";
    } else if (rowData[1] === "Ψηλή Παναγιά - Αιτωλοακαρνανία") {
        link.href = "ΨηληΠαναγιαΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Σουμάνι - Λακωνία") {
        link.href = "ΣουμανιΛακωνια.html";
    } else if (rowData[1] === "Πλαταριάς Βουνά - Θεσπρωτία") {
        link.href = "ΠλαταριαςΒουναΘεσπρωτια.html";
    } else if (rowData[1] === "Βουνοκορφή (Ψηλή Βίγλα) - Αργολίδα") {
        link.href = "ΒουνοκορφηΑργολιδα.html";
    } else if (rowData[1] === "Ανεμόμυλος - Ηράκλειο") {
        link.href = "ΑνεμομυλοςΗρακλειο.html";
    } else if (rowData[1] === "Μεγάλη Ράχη - Λακωνία") {
        link.href = "ΜεγαληΡαχηΛακωνια.html";
    } else if (rowData[1] === "Κορύφι - Κάρπαθος") {
        link.href = "ΚορυφιΚαρπαθος.html";
    } else if (rowData[1] === "Όψιον (Κορακόπετρα) - Λάρισα") {
        link.href = "ΟψιονΚορακοπετρα.html";
    } else if (rowData[1] === "Παλιόπυργος - Μαγνησία, Φθιώτιδα") {
        link.href = "ΠαλιοπυργοςΜαγνησιαΦθιωτιδα.html";
    } else if (rowData[1] === "Γαλατιανή - Κάλυμνος") {
        link.href = "ΓαλατιανηΚαλυμνος.html";
    } else if (rowData[1] === "Άντισσας Βουνά - Λέσβος") {
        link.href = "ΑντισσαςΒουναΛεσβος.html";
    } else if (rowData[1] === "Άγιος Ιωάννης Θεολόγος - Νίσυρος") {
        link.href = "ΑγιοςΙωαννηςΘεολογοςΝισυρος.html";
    } else if (rowData[1] === "Άκρος - Αργολίδα") {
        link.href = "ΑκροςΑργολιδα.html";
    } else if (rowData[1] === "Έρως - Ύδρα") {
        link.href = "ΕρωςΥδρα.html";
    } else if (rowData[1] === "Αστέρι - Ζάκυνθος") {
        link.href = "ΑστεριΖακυνθος.html";
    } else if (rowData[1] === "Τρούλλος - Σέριφος") {
        link.href = "ΤρουλλοςΣεριφος.html";
    } else if (rowData[1] === "Βίγλα - Ανάφη") {
        link.href = "ΒιγλαΑναφη.html";
    } else if (rowData[1] === "Πηγαδούλα - Αιτωλοακαρνανία") {
        link.href = "ΠηγαδουλαΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας (Πρινοβούνι) - Λέσβος") {
        link.href = "ΠροφητηςΗλιαςΠρινοβουνιΛεσβος.html";
    } else if (rowData[1] === "Φλαμουριά - Θεσπρωτία") {
        link.href = "ΦλαμουριαΘεσπρωτια.html";
    } else if (rowData[1] === "Μηλιανός - Κάλυμνος") {
        link.href = "ΜηλιανοςΚαλυμνος.html";
    } else if (rowData[1] === "Πυργιά - Ηράκλειο") {
        link.href = "ΠυργιαΗρακλειο.html";
    } else if (rowData[1] === "Παράριο - Βοιωτία, Φθιώτιδα") {
        link.href = "ΠαραριοΒοιωτια.html";
    } else if (rowData[1] === "Αϊλιάς - Λακωνία") {
        link.href = "ΑιλιαςΛακωνια.html";
    } else if (rowData[1] === "Δαμιανού Σωρός - Ηράκλειο") {
        link.href = "ΔαμιανουΣωροςΗρακλειο.html";
    } else if (rowData[1] === "Καλλιφώνιο - Αχαΐα") {
        link.href = "Καλλιφωνιο.html";
    } else if (rowData[1] === "Περδικούλα - Κορινθία") {
        link.href = "Περδικουλα.html";
    } else if (rowData[1] === "Σωρός - Ρέθυμνο") {
        link.href = "ΣωροςΡεθυμνο.html";
    } else if (rowData[1] === "Καθαρό (Τσίβι, Αλόιδα) - Λασίθι") {
        link.href = "Καθαρο.html";
    } else if (rowData[1] === "Πινακάκια - Ευρυτανία") {
        link.href = "Πινακακια.html";
    } else if (rowData[1] === "Κουβελαίικο Βουνό (Άγιος Ηλίας) - Μεσσηνία") {
        link.href = "ΚουβελαιικοΒουνο.html";
    } else if (rowData[1] === "Όρδυμνος - Λέσβος") {
        link.href = "Ορδυμνος.html";
    } else if (rowData[1] === "Αιγάλεω - Αττική") {
        link.href = "ΑιγαλεωοροςΑττικη.html";
    } else if (rowData[1] === "Ποικίλο - Αττική") {
        link.href = "ΠοικιλοΑττικη.html";
    }



    else if (rowData[1] === "Γαρδίκι - Φωκίδα") {
        link.href = "ΓαρδικιΦωκιδα.html";
    } else if (rowData[1] === "Βουνί - Γιούρα") {
        link.href = "ΒουνιΓιουρα.html";
    } else if (rowData[1] === "Άγιοι Δέκα - Κέρκυρα") {
        link.href = "ΑγιοιΔεκαΚερκυρα.html";
    } else if (rowData[1] === "Βουνοκορφή - Αττική") {
        link.href = "ΒουνοκορφηΑττικη.html";
    } else if (rowData[1] === "Παλαιόκαστρο - Κεφαλληνία") {
        link.href = "ΠαλαιοκαστροΚεφαλληνια.html";
    } else if (rowData[1] === "Κουτσούτης - Ρόδος") {
        link.href = "ΚουτσουτηςΡοδος.html";
    } else if (rowData[1] === "Πευκώνας - Κορινθία") {
        link.href = "ΠευκωναςΚορινθια.html";
    } else if (rowData[1] === "Καμήλα - Θεσσαλονίκη, Κιλκίς") {
        link.href = "ΚαμηλαΘεσσαλονικηΚιλκις.html";
    } else if (rowData[1] === "Παλούκι - Σκόπελος") {
        link.href = "ΠαλουκιΣκοπελος.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Σαντορίνη") {
        link.href = "ΠροφητηςΗλιαςΣαντορινη.html";
    } else if (rowData[1] === "Σφίγγιον - Βοιωτία") {
        link.href = "ΣφιγγιονΒοιωτια.html";
    } else if (rowData[1] === "Μπετσίκι - Μεσσηνία") {
        link.href = "ΜπετσικιΜεσσηνια.html";
    } else if (rowData[1] === "Γαλατσίδα - Βοιωτία") {
        link.href = "ΓαλατσιδαΒοιωτια.html";
    } else if (rowData[1] === "Τρίκορφο - Αιτωλοακαρνανία") {
        link.href = "ΤρικορφοΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Κέα") {
        link.href = "ΠροφητηςΗλιαςΚεα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Πρέβεζα") {
        link.href = "ΠροφητηςΗλιαςΠρεβεζα.html";
    } else if (rowData[1] === "Κορυφή - Θεσσαλονίκη") {
        link.href = "ΚορυφηΘεσσαλονικη.html";
    } else if (rowData[1] === "Κούκουμας - Εύβοια") {
        link.href = "ΚουκουμαςΕυβοια.html";
    } else if (rowData[1] === "Καμάρι - Αττική") {
        link.href = "ΚαμαριΑττικη.html";
    } else if (rowData[1] === "Αγριλίκι - Αττική") {
        link.href = "ΑγριλικιΑττικη.html";
    } else if (rowData[1] === "Κουκούμα - Θεσπρωτία") {
        link.href = "ΚουκουμαΘεσπρωτια.html";
    } else if (rowData[1] === "Μαυροβούνι - Λακωνία") {
        link.href = "ΜαυροβουνιΛακωνια.html";
    } else if (rowData[1] === "Πύργος - Αιτωλοακαρνανία") {
        link.href = "ΠυργοςΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Άγιος Γεώργιος - Μεσσηνία") {
        link.href = "ΑγιοςΓεωργιοςΜεσσηνια.html";
    } else if (rowData[1] === "Μικρή Τούμπα - Καβάλα") {
        link.href = "ΜικρηΤουμπαΚαβαλα.html";
    } else if (rowData[1] === "Τρίλοφο - Λέσβος") {
        link.href = "ΤριλοφοΛεσβος.html";
    } else if (rowData[1] === "Τρούλλος - Σίκινος") {
        link.href = "ΤρουλλοςΣικινος.html";
    } else if (rowData[1] === "Μαργαρίτα - Πρέβεζα") {
        link.href = "ΜαργαριταΠρεβεζα.html";
    } else if (rowData[1] === "Πυργάρι - Εύβοια") {
        link.href = "ΠυργαριΕυβοια.html";
    } else if (rowData[1] === "Μεγαβούνι - Μαγνησία") {
        link.href = "ΜεγαβουνιΜαγνησια.html";
    } else if (rowData[1] === "Παλιοβούνα - Βοιωτία, Φθιώτιδα") {
        link.href = "ΠαλιοβουναΒοιωτιαΦθιωτιδα.html";
    } else if (rowData[1] === "Αλογομάνδρα - Αργολίδα") {
        link.href = "ΑλογομανδραΑργολιδα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Κεφαλληνία") {
        link.href = "ΠροφητηςΗλιαςΚεφαλληνια.html";
    } else if (rowData[1] === "Στεφάνια - Βοιωτία, Φθιώτιδα") {
        link.href = "ΣτεφανιαΒοιωτιαΦθιωτιδα.html";
    } else if (rowData[1] === "Κουρτερή - Λέσβος") {
        link.href = "ΚουρτερηΛεσβος.html";
    } else if (rowData[1] === "Μόδι - Λασίθι") {
        link.href = "ΜοδιΛασιθι.html";
    } else if (rowData[1] === "Ερμίτης - Θεσπρωτία, Πρέβεζα") {
        link.href = "ΕρμιτηςΘεσπρωτιαΠρεβεζα.html";
    } else if (rowData[1] === "Κάστρο - Λευκάδα") {
        link.href = "ΚαστροΛευκαδα.html";
    } else if (rowData[1] === "Βελανιδιά - Μαγνησία") {
        link.href = "ΒελανιδιαΜαγνησια.html";
    } else if (rowData[1] === "Δύο Βουνά - Τήνος") {
        link.href = "ΔυοΒουναΤηνος.html";
    } else if (rowData[1] === "Πυραμίδα (Βελατούρι) - Αττική") {
        link.href = "ΠυραμιδαΒελατουριΑττικη.html";
    } else if (rowData[1] === "Πύρλιας - Αχαΐα") {
        link.href = "ΠυρλιαςΑχαια.html";
    } else if (rowData[1] === "Όρος - Αίγινα") {
        link.href = "ΟροςΑιγινα.html";
    } else if (rowData[1] === "Φυλλήϊον - Λάρισα, Τρίκαλα") {
        link.href = "ΦυλληιονΛαρισαΤρικαλα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Ψαρά") {
        link.href = "ΠροφητηςΗλιαςΨαρα.html";
    } else if (rowData[1] === "Φωτεινό - Ροδόπη") {
        link.href = "ΦωτεινοΡοδοπη.html";
    } else if (rowData[1] === "Σαργού Κεφάλα - Λασίθι") {
        link.href = "ΣαργουΚεφαλαΛασιθι.html";
    } else if (rowData[1] === "Δραπανοκεφάλα - Χανιά") {
        link.href = "ΔραπανοκεφαλαΧανια.html";
    } else if (rowData[1] === "Μαυροβούνι - Μαγνησία") {
        link.href = "ΜαυροβουνιΜαγνησια.html";
    } else if (rowData[1] === "Σκλόπα - Χανιά") {
        link.href = "ΣκλοπαΧανια.html";
    } else if (rowData[1] === "Κόρακας - Αμοργός") {
        link.href = "ΚορακαςΑμοργος.html";
    } else if (rowData[1] === "Μαυρόπολι - Εύβοια") {
        link.href = "ΜαυροπολιΕυβοια.html";
    } else if (rowData[1] === "Κεφάλα - Χανιά") {
        link.href = "ΚεφαλαΧανια.html";
    } else if (rowData[1] === "Μισοπέτρι - Εύβοια") {
        link.href = "ΜισοπετριΕυβοια.html";
    } else if (rowData[1] === "Λυγκοβίτσι - Αιτωλοακαρνανία") {
        link.href = "ΛυγκοβιτσιΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Γρίβας - Λάρισα") {
        link.href = "ΓριβαςΛαρισα.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Φωκίδα") {
        link.href = "ΠροφητηςΗλιαςΦωκιδα.html";
    } else if (rowData[1] === "Χαβαλάς - Λακωνία") {
        link.href = "ΧαβαλαςΛακωνια.html";
    } else if (rowData[1] === "Όρος - Λακωνία") {
        link.href = "ΟροςΛακωνια.html";
    } else if (rowData[1] === "Θύλακας - Λασίθι") {
        link.href = "ΘυλακαςΛασιθι.html";
    } else if (rowData[1] === "Κοκκινόβραχος - Βοιωτία") {
        link.href = "ΚοκκινοβραχοςΒοιωτια.html";
    } else if (rowData[1] === "Ντουχέρα - Ιθάκη") {
        link.href = "ΝτουχεραΙθακη.html";
    } else if (rowData[1] === "Βραχάκι - Εύβοια") {
        link.href = "ΒραχακιΕυβοια.html";
    } else if (rowData[1] === "Ζαρναούρα - Μαγνησία") {
        link.href = "ΖαρναουραΜαγνησια.html";
    } else if (rowData[1] === "Ομπόρι - Ύδρα") {
        link.href = "ΟμποριΥδρα.html";
    } else if (rowData[1] === "Λαχτιές - Κεφαλληνία") {
        link.href = "ΛαχτιεςΚεφαλληνια.html";
    } else if (rowData[1] === "Λυκοβούνι - Λακωνία") {
        link.href = "ΛυκοβουνιΛακωνια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Ρόδος") {
        link.href = "ΠροφητηςΗλιαςΡοδος.html";
    } else if (rowData[1] === "Τραγόσταλος - Λασίθι") {
        link.href = "ΤραγοσταλοςΛασιθι.html";
    } else if (rowData[1] === "Μεγάλο Βουνό - Εύβοια") {
        link.href = "ΜεγαλοΒουνοΕυβοια.html";
    } else if (rowData[1] === "Κούτσικο - Εύβοια") {
        link.href = "ΚουτσικοΕυβοια.html";
    } else if (rowData[1] === "Κόρακας - Φούρνοι") {
        link.href = "ΚορακαςΦουρνοι.html";
    } else if (rowData[1] === "Όρος - Σέριφος") {
        link.href = "ΟροςΣεριφος.html";
    } else if (rowData[1] === "Μαύρον Όρος - Θεσπρωτία") {
        link.href = "ΜαυρονΟροςΘεσπρωτια.html";
    } else if (rowData[1] === "Σαρακηνόκαστρο - Εύβοια") {
        link.href = "ΣαρακηνοκαστροΕυβοια.html";
    } else if (rowData[1] === "Κουρμούτσι - Φωκίδα") {
        link.href = "ΚουρμουτσιΦωκιδα.html";
    } else if (rowData[1] === "Στέρνα - Αιτωλοακαρνανία") {
        link.href = "ΣτερναΑιτωλοακαρνανια.html";
    } else if (rowData[1] === "Ξεροβούνι - Θεσπρωτία") {
        link.href = "ΞεροβουνιΘεσπρωτια.html";
    } else if (rowData[1] === "Ηρακλής - Κέρκυρα") {
        link.href = "ΗρακληςΚερκυρα.html";
    } else if (rowData[1] === "Μερμηγκάρης - Κύθηρα") {
        link.href = "ΜερμηγκαρηςΚυθηρα.html";
    } else if (rowData[1] === "Κλαδάρες - Λάρισα") {
        link.href = "ΚλαδαρεςΛαρισα.html";
    } else if (rowData[1] === "Μαύρη Ώρα - Κορινθία") {
        link.href = "ΜαυρηΩραΚορινθια.html";
    } else if (rowData[1] === "Κάψαλος (Περιόλας) - Κάσος") {
        link.href = "ΚαψαλοςΠεριολαςΚασος.html";
    } else if (rowData[1] === "Κάστρο - Αργολίδα") {
        link.href = "ΚαστροΑργολιδα.html";
    } else if (rowData[1] === "Κακό Τσουρούμι - Ρόδος") {
        link.href = "ΚακοΤσουρουμιΡοδος.html";
    } else if (rowData[1] === "Αυγό - Θεσπρωτία") {
        link.href = "ΑυγοΘεσπρωτια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Φωκίδα") {
        link.href = "ΠροφητηςΗλιαςΦωκιδα.html";
    } else if (rowData[1] === "Γέρακας - Ρόδος") {
        link.href = "ΓερακαςΡοδος.html";
    } else if (rowData[1] === "Ακόντιο - Βοιωτία") {
        link.href = "ΑκοντιοΒοιωτια.html";
    } else if (rowData[1] === "Προφήτης Ηλίας - Κάρπαθος") {
        link.href = "ΠροφητηςΗλιαςΚαρπαθος.html";
    } else if (rowData[1] === "Πεντεσκούφι - Κορινθία") {
        link.href = "ΠεντεσκουφιΚορινθια.html";
    }
    
    

    
     
                // Add more conditions for other mountains if needed
                link.classList.add('searchResultLink');
                
                const youtubeIcon = document.createElement('img');
                youtubeIcon.src = 'youtube_icon.png'; // Ensure you have a YouTube icon image
                youtubeIcon.alt = 'YouTube';
                youtubeIcon.classList.add('youtubeIcon');
                youtubeIcon.onclick = function() {
                    window.open(`https://www.youtube.com/results?search_query=${encodeURIComponent(rowData[1] + ' ανάβαση')}`, '_blank');
                };


// Append icons to the list item
li.appendChild(link);
li.appendChild(youtubeIcon);

ul.appendChild(li);

            }
        });
        
        if (ul.children.length > 0) {
            searchResults.appendChild(ul);
        } else {
            searchResults.textContent = "Δεν βρέθηκαν αποτελέσματα.";
        }
    } else {
        searchResults.textContent = "Δεν βρέθηκαν αποτελέσματα.";
    }
    
    backToHomePage.style.display = 'block';
}

function convertToGreekLatin(str) {
    // Define your conversion rules here
    const conversionMap = {
        'a': 'α',
        'b': 'β',
        'c': 'κ',
        'd': 'δ',
        'e': 'ε',
        'f': 'φ',
        'g': 'γ',
        'h': 'η',
        'i': 'ι',
        'j': 'τζ',
        'k': 'κ',
        'l': 'λ',
        'm': 'μ',
        'n': 'ν',
        'o': 'ο',
        'p': 'π',
        'q': 'κ',
        'r': 'ρ',
        's': 'σ',
        't': 'τ',
        'u': 'υ',
        'v': 'β',
        'w': 'ω',
        'x': 'ξ',
        'y': 'ψ',
        'z': 'ζ',        
        'th': 'θ',
        'y': 'υ',
        'x': 'χ',

        // Add more conversion rules as needed
    };

    // Replace Latin characters with their Greek counterparts
    return str.replace(/[a-z]/g, char => conversionMap[char] || char);
}

// Function to remove diacritics from a word
function removeDiacritics(word) {
    return word.normalize("NFD").replace(/[\u0300-\u036f]/g, "").replace(/ά/g, 'α').replace(/έ/g, 'ε').replace(/ή/g, 'η').replace(/ί/g, 'ι').replace(/ό/g, 'ο').replace(/ύ/g, 'υ').replace(/ώ/g, 'ω');
}


document.addEventListener("DOMContentLoaded", () => {
    // Select all links on the page
    const links = document.querySelectorAll("a");

    // Loop through each link
    links.forEach(link => {
        // Check if the link was previously clicked
        if (localStorage.getItem(link.href)) {
            link.classList.add("pressed");
        }

        // Add an event listener to each link
        link.addEventListener("click", () => {
            // Add the "pressed" class when the link is clicked
            link.classList.add("pressed");
            // Store in localStorage that this link has been clicked
            localStorage.setItem(link.href, "clicked");
        });
    });
});


window.addEventListener("DOMContentLoaded", () => {
    const metas = document.getElementsByTagName("meta");
    for (let meta of metas) {
      if (
        meta.getAttribute("name") &&
        meta.getAttribute("name").toLowerCase() !== "viewport"
      ) {
        const content = meta.getAttribute("content");
        if (
          content &&
          content.includes("width=device-width") &&
          content.includes("initial-scale")
        ) {
          meta.setAttribute("name", "viewport");
          break; // done
        }
      }
    }
  });
  