const canyonsData = [ 
    [1, "Πάντα Βρέχει", "Ευρυτανίας", "Καλιακούδα"],
    [2, "Άγγιστρος", "Έβρου (Σαμοθράκη)", "Σάος"],
    [3, "Αγία Κόρη", "Πιερίας", "Όλυμπος"],
    [4, "Αγιάλης (Αγάλης)", "Εύβοιας", "-"],
    [5, "Αγίου Νικολάου (Κουνουπίτσας, Πόζαρ)", "Πέλλας", "Καϊμακτσαλάν"],
    [6, "Άι Γιάννη", "Πέλλας", "Πίνοβο"],
    [7, "Αλέστιας", "Ευρυτανίας", "-"],
    [8, "Αμπελοχώρι", "Ιωαννίνων", "Τζουμέρκα"],
    [9, "Ανδρωνίου (Αντρωνίου)", "Ηλείας", "Ερύμανθος"],
    [10, "Αρακλού", "Κυκλάδων (Αμοργός)", "-"],
    [11, "Τσανάρκας (Γαλανά νερά)", "Πέλλας", "-"],
    [12, "Αραπλάκου (Αράπη)", "Πιερίας", "Όλυμπος"],
    [13, "Ασωπού", "Φθιώτιδος", "Οίτη"],
    [14, "Άχλα", "Κυκλάδων", "Άνδρος"],
    [15, "Αώου", "Ιωαννίνων", "Τύμφη"],
    [16, "Βαθύρεμα", "Ευρυτανίας", "-"],
    [17, "Βαπτιστή", "Ιωαννίνων", "Τζουμέρκα"],
    [18, "Βάτου (Κούσιαντα)", "Έβρου (Σαμοθράκη)", "Σάος"],
    [19, "Βελβεντού (Λάφιστας, Σκεπασμένο, Εννέα Πιερίδων Μουσών)", "Κοζάνης", "Πιέρια"],
    [20, "Βικάκη", "Ιωαννίνων", "Τύμφη"],
            [21, "Βίκου", "Ιωαννίνων", "Τύμφη"],
            [22, "Βόθωνα", "Ευρυτανίας", "-"],
            [23, "Βουραϊκού", "Αχαΐας", "Χελμός"],
            [24, "Αγγίτη", "Σερρών", "Παγγαίο, Μενοίκιο"],
            [25, "Βραδέτου", "Ιωαννίνων", "Τύμφη"],
            [26, "Βυρού", "Μεσσηνία", "Ταΰγετος"],
            [27, "Γαλανόρεμα", "Μαγνησίας", "Πήλιο"],
            [28, "Γερακάρη", "Φθιώτιδος", "Οίτη"],
            [29, "Γερακίνας", "Αττικής", "Γεράνεια όρη"],
            [30, "Γκούρας\u200B\u200B", "Ιωαννίνων", "Περιστέρι (Λάκμος)"],
            [31, "Γκούρας (Τουθόα)", "Αρκαδίας", "Όρη Λαγκαδίων"],
            [32, "Γκούρας\u200B", "Αττικής", "Πάρνηθα"],  
            [33, "Γοργοπόταμου", "Φθιώτιδος", "Οίτη"],
            [34, "Γούμερου", "Ηλεία", "Φολόη"],
            [35, "Γουρνόρεμα", "Ευρυτανία", "-"],
            [36, "Γριά Βάθρα", "Έβρου (Σαμοθράκη)", "Σάος"],
            [37, "Γυάλι", "Έβρου (Σαμοθράκη)", "Σάος"],
            [38, "Δέλφινο (Δελφινάκος)", "Φθιώτιδος", "Οίτη"],
            [39, "Δέος", "Ιωαννίνων", "Περιστέρι (Λάκμος)"],
            [40, "Δημόσαρη", "Εύβοιας", "Όχη"],
            [41, "Παπαπήδημα (Αράχθου)", "Ιωαννίνων", "Τζουμέρκα"],
            [42, "Ενιπέα", "Πιερίας", "Όλυμπος"],
            [43, "Αλιμάχης", "Εύβοιας", "Καντήλι"],
            [44, "Ζαρμπάνιτσας", "Λακωνίας", "Πάρνωνας"],
            [45, "Διποτάματα", "Κυκλάδων (Άνδρος)", "-"],
            [46, "Ίναχου", "Αργολίδας", "Αρτεμίσιο"],
            [47, "Καζάνια", "Ιωαννίνων", "Περιστέρι (Λάκμος)"],
            [48, "Κακαβόρεμα", "Ευρυτανία", "-"],
            [49, "Χρούσια (Σταυραετού, Μπόζια)", "Ιωαννίνων", "Τζουμέρκα"],
            [50, "Κακόρεμα\u200B", "Μαγνησίας", "Όθρυς"],
            [51, "Κακόσκαλα", "Λάρισας", "Κίσσαβος"],
            [52, "Καλλιθέας (Αγίου Λουκά)", "Κορινθίας", "Μαύρο όρος"],
            [53, "Καλυψώ", "Λάρισας", "Κίσσαβος"],
            [54, "Καμαριώτη", "Φθιώτιδος", "Οίτη"],
            [55, "Φόνισσας", "Κορινθίας", "-"],
            [56, "Καραγιαννάκη", "Έβρου (Σαμοθράκη)", "Σάος"],
            [57, "Χαράδρου", "Αχαΐας", "Παναχαϊκό Όρος"],
            [58, "Στροπώνων", "Εύβοιας", "-"],
            [59, "Άρβης", "Ηρακλείου", "Άρβειον Όρος"],
            [60, "Καταφύκι (Μυγγυριστέα)", "Αργολίδας", "-"],
            [61, "Κεραμιδίου", "Φωκίδος", "Παρνασσός"],
            [62, "Κεφαλαρίου", "Κορινθίας", "Ζήρεια"],
            [63, "Κήπων", "Έβρου (Σαμοθράκη)", "Σάος"],
            [64, "Κλειδωνιάς (Βοϊδομάτη)", "Ιωαννίνων", "Τύμφη"],
            [65, "Κόκκινα Πατερά", "Μεσσηνία", "-"],
            [66, "Κόκκινο Ποτάμι", "Ιωαννίνων", "Κακαρδίτσα"],
            [67, "Κοροβέσου", "Ιωαννίνων", "Τζουμέρκα"],
            [68, "Κράστας", "Ημαθίας", "Βέρμιο"],
            [69, "Κριθάρια", "Ιωαννίνων", "Κακαρδίτσα"],
            [70, "Κωσταλέξη", "Φθιώτιδος", "Οίτη"],
            [71, "Λαγκαδιώτισσας (Λαγκαδά)", "Λακωνίας", "Ταΰγετος"],
            [72, "Τζένας", "Πέλλας", "Τζένα"],
            [73, "Λεπίδας", "Λακωνίας", "Πάρνωνας"],
            [74, "Λουκά", "Λακωνίας", "Ταΰγετος"],
            [75, "Λούλουγκα", "Λακωνίας", "Πάρνωνας"],
            [76, "Λούσιου", "Αρκαδίας", "Μαίναλο"],
            [77, "Μαζιάς", "Λακωνίας", "Πάρνωνας"],
            [78, "Μακρυχώραφα", "Ιωαννίνων", "Κακαρδίτσα"],
            [79, "Μαρουσώς", "Λακωνίας", "Ταΰγετος"],
            [80, "Ματσουκίου", "Ιωαννίνων", "Τζουμέρκα"],
            [81, "Ξηριά Κρύας (Έρκυνας)", "Βοιωτίας", "-"],
            [82, "Μαύρη Σπηλιά", "Ευρυτανίας", "-"],
            [83, "Μαυρομάτη", "Μαγνησίας", "Όθρυς"],
            [84, "Μέγα Ρέμα Μουζακίου", "Καρδίτσας", "Άγραφα"],
            [85, "Μέγα Ρέμα", "Φθιώτιδος", "Κνημίδα"],
            [86, "Μέγας Λάκκος", "Ιωαννίνων", "Τύμφη"],
            [87, "Μεζαριάς", "Ιωαννίνων", "Τύμφη"],
            [88, "Μεσορόπης", "Καβάλας", "Παγγαίο"],
[89, "Μπασδέκη (Κλίφκης)", "Ιωαννίνων", "Τζουμέρκα"],
[90, "Μυλοπόταμου\u200B", "Μαγνησίας", "Πήλιο"],
[91, "Μύλων\u200B", "Αττικής", "Γεράνεια όρη"],
[92, "Νέδας", "Ηλείας", "Νόμια όρη"],
[93, "Τράφουλα (Τράχουλα)", "Ηρακλείου", "Αστερούσια Όρη"],
[94, "Νεφέλης", "Ιωαννίνων", "Τύμφη"],
[95, "Ρόζας", "Ηρακλείου", "-"],
[96, "Νταμούχαρη", "Μαγνησίας", "Πήλιο"],
[97, "Ντούνου", "Φθιώτιδος", "Οίτη"],
[98, "Ξετρυπητή", "Δωδεκανήσου", "-"],
[99, "Ξηροπόταμου", "Έβρου (Σαμοθράκη)", "Σάος"],
[100, "Ορλιά", "Πιερίας", "Όλυμπος"],
[101, "Οινόης (Μαραθώνα)", "Αττικής", "-"],
[102, "Παλαιάς Βροντούς", "Πιερίας", "Όλυμπος"],
[103, "Παπά-Ρέμα", "Πιερίας", "Όλυμπος"],
[104, "Περιστεριώνα\u200B", "Αχαΐας", "Χελμός"],
[105, "Πλατανάκι (Δεκατιάς)", "Ευρυτανίας", "-"],
[106, "Θηριόπετρας", "Πέλλας", "Πίνοβο"],
[107, "Πορτίτσας", "Γρεβενών", "Όρλιακας"],
[108, "Προπύλη (Άνω Καρλίμπου)", "Ιωαννίνων", "Κακαρδίτσα"],
[109, "Πύλη Παραδείσου (Καρλίμπου)", "Ιωαννίνων", "Τζουμέρκα"],
[110, "Πύργων (Πετρούσας)", "Δράμας", "Φαλακρό"],
[111, "Ρακοπόταμου", "Λάρισας", "Μαυροβούνι"],
[112, "Ράμνο Μπορ", "Πέλλας", "Βόρας"],
[113, "Ρίντομου (Κοσκάρακας)", "Μεσσηνίας", "Ταΰγετος"],
[114, "Ροδοκάλου", "Φθιώτιδος", "Οίτη"],
[115, "Τόρνου (Χαλικόρεμα, Μικρό Πάντα Βρέχει)", "Ευρυτανίας", "Τριανταφυλλιά"],
[116, "Σαρίας (Έντη)", "Δωδεκανήσου (Σαρία)", "-"],
[117, "Σελίου", "Ημαθίας", "Βέρμιο"],
[118, "Σερβίων (Χούνη)", "Κοζάνης", "Πιέρια"],
[119, "Βενεράτου", "Ηρακλείου", "-"],
[120, "Σκάλας\u200B", "Χαλκιδικής", "Θεσσαλονίκης"],
[121, "Αγίου Δημητρίου", "Εύβοιας", "Όχη"],
[122, "Φτερόρεμμα", "Ευρυτανία", "Άγραφα"],
[123, "Στριφτό", "Φθιώτιδος", "Κνημίδα"],
[124, "Τιμίου Προδρόμου", "Σερρών", "Λαιλιάς/Μενοίκιο"],
[125, "Τοίχου", "Ιωαννίνων", "Τύμφη"],
[126, "Κερεντάν", "Καρδίτσας", "Άγραφα"],
[127, "Σελινούντα (Τρανό Λαγκάδι)", "Αχαΐας", "Κλωκός"],
[128, "Απιδιανό (Γούδουρα, Αγίου Αντωνίου)", "Λασιθίου", "-"],
[129, "Τσιβδογιάννη", "Έβρου (Σαμοθράκη)", "Σάος"],
[130, "Τσιγγενόρεμα", "Μαγνησίας", "Όθρυς"],
[131, "Φακίστρας", "Μαγνησίας", "Πήλιο"],
[132, "Φλασκιά", "Δωδεκανήσου (Κάρπαθος)", "-"],
[133, "Φονέα (Νούπαντης)", "Μεσσηνίας", "Ταΰγετος"],
[134, "Φονιά", "Έβρου (Σαμοθράκη)", "Σάος"],
[135, "Φλαμπουρίτσας", "Κορινθίας", "Ζήρεια"],
[136, "Φορτόσι", "Ιωαννίνων", "Τζουμέρκα"],
[137, "Χάβος (Προσηλίου)", "Πιερίας", "Πιέρια"],
[138, "Χάβος", "Εύβοιας", "Δίρφη"],
[139, "Τσάκωνα", "Αττικής (Κύθηρα)", "-"],
[140, "Κενταύρων", "Ηλείας", "Φολόη"],
[141, "Μοκιστιάνου", "Αιτωλοακαρνανίας", "-"],
[142, "Ανακώλου", "Λακωνία", "Ταΰγετος"],
[143, "Βρυσιωτικού (Μύλων, Κάστορα, Κάρδαρη)", "Λακωνίας", "Ταΰγετος"],
[144, "Σαρακίνας (Σαρακηνό, Σαραντάπηχου)", "Λασιθίου", "-"],
[145, "Πρασσανό", "Ρεθύμνου", "-"],
[146, "Κώστιανο (Αχελώου)", "Καρδίτσας", "Άγραφα"],
[147, "Περβολακίων (Καψά)", "Λασιθίου", "-"],
[148, "Βοριζιανό", "Ηρακλείου", "Ψηλορείτης"],
[149, "Σαμαριάς", "Χανίων", "Οροπέδιο Ομαλού"],
[150, "Αχέροντα", "Πρέβεζας", "-"],
[151, "Κουρταλιώτικο (Κουρταλιώτη)", "Ρεθύμνου", "Όρος Κουρούπα"],
[152, "Ξερόκαμπου (Ξηρόκαμπου, Λαμνώνι)", "Λασιθίου", "Σητειακά Όρη"],
[153, "Στενό Αθαμανίας (Μουτσιαρίτη)", "Τρικάλων", "Κακαρδίτσα"],
[154, "Μπουλοβίναινας (Νηλέα, Αράπη)", "Εύβοιας", "Ξηρό"],
[155, "Σπίνας (Κανδάνου, Καντάνου)", "Χανίων", "Αποπηγάδι"],
[156, "Μύλων\u200B\u200B", "Ρεθύμνου", "-"],
[157, "Μάνας", "Τρικάλων", "Κόζιακας"],
[158, "Αχεντριανό (Λιγιοφάρραγο)", "Ηρακλείου", "Αστερούσια Όρη"],
[159, "Κλεισούρας\u200B", "Αιτωλοακαρνανίας", "Αράκυνθος"],
[160, "Κοτσυφού", "Ρεθύμνου", "-"],
[161, "Ελυγιάς", "Χανίων", "Αστερούσια Όρη"],
[162, "Ρόκκας (Ρόκας)", "Χανίων", "Τουρλί (Τρουλλί)"],
[163, "Ασπρορέματος", "Ευρυτανία", "Άγραφα"],
[164, "Ρίχτη", "Λασιθίου", "-"],
[165, "Τραχινού", "Χανίων", "Αποπηγάδι"],
[166, "Λάρνακα", "Λακωνίας", "Κουρκούλα"],
[167, "Αγίας Φωτιάς", "Ρεθύμνου", "Οροπέδιο Γιους Κάμπου"],
[168, "Σμιλιανό (Καλαμαύκα)", "Ρεθύμνου", "-"],
[169, "Χαλορέματος (Αφετών)", "Μαγνησίας", "Πήλιο"],
[170, "Καμπιών", "Χίου", "Πελινναίον"],
[171, "Μυλωνά (Άη Γιάννη)", "Λασιθίου", "-"],
[172, "Σεργούλας (Σεργουλοπόταμου)", "Φωκίδος", "Όρη Λιδωρικίου"],
[173, "Ζάκρου (Νεκρών)", "Λασιθίου", "-"],
[174, "Ορεινού (Πεταλούδων, Κόκκινων Πεταλούδων)", "Λασιθίου", "Θρυπτή"],
[175, "Χα", "Λασιθίου", "Θρυπτή"],
[176, "Χαυγά Οροπεδίου", "Λασιθίου", "Καθαρό"],
[177, "Σφακιανό (Βαρθολομά, Λαγκό)", "Χανίων", "-"],
[178, "Ασφένδου", "Χανίων", "-"],
[179, "Ίμπρου (Νίμπρου)", "Χανίων", "-"],
[180, "Κρύας Βρύσης", "Ρεθύμνου", "Κέδρος"],
[181, "Σηρικαρίου (Σηρικαριανό, Πολυρρήνιας)", "Χανίων", "-"],
[182, "Κουμαριάς (Κρύας Βρύσης)", "Αργολίδας", "Κτενιάς"],
[183, "Κυδώνι", "Χανίων", "Λευκά Όρη"],
[184, "Αράδαινας", "Χανίων", "-"],
[185, "Θερίσσου (Ελευθερίου Βενιζέλου)", "Χανίων", "-"],
[186, "Αγίας Ειρήνης", "Χανίων", "Λευκά Όρη"],
[187, "Αυλάκι (Καθολικού)", "Χανίων", "-"],
[188, "Αλμυρού", "Ηρακλείου", "Στρούμπουλας"],
[189, "Μεσαυλίων - Δελιανών", "Χανίων", "-"],
[190, "Τοπολίων", "Χανίων", "-"],
[191, "Μποριανών", "Χανίων", "-"],
[192, "Αποσελέμη", "Ηρακλείου", "-"],
[193, "Καλλικράτη", "Χανίων", "Λευκά Όρη"],
[194, "Σκάλας\u200B\u200B", "Γρεβενών", "-"],
[195, "Δικτάμου", "Χανίων", "-"],
[196, "Τρυπητής", "Χανίων", "Γκίγκιλος, Λευκά Όρη"],
[197, "Κλάδου", "Χανίων", "Γκίγκιλος, Λευκά Όρη"],
[198, "Κυκλάμινου (Αη Γιωργίτικο, Βαντέ)", "Χανίων", "-"],
[199, "Βαβουλέδω", "Χανίων", "-"],
[200, "Τρομάρισσας", "Χανίων", "Λευκά Όρη"],
[201, "Λισσού", "Χανίων", "-"],
[202, "Ανύδρων ", "Χανίων", "-"],
[203, "Ίλιγκα (Καβή)", "Χανίων", "-"],
[204, "Σπηλιώτισσας Χουδετσίου", "Ηρακλείου", "-"],
[205, "Πελεκάνου (Πελεκανιώτη)", "Χανίων", "-"],
[206, "Λαγγός Ζούρβας (Λαγκός)", "Χανίων", "-"],
[207, "Σκαλωτής", "Χανίων", "Οροπέδιο του Μανικά"],
[208, "Περδικάρη", "Χανίων", "-"],
[209, "Μαγγανίστρας", "Χανίων", "-"],
[210, "Λύχνου Λάκκοι", "Χανίων", "-"],
[211, "Κερατίδας", "Χανίων", "-"],
[212, "Κάμπου", "Χανίων", "Κουτρούλης"],
[213, "Ρέχτας", "Χανίων", "-"],
[214, "Καλαμπούκι", "Χανίων", "-"],
[215, "Κολιακουδέ", "Χανίων", "-"],
[216, "Διμπλοχάχαλο", "Χανίων", "-"],
[217, "Πρασσέ (Ασκιδιανό)", "Χανίων", "-"],
[218, "Κατσούνας", "Χανίων", "-"],
[219, "Φυγούς", "Χανίων", "-"],
[220, "Χαλασέ (Ποροφάραγγο, Σάσαλος)", "Χανίων", "-"],
[221, "Κάπνης", "Χανίων", "-"],
[222, "Ποταμού", "Χανίων", "-"],
[223, "Πατσού (Αγίου Αντωνίου)", "Ρεθύμνου", "-"],
[224, "Φρατιανό", "Ρεθύμνου", "Ξηρό"],
[225, "Μούνδρου (Μουνδριανό, Βελονάδο)", "Ρεθύμνου", "-"],
[226, "Πλατανίων", "Ρεθύμνου", "Ψηλορείτης"],
[227, "Πετρέ", "Ρεθύμνου", "-"],
[228, "Βιλανδρέδο (Κολλητά, Κάτω Πόρου)", "Ρεθύμνου", "-"],
[229, "Γάλλου (Γαλλιανό)", "Ρεθύμνου", "-"],
[230, "Μαργαριτών (Μαργαριτσανό)", "Ρεθύμνου", "-"],
[231, "Αρκαδίου (Αρκαδιώτικο)", "Ρεθύμνου", "-"],
[232, "Μέσα (Πλατύ Ποταμού)", "Ρεθύμνου", "-"],
[233, "Ζωνιανών", "Ρεθύμνου", "Ψηλορείτης"],
[234, "Χελιδονιών", "Ρεθύμνου", "-"],
[235, "Ροδάκινο (Μαγλινάρα)", "Ρεθύμνου", "-"],
[236, "Καρινιώτικο", "Ρεθύμνου", "-"],
[237, "Καρανταλέ (Καρανταλιώτικο)", "Ρεθύμνου", "-"],
[238, "Βεδέρων", "Ρεθύμνου", "-"],
[239, "Κισσανό", "Ρεθύμνου", "Οροπέδιο Γιους Κάμπου"],
[240, "Κυνηγόσπηλιος", "Ρεθύμνου", "-"],
[241, "Συκιάς (Ξεπυτήρας)", "Ρεθύμνου", "-"],
[242, "Καμινόλακκος", "Ρεθύμνου", "-"],
[243, "Κριτσάς (Χαυγάς)", "Λασιθίου", "-"],
[244, "Χοχλακιών (Καρουμών)", "Λασιθίου", "-"],
[245, "Αγίων Πάντων", "Λασιθίου", "-"],
[246, "Μέσωνα (Μέσονα)", "Λασιθίου", "-"],
[247, "Αγίων Αποστόλων (Λάπαθος)", "Λασιθίου", "Δίκτη"],
[248, "Αχλιών", "Λασιθίου", "-"],
[249, "Χαυγάς Καλαμαύκας", "Λασιθίου", "Οροπέδιο Καθαρού"],
[250, "Πεύκων (Ανεγυρούς)", "Λασιθίου", "-"],
[251, "Κουδουμά (Κόφινα)", "Ηρακλείου", "Αστερούσια Όρη"],
[252, "Παναγιάς (Καλάμι Ι)", "Ηρακλείου", "-"],
[253, "Ποροφάραγγο Κάτω Βάθειας (Σφακορύακο)", "Ηρακλείου", "-"],
[254, "Ρεκάς", "Φωκίδος", "Γκιώνα"],
[255, "Εργάνου", "Ηρακλείου", "Οροπέδιο της Εργάνου"],
[256, "Έλιγκα", "Ηρακλείου", "Δίκτη"],
[257, "Αμπέλου", "Ηρακλείου", "-"],
[258, "Ξεροφάραγγο (Καλάμι II)", "Ηρακλείου", "-"],
[259, "Γωνιανό", "Ηρακλείου", "Οροπέδιο Εβδόμου"],
[260, "Ψαρό Νερό", "Ηρακλείου", "-"],
[261, "Τρούλλας (Τσουτσουράκι)", "Ηρακλείου", "Αστερούσια Όρη"],
[262, "Μεσοσφήνι", "Ηρακλείου", "Αστερούσια Όρη"],
[263, "Χάβου", "Κορινθίας", "Ζήρεια"],
[264, "Φλάμπουρου", "Κορινθίας", "Γεράνεια Όρη"],
[265, "Αναποδάρη (Σκινοφάραγγο)", "Ηρακλείου", "-"],
[266, "Βορνό (Εθιάς, Εθιανό)", "Ηρακλείου", "Αστερούσια Όρη"],
[267, "Κούμος", "Ηρακλείου", "-"],
[268, "Πρινιά (Λαγούτα)", "Ηρακλείου", "-"],
[269, "Πετριγιάρι", "Ηρακλείου", "Αστερούσια Όρη"],
[270, "Κακοπέρατος", "Ηρακλείου", "Αστερούσια Όρη"],
[271, "Κακοπέρατου", "Σάμου", "Κέρκης"],
[272, "Ριζόπετρο", "Ηρακλείου", "Σανίδα"],
[273, "Παστρικού", "Ηρακλείου", "Αστερούσια Όρη"],
[274, "Αγίας Παρασκευής (Βουκολιάς)", "Ηρακλείου", "Αστερούσια Όρη"],
[275, "Ρούβα (Ζαρού, Γάφαρη, Αγίου Νικολάου)", "Ηρακλείου", "Αμπελάκια, Σαμάρι"],
[276, "Αστρακιανό (Καρτερού)", "Ηρακλείου", "-"],
[277, "Κουναβιανό", "Ηρακλείου", "-"],
[278, "Αγιοφάραγγο", "Ηρακλείου", "-"],
[279, "Αμπά", "Ηρακλείου", "Αστερούσια Όρη"],
[280, "Πορτέλα", "Ηρακλείου", "Οροπέδιο Βιάννου"],
[281, "Αγίου Αντωνίου", "Ηρακλείου", "-"],
[282, "Αρχανιώτικο (Κνωσανό, Αγίας Ειρήνης)", "Ηρακλείου", "Γιούχτας"],
[283, "Τρυπητής (Αγίου Σάββα)", "Ηρακλείου", "Αστερούσια Όρη"],
[284, "Καμαρών (Καμαραϊκό)", "Ηρακλείου", "Ψηλορείτης"],
[285, "Αργουλιδιά", "Ηρακλείου", "-"],
[286, "Στραβοπόταμου", "Κιλκίς", "Πάικο"],
[287, "Ψωράρη", "Ηρακλείου", "Οροπέδιο Παράσυρτα"],
[288, "Μίντρη", "Ηρακλείου", "-"],
[289, "Γούλας", "Ηρακλείου", "-"],
[290, "Ελυγιάς (Βαλαχά)", "Ηρακλείου", "Αστερούσια Όρη"],
[291, "Απολύχνου", "Ηρακλείου", "-"],
[292, "Κρουσώνα (Γαϊδουροράχης)", "Ηρακλείου", "Ψηλορείτης"],
[293, "Περβολιανό", "Ηρακλείου", "Οροπέδιο Περβόλας"],
[294, "Αγίου Χαραλάμπου", "Ηρακλείου", "-"],
[295, "Καβουσίου", "Ηρακλείου", "Δίκτη"],
[296, "Σπηλιώτισσας Ρογδιάς (Ρέχτρας)", "Ηρακλείου", "-"],
[297, "Αγίας Αναστασίας", "Ηρακλείου", "-"],
[298, "Τσούτσουρου (Τσούτσουρα)", "Ηρακλείου", "-"],
[299, "Εμπασάς (Αποτύπωσης)", "Ηρακλείου", "-"],
[300, "Σαντορινιού", "Ηρακλείου", "-"],
[301, "Μαρτσαλιώτικο", "Ηρακλείου", "Αστερούσια Όρη"],
[302, "Πετάλης (Κερασιάς)", "Εύβοια", "-"],
[303, "Πλησόρεμα", "Φθιώτιδος", "Κνημίδα"],
[304, "Τσιγκούνη", "Λασιθίου", "Ορνό"],
[305, "Τιθορέας (Κάχαλα, Βελίτσας)", "Φωκίδος", "Παρνασσός"],
[306, "Σαρακίνας Μεσκλών", "Χανίων", "Λευκά Όρη"],
[307, "Κλεισούρας\u200B\u200B", "Βοιωτίας", "-"],
[308, "Φάγγου", "Ιωαννίνων", "Τζουμέρκα"],
[309, "Κλειβωκάς (Λάδωνα)", "Αρκαδίας", "-"],
[310, "Χαυγάς (Πλάκα)", "Λασιθίου", "-"],
[311, "Αγίας Ειρήνης Σητείας", "Λασιθίου", "-"],
[312, "Μπουζουνίκου", "Ευρυτανία", "Άγραφα"],
[313, "Κουδουμή", "Λασιθίου", "Ορνό"],
[314, "Μαριδακίου (Λιχνιστής)", "Ηρακλείου", "-"],
[315, "Χούνης", "Αττικής", "Πάρνηθα"],
[316, "Κακόρεμα\u200B\u200B", "Αττικής", "Υμηττός"],
[317, "Κουβαρά (Δολού)", "Ιωαννίνων", "-"],
[318, "Πεκλαρίου (Μπούση)", "Ιωαννίνων", "-"],
[319, "Ζηλιάνας", "Πιερίας", "Όλυμπος"],
[320, "Τυρολόγου (Σκαμνί)", "Καρδίτσας", "Άγραφα"],
[321, "Δία", "Αιτωλοακαρνανία", "-"],
[322, "Κλέφτη", "Γρεβενών", "Όρλιακας"],
[323, "Αδράβαστης", "Λασιθίου", "-"],
[324, "Μυλοπόταμου\u200B\u200B", "Κύθηρα", "-"],
[325, "Κακιάς Λαγκάδας (Παλαιοχώρας)", "Κύθηρα", "-"],
[326, "Περιστεριώνα\u200B\u200B", "Κύθηρα", "-"],
[327, "Κακαβού (Κότσαλου)", "Αιτωλοακαρνανία", "-"],
[328, "Μπουντρούμι (Δέσης)", "Αχαΐας", "-"],
[329, "Μανικιάτη", "Εύβοιας", "-"],
[329, "Ζαστάνι", "Αττικής", "Ποικίλο"],


]

function sortTable() {
    // Sort only by the canyon name (second column) while keeping original indexes
    let sortedData = canyonsData.map(row => row.slice()) // Clone data to avoid modifying original
        .sort((a, b) => a[1].localeCompare(b[1])); // Sort by canyon name

    // Reassign sorted names and remaining columns back to their original row numbers
    canyonsData.forEach((row, index) => {
        row[1] = sortedData[index][1]; // Assign sorted canyon name
        row[2] = sortedData[index][2]; // Assign sorted region
        row[3] = sortedData[index][3]; // Assign sorted mountain
    });
}

function populateTable() {
    const tableBody = document.getElementById("table-body-canyons");
    tableBody.innerHTML = "";

    // Sort before populating the table
    sortTable();

    // Populate the table
    canyonsData.forEach(row => {
        let tr = document.createElement("tr");

        row.forEach(cell => {
            let td = document.createElement("td");
            td.textContent = cell;
            tr.appendChild(td);
        });

        tableBody.appendChild(tr);
    });
}

// Populate the table on page load
document.addEventListener("DOMContentLoaded", populateTable);


// Get the table body element
const tableBody = document.getElementById("table-body-canyons");

// Loop through the data and create table rows
canyonsData.forEach((canyon, index) => {
    // Create a new table row
    const newRow = document.createElement("tr");

    // Add data to the row
    canyon.forEach((data, dataIndex) => {
        // Create a new table cell
        const newCell = document.createElement("td");

        // Add data to the cell
        newCell.textContent = data;

        // Append the cell to the row
        newRow.appendChild(newCell);
    });

    // Append the row to the table body
    tableBody.appendChild(newRow);
});



document.addEventListener('DOMContentLoaded', () => {
    // Function to trigger search on Enter key press
    async function handleEnter(event) {
        if (event.key === "Enter") {
            event.preventDefault(); // Prevent default actions, such as form submission
            await search(); // Calls the search function
        }
    }

    // Add event listener for the Enter key after DOM is loaded
    const searchInput = document.getElementById('searchInput');
    if (searchInput) {
        searchInput.addEventListener('keydown', handleEnter);
    }
});

// Main search function
async function search() {
    const searchTerm = convertToGreekLatin(removeDiacritics(document.getElementById('searchInput').value.trim().toLowerCase()));
    const searchResults = document.getElementById('searchResults');
    const backToHomePage = document.getElementById('backToHomePage');

    searchResults.innerHTML = '';

    console.log('Search Term:', searchTerm);  // Debugging

    if (searchTerm) {
        const table = document.createElement('table');
        table.classList.add('searchResultsTable'); // Add a class for styling purposes
        table.style.margin = 'auto'; // Center the table horizontally

        canyonsData.forEach(rowData => {
            const normalizedFirstColumnData = convertToGreekLatin(removeDiacritics(rowData[1].toLowerCase()));
            const normalizedSpecifiedColumnData = convertToGreekLatin(removeDiacritics(rowData[2].toLowerCase())); // Assuming the specified column is the third column
            const normalizedFourthColumnData = convertToGreekLatin(removeDiacritics(rowData[3].toLowerCase())); // Assuming the fourth column
            
            console.log('Normalized Data:', normalizedFirstColumnData, normalizedSpecifiedColumnData, normalizedFourthColumnData);  // Debugging

            if (normalizedFirstColumnData.includes(searchTerm) || 
                normalizedSpecifiedColumnData.includes(searchTerm) || 
                normalizedFourthColumnData.includes(searchTerm)) {
                
                const tr = document.createElement('tr');
                tr.classList.add('searchResultRow'); // Add a class for styling purposes

                // Adjust loop to start from index 1 to include 2nd, 3rd, and 4th cells
                for (let index = 1; index <= 3; index++) {
                    const td = document.createElement('td');
                    td.classList.add('searchResultCell'); // Add a class for styling purposes

                    // Add link only to the first cell (index 1)

                    if (index === 1) {
                        const link = document.createElement('a');
                        link.textContent = rowData[index];
                        
                        console.log("rowData[index]:", rowData[index]); // Debug the rowData
                        
                        // Adjust href based on cellData content
                        if (rowData[index] === "Άγγιστρος") {
                            link.href = "ΦαραγγιΑγγιστρος.html";
                        } else if (rowData[index] === "Αγία Κόρη") {
                            link.href = "ΦαραγγιΑγιαΚορη.html";
                        } else if (rowData[index] === "Αγιάλης (Αγάλης)") {
                            link.href = "ΦαραγγιΑγιαλης.html";
                        } else if (rowData[index] === "Αγίου Νικολάου (Κουνουπίτσας, Πόζαρ)") {
                            link.href = "ΦαραγγιΑγιουΝικολαουΠοζαρ.html";
                        } else if (rowData[index] === "Άι Γιάννη") {
                            link.href = "ΦαραγγιΑιΓιαννηΠελλα.html";
                        } else if (rowData[index] === "Αμπελοχώρι") {
                            link.href = "ΦαραγγιΑμπελοχωρι.html";
                        } else if (rowData[index] === "Ανδρωνίου (Αντρωνίου)") {
                            link.href = "ΦαραγγιΑνδρωνιου.html";
                        } else if (rowData[index] === "Αρακλού") {
                            link.href = "ΦαραγγιΑρακλου.html";
                        } else if (rowData[index] === "Αραπλάκου (Αράπη)") {
                            link.href = "ΦαραγγιΑραπλακου.html";
                        } else if (rowData[index] === "Ασωπού") {
                            link.href = "ΦαραγγιΑσωπου.html";
                        } else if (rowData[index] === "Άχλα") {
                            link.href = "ΦαραγγιΑχλα.html";
                        } else if (rowData[index] === "Αώου") {
                            link.href = "ΦαραγγιΑωου.html";
                        } else if (rowData[index] === "Βαθύρεμα") {
                            link.href = "ΦαραγγιΒαθυρεμα.html";
                        } else if (rowData[index] === "Βάτου (Κούσιαντα)") {
                            link.href = "ΦαραγγιΒατου.html";
                        } else if (rowData[index] === "Βελβεντού (Λάφιστας, Σκεπασμένο, Εννέα Πιερίδων Μουσών)") {
                            link.href = "ΦαραγγιΒελβεντου.html";
                        } else if (rowData[index] === "Βικάκη") {
                            link.href = "ΦαραγγιΒικακη.html";
                        } else if (rowData[index] === "Βραδέτου") {
                            link.href = "ΦαραγγιΒραδετου.html";
                        } else if (rowData[index] === "Βυρού") {
                            link.href = "ΦαραγγιΒυρου.html";
                        } else if (rowData[index] === "Γερακίνας") {
                            link.href = "ΦαραγγιΓερακινας.html";
                        } else if (rowData[index] === "Γαλανόρεμα") {
                            link.href = "ΦαραγγιΓαλανορεμα.html";
                        } else if (rowData[index] === "Καζάνια") {
                            link.href = "ΦαραγγιΚαζανια.html";
                        } else if (rowData[index] === "Ίναχου") {
                            link.href = "ΦαραγγιΙναχου.html";
                        } else if (rowData[index] === "Κακόσκαλα") {
                            link.href = "ΦαραγγιΚακοσκαλα.html";
                        } else if (rowData[index] === "Καμαριώτη") {
                            link.href = "ΦαραγγιΚαμαριωτη.html";
                        } else if (rowData[index] === "Κήπων") {
                            link.href = "ΦαραγγιΚηπων.html";
                        } else if (rowData[index] === "Κεφαλαρίου") {
                            link.href = "ΦαραγγιΚεφαλαριου.html";
                        } else if (rowData[index] === "Κριθάρια") {
                            link.href = "ΦαραγγιΚριθαρια.html";
                        } else if (rowData[index] === "Κωσταλέξη") {
                            link.href = "ΦαραγγιΚωσταλεξη.html";
                        } else if (rowData[index] === "Μαρουσώς") {
                            link.href = "ΦαραγγιΜαρουσως.html";
                        } else if (rowData[index] === "Ντούνου") {
                            link.href = "ΦαραγγιΝτουνου.html";
                        } else if (rowData[index] === "Αλέστιας") {
                            link.href = "ΦαραγγιΑλεστιας.html";
                        } else if (rowData[index] === "Βαπτιστή") {
                            link.href = "ΦαραγγιΒαπτιστη.html";
                        } else if (rowData[index] === "Κακαβόρεμα") {
                            link.href = "ΦαραγγιΚακαβορεμα.html";
                        } else if (rowData[index] === "Σελίου") {
                            link.href = "ΦαραγγιΣελιου.html";
                        } else if (rowData[index] === "Φλασκιά") {
                            link.href = "ΦαραγγιΦλασκια.html";
                        } else if (rowData[index] === "Φλαμπουρίτσας") {
                            link.href = "ΦαραγγιΦλαμπουριτσας.html";
                        } else if (rowData[index] === "Διποτάματα") {
                            link.href = "ΦαραγγιΔιποταματα.html";
                        } else if (rowData[index] === "Σαντορινιού") {
                            link.href = "ΦαραγγιΣαντορινιου.html";
                        } else if (rowData[index] === "Εμπασάς (Αποτύπωσης)") {
                            link.href = "ΦαραγγιΕμπασας.html";
                        } else if (rowData[index] === "Σπηλιώτισσας Ρογδιάς (Ρέχτρας)") {
                            link.href = "ΦαραγγιΣπηλιωτισσαςΡεχτ.html";
                        } else if (rowData[index] === "Καβουσίου") {
                            link.href = "ΦαραγγιΚαβουσιου.html";
                        } else if (rowData[index] === "Περβολιανό") {
                            link.href = "ΦαραγγιΠερβολιανο.html";
                        } else if (rowData[index] === "Απολύχνου") {
                            link.href = "ΦαραγγιΑπολυχνου.html";
                        } else if (rowData[index] === "Γούλας") {
                            link.href = "ΦαραγγιΓουλας.html";
                        } else if (rowData[index] === "Ψωράρη") {
                            link.href = "ΦαραγγιΨωραρη.html";
                        } else if (rowData[index] === "Αργουλιδιά") {
                            link.href = "ΦαραγγιΑργουλιδια.html";
                        } else if (rowData[index] === "Δοξασμένος") {
                            link.href = "ΦαραγγιΔοξασμενος.html";
                        } else if (rowData[index] === "Αγίας Παρασκευής (Βουκολιάς)") {
                            link.href = "ΦαραγγιΑγιαςΠαρασκευηςΒουκολιας.html";
                        } else if (rowData[index] === "Μυλωνά (Άη Γιάννη)") {
                            link.href = "ΦαραγγιΜυλωναΑιγιαννη.html";
                        } else if (rowData[index] === "Ξερόκαμπου (Ξηρόκαμπου, Λαμνώνι)") {
                            link.href = "ΦαραγγιΞεροκαμπουΛαμνωνι.html";
                        } else if (rowData[index] === "Βοριζιανό") {
                            link.href = "ΦαραγγιΒοριζιανο.html";
                        } else if (rowData[index] === "Περβολακίων (Καψά)") {
                            link.href = "ΦαραγγιΠερβολακιωνΚαψα.html";
                        } else if (rowData[index] === "Κώστιανο (Αχελώου)") {
                            link.href = "ΦαραγγιΚωστιανο.html";
                        } else if (rowData[index] === "Ανακώλου") {
                            link.href = "ΦαραγγιΑνακωλου.html";
                        } else if (rowData[index] === "Μοκιστιάνου") {
                            link.href = "ΦαραγγιΜοκιστιανου.html";
                        } else if (rowData[index] === "Χάβος") {
                            link.href = "ΦαραγγιΧαβοςΕυβοια.html";
                        } else if (rowData[index] === "Χάβος (Προσηλίου)") {
                            link.href = "ΦαραγγιΧαβοςΠιερια.html";
                        } else if (rowData[index] === "Φορτόσι") {
                            link.href = "ΦαραγγιΦορτοσι.html";
                        } else if (rowData[index] === "Σαρίας (Έντη)") {
                            link.href = "ΦαραγγιΣαριας.html";
                        } else if (rowData[index] === "Ρακοπόταμου") {
                            link.href = "ΦαραγγιΡακοποταμου.html";
                        } else if (rowData[index] === "Προπύλη (Άνω Καρλίμπου)") {
                            link.href = "ΦαραγγιΠροπυληΚαρλιμπου.html";
                        } else if (rowData[index] === "Μακρυχώραφα") {
                            link.href = "ΦαραγγιΜακρυχωραφα.html";
                        } else if (rowData[index] === "Ζαρμπάνιτσας") {
                            link.href = "ΦαραγγιΖαρμπανιτσας.html";
                        } else if (rowData[index] === "Δημόσαρη") {
                            link.href = "ΦαραγγιΔημοσαρη.html";
                        } else if (rowData[index] === "Βόθωνα") {
                            link.href = "ΦαραγγιΒοθωνα.html";
                        } else if (rowData[index] === "Γερακάρη") {
                            link.href = "ΦαραγγιΓερακαρη.html";
                        } else if (rowData[index] === "Γοργοπόταμου") {
                            link.href = "ΦαραγγιΓοργοποταμου.html";
                        } else if (rowData[index] === "Γούμερου") {
                            link.href = "ΦαραγγιΓουμερου.html";
                        } else if (rowData[index] === "Γουρνόρεμα") {
                            link.href = "ΦαραγγιΓουρνορεμα.html";
                        } else if (rowData[index] === "Γριά Βάθρα") {
                            link.href = "ΦαραγγιΓριαΒαθρα.html";
                        } else if (rowData[index] === "Γυάλι") {
                            link.href = "ΦαραγγιΓυαλι.html";
                        } else if (rowData[index] === "Δέλφινο (Δελφινάκος)") {
                            link.href = "ΦαραγγιΔελφινο.html";
                        } else if (rowData[index] === "Δέος") {
                            link.href = "ΦαραγγιΔεος.html";
                        } else if (rowData[index] === "Καλυψώ") {
                            link.href = "ΦαραγγιΚαλυψω.html";
                        } else if (rowData[index] === "Καραγιαννάκη") {
                            link.href = "ΦαραγγιΚαραγιαννακη.html";
                        } else if (rowData[index] === "Καταφύκι (Μυγγυριστέα)") {
                            link.href = "ΦαραγγιΚαταφυκι.html";
                        } else if (rowData[index] === "Κεραμιδίου") {
                            link.href = "ΦαραγγιΚεραμιδιου.html";
                        } else if (rowData[index] === "Κόκκινα Πατερά") {
                            link.href = "ΦαραγγιΚοκκιναΠατερα.html";
                        } else if (rowData[index] === "Κόκκινο Ποτάμι") {
                            link.href = "ΦαραγγιΚοκκινοΠοταμι.html";
                        } else if (rowData[index] === "Κοροβέσου") {
                            link.href = "ΦαραγγιΚοροβεσου.html";
                        } else if (rowData[index] === "Κράστας") {
                            link.href = "ΦαραγγιΚραστας.html";
                        } else if (rowData[index] === "Λαγκαδιώτισσας (Λαγκαδά)") {
                            link.href = "ΦαραγγιΛαγκαδιωτισσας.html";
                        } else if (rowData[index] === "Τζένας") {
                            link.href = "ΦαραγγιΤζενας.html";
                        } else if (rowData[index] === "Λεπίδας") {
                            link.href = "ΦαραγγιΛεπιδας.html";
                        } else if (rowData[index] === "Λουκά") {
                            link.href = "ΦαραγγιΛουκα.html";
                        } else if (rowData[index] === "Λούλουγκα") {
                            link.href = "ΦαραγγιΛουλουγκα.html";
                        } else if (rowData[index] === "Μαζιάς") {
                            link.href = "ΦαραγγιΜαζιας.html";
                        } else if (rowData[index] === "Μαύρη Σπηλιά") {
                            link.href = "ΦαραγγιΜαυρηΣπηλια.html";
                        } else if (rowData[index] === "Μαυρομάτη") {
                            link.href = "ΦαραγγιΜαυροματη.html";
                        } else if (rowData[index] === "Μέγα Ρέμα") {
                            link.href = "ΦαραγγιΜεγαΡεμαΦθιωτιδα.html";
                        } else if (rowData[index] === "Μέγας Λάκκος") {
                            link.href = "ΦαραγγιΜεγαςΛακκος.html";
                        } else if (rowData[index] === "Μεζαριάς") {
                            link.href = "ΦαραγγιΜεζαριας.html";
                        } else if (rowData[index] === "Μεσορόπης") {
                            link.href = "ΦαραγγιΜεσοροπης.html";
                        } else if (rowData[index] === "Μέγα Ρέμα Μουζακίου") {
                            link.href = "ΦαραγγιΜεγαΡεμαΜουζακιου.html";
                        } else if (rowData[index] === "Μπασδέκη (Κλίφκης)") {
                            link.href = "ΦαραγγιΜπασδεκηΚλιφκης.html";
                        } else if (rowData[index] === "Μύλων\u200B") {
                            link.href = "ΦαραγγιΜυλωνΑττικη.html";
                        } else if (rowData[index] === "Ματσουκίου") {
                            link.href = "ΦαραγγιΜατσουκιου.html";
                        } else if (rowData[index] === "Λούσιου") {
                            link.href = "ΦαραγγιΛουσιου.html";
                        } else if (rowData[index] === "Μυλοπόταμου\u200B") {
                            link.href = "ΦαραγγιΜυλοποταμου.html";
                        } else if (rowData[index] === "Νεφέλης") {
                            link.href = "ΦαραγγιΝεφελης.html";
                        } else if (rowData[index] === "Νταμούχαρη") {
                            link.href = "ΦαραγγιΝταμουχαρη.html";
                        } else if (rowData[index] === "Ξετρυπητή") {
                            link.href = "ΦαραγγιΞετρυπητη.html";
                        } else if (rowData[index] === "Ξηροπόταμου") {
                            link.href = "ΦαραγγιΞηροποταμου.html";
                        } else if (rowData[index] === "Οινόης (Μαραθώνα)") {
                            link.href = "ΦαραγγιΟινοης.html";
                        } else if (rowData[index] === "Παλαιάς Βροντούς") {
                            link.href = "ΦαραγγιΠαλαιαςΒροντους.html";
                        } else if (rowData[index] === "Παπά-Ρέμα") {
                            link.href = "ΦαραγγιΠαπαΡεμα.html";
                        } else if (rowData[index] === "Περιστεριώνα\u200B") {
                            link.href = "ΦαραγγιΠεριστεριωνα.html";
                        } else if (rowData[index] === "Πλατανάκι (Δεκατιάς)") {
                            link.href = "ΦαραγγιΠλατανακι.html";
                        } else if (rowData[index] === "Πύλη Παραδείσου (Καρλίμπου)") {
                            link.href = "ΦαραγγιΠυληΠαραδεισου.html";
                        } else if (rowData[index] === "Πύργων (Πετρούσας)") {
                            link.href = "ΦαραγγιΠυργωνΠετρουσας.html";
                        } else if (rowData[index] === "Ροδοκάλου") {
                            link.href = "ΦαραγγιΡοδοκαλου.html";
                        } else if (rowData[index] === "Σερβίων (Χούνη)") {
                            link.href = "ΦαραγγιΣερβιων.html";
                        } else if (rowData[index] === "Σεργούλας (Σεργουλοπόταμου)") {
                            link.href = "ΦαραγγιΣεργουλοποταμος.html";
                        } else if (rowData[index] === "Στριφτό") {
                            link.href = "ΦαραγγιΣτριφτο.html";
                        } else if (rowData[index] === "Τοίχου") {
                            link.href = "ΦαραγγιΤοιχου.html";
                        } else if (rowData[index] === "Σελινούντα (Τρανό Λαγκάδι)") {
                            link.href = "ΦαραγγιΣελινουντα.html";
                        } else if (rowData[index] === "Τσιβδογιάννη") {
                            link.href = "ΦαραγγιΤσιβδογιαννη.html";
                        } else if (rowData[index] === "Σαρακίνας (Σαρακηνό, Σαραντάπηχου)") {
                            link.href = "ΦαραγγιΣαρακηνας.html";
                        } else if (rowData[index] === "Πρασσανό") {
                            link.href = "ΦαραγγιΠρασσανο.html";
                        } else if (rowData[index] === "Στενό Αθαμανίας (Μουτσιαρίτη)") {
                            link.href = "ΦαραγγιΣτενοΑθαμανιας.html";
                        } else if (rowData[index] === "Σπίνας (Κανδάνου, Καντάνου)") {
                            link.href = "ΦαραγγιΣπιναςΚανδανου.html";
                        } else if (rowData[index] === "Μύλων\u200B\u200B") {
                            link.href = "ΦαραγγιΜυλωνΡεθυμνου.html";
                        } else if (rowData[index] === "Μάνας") {
                            link.href = "ΦαραγγιΜανας.html";
                        } else if (rowData[index] === "Αγίου Αντωνίου") {
                            link.href = "ΦαραγγιΑγιουΑντωνιουΗρακλειο.html";
                        } else if (rowData[index] === "Κοτσυφού") {
                            link.href = "ΦαραγγιΚοτσυφουΡεθυμνο.html";
                        } else if (rowData[index] === "Ρόκκας (Ρόκας)") {
                            link.href = "ΦαραγγιΡοκας.html";
                        } else if (rowData[index] === "Τραχινού") {
                            link.href = "ΦαραγγιΤραχινου.html";
                        } else if (rowData[index] === "Βαβουλέδω") {
                            link.href = "ΦαραγγιΒαβουλεδω.html";
                        } else if (rowData[index] === "Σμιλιανό (Καλαμαύκα)") {
                            link.href = "ΦαραγγιΣμιλιανοΚαλαμαυκα.html";
                        } else if (rowData[index] === "Ζάκρου (Νεκρών)") {
                            link.href = "ΦαραγγιΖακρουΝεκρων.html";
                        } else if (rowData[index] === "Τσούτσουρου (Τσούτσουρα)") {
                            link.href = "ΦαραγγιΤσουτσουρου.html";
                        } else if (rowData[index] === "Άρβης") {
                            link.href = "ΦαραγγιΑρβης.html";
                        } else if (rowData[index] === "Σηρικαρίου (Σηρικαριανό, Πολυρρήνιας)") {
                            link.href = "ΦαραγγιΣηρικαριανο.html";
                        } else if (rowData[index] === "Κλεισούρας\u200B") {
                            link.href = "ΦαραγγιΚλεισουρας.html";
                        } else if (rowData[index] === "Σφακιανό (Βαρθολομά, Λαγκό)") {
                            link.href = "ΦαραγγιΣφακιανο.html";
                        } else if (rowData[index] === "Ασφένδου") {
                            link.href = "ΦαραγγιΑσφενδου.html";
                        } else if (rowData[index] === "Ίμπρου (Νίμπρου)") {
                            link.href = "ΦαραγγιΙμπρου.html";
                        } else if (rowData[index] === "Κρύας Βρύσης") {
                            link.href = "ΦαραγγιΚρυαςΒρυσης.html";
                        } else if (rowData[index] === "Πορτίτσας") {
                            link.href = "ΦαραγγιΠορτιτσας.html";
                        } else if (rowData[index] === "Σκάλας\u200B") {
                            link.href = "ΦαραγγιΣκαλας.html";
                        } else if (rowData[index] === "Τιμίου Προδρόμου") {
                            link.href = "ΦαραγγιΤιμιουΠροδρομου.html";
                        } else if (rowData[index] === "Ρίχτη") {
                            link.href = "ΦαραγγιΡιχτη.html";
                        } else if (rowData[index] === "Λάρνακα") {
                            link.href = "ΦαραγγιΛαρνακα.html";
                        } else if (rowData[index] === "Χαυγά Οροπεδίου") {
                            link.href = "ΦαραγγιΧαυγαΟροπεδιου.html";
                        } else if (rowData[index] === "Κυδώνι") {
                            link.href = "ΦαραγγιΚυδωνι.html";
                        } else if (rowData[index] === "Θερίσσου (Ελευθερίου Βενιζέλου)") {
                            link.href = "ΦαραγγιΘερισσου.html";
                        } else if (rowData[index] === "Αγίας Ειρήνης") {
                            link.href = "ΦαραγγιΑγιαςΕιρηνηςΧανια.html";
                        } else if (rowData[index] === "Ορεινού (Πεταλούδων, Κόκκινων Πεταλούδων)") {
                            link.href = "ΦαραγγιΟρεινουΠεταλουδων.html";
                        } else if (rowData[index] === "Χα") {
                            link.href = "ΦαραγγιΤουΧα.html";
                        } else if (rowData[index] === "Αράδαινας") {
                            link.href = "ΦαραγγιΑραδαινας.html";
                        } else if (rowData[index] === "Καλλικράτη") {
                            link.href = "ΦαραγγιΚαλλικρατη.html";
                        } else if (rowData[index] === "Δικτάμου") {
                            link.href = "ΦαραγγιΔικταμου.html";
                        } else if (rowData[index] === "Κλάδου") {
                            link.href = "ΦαραγγιΚλαδου.html";
                        } else if (rowData[index] === "Αποσελέμη") {
                            link.href = "ΦαραγγιΑποσελεμη.html";
                        } else if (rowData[index] === "Μποριανών") {
                            link.href = "ΦαραγγιΜποριανων.html";
                        } else if (rowData[index] === "Τοπολίων") {
                            link.href = "ΦαραγγιΤοπολιων.html";
                        } else if (rowData[index] === "Μεσαυλίων - Δελιανών") {
                            link.href = "ΦαραγγιΜεσαυλιωνΔελιανων.html";
                        } else if (rowData[index] === "Αλμυρού") {
                            link.href = "ΦαραγγιΑλμυρου.html";
                        } else if (rowData[index] === "Αυλάκι (Καθολικού)") {
                            link.href = "ΦαραγγιΑυλακιΚαθολικου.html";
                        } else if (rowData[index] === "Καμπιών") {
                            link.href = "ΦαραγγιΚαμπιων.html";
                        } else if (rowData[index] === "Κυκλάμινου (Αη Γιωργίτικο, Βαντέ)") {
                            link.href = "ΦαραγγιΚυκλαμινουΑιγιωργιτικο.html";
                        } else if (rowData[index] === "Τρομάρισσας") {
                            link.href = "ΦαραγγιΤρομαρισσας.html";
                        } else if (rowData[index] === "Λισσού") {
                            link.href = "ΦαραγγιΛισσου.html";
                        } else if (rowData[index] === "Ανύδρων") {
                            link.href = "ΦαραγγιΑνυνδρων.html";
                        } else if (rowData[index] === "Τρυπητής") {
                            link.href = "ΦαραγγιΤρυπητηςΧανια.html";
                        } else if (rowData[index] === "Ίλιγκα (Καβή)") {
                            link.href = "ΦαραγγιΙλιγγαΚαβη.html";
                        } else if (rowData[index] === "Πελεκάνου (Πελεκανιώτη)") {
                            link.href = "ΦαραγγιΠελεκανουΠελεκανιωτη.html";
                        } else if (rowData[index] === "Λαγγός Ζούρβας (Λαγκός)") {
                            link.href = "ΦαραγγιΛαγγοςΖουρβας.html";
                        } else if (rowData[index] === "Σκαλωτής") {
                            link.href = "ΦαραγγιΣκαλωτης.html";
                        } else if (rowData[index] === "Περδικάρη") {
                            link.href = "ΦαραγγιΠερδικαρη.html";
                        } else if (rowData[index] === "Μαγγανίστρας") {
                            link.href = "ΦαραγγιΜαγγανιστρας.html";
                        } else if (rowData[index] === "Λύχνου Λάκκοι") {
                            link.href = "ΦαραγγιΛυχνουΛακκοι.html";
                        } else if (rowData[index] === "Κερατίδας") {
                            link.href = "ΦαραγγιΚερατιδας.html";
                        } else if (rowData[index] === "Κάμπου") {
                            link.href = "ΦαραγγιΚαμπουΧανια.html";
                        } else if (rowData[index] === "Ρέχτας") {
                            link.href = "ΦαραγγιΡεχταςΧανια.html";
                        } else if (rowData[index] === "Καλαμπούκι") {
                            link.href = "ΦαραγγιΚαλαμπουκι.html";
                        } else if (rowData[index] === "Κολιακουδέ") {
                            link.href = "ΦαραγγιΚολιακουδε.html";
                        } else if (rowData[index] === "Διμπλοχάχαλο") {
                            link.href = "ΦαραγγιΔιπλοχαχαλο.html";
                        } else if (rowData[index] === "Πρασσέ (Ασκιδιανό)") {
                            link.href = "ΦαραγγιΠρασσεΑσκιδιανο.html";
                        } else if (rowData[index] === "Κατσούνας") {
                            link.href = "ΦαραγγιΚατσουνας.html";
                        } else if (rowData[index] === "Φυγούς") {
                            link.href = "ΦαραγγιΦυγους.html";
                        } else if (rowData[index] === "Χαλασέ (Ποροφάραγγο, Σάσαλος)") {
                            link.href = "ΦαραγγιΧαλασεΣασαλος.html";
                        } else if (rowData[index] === "Κάπνης") {
                            link.href = "ΦαραγγιΚαπνης.html";
                        } else if (rowData[index] === "Ποταμού") {
                            link.href = "ΦαραγγιΠοταμου.html";
                        } else if (rowData[index] === "Φρατιανό") {
                            link.href = "ΦαραγγιΦρατιανο.html";
                        } else if (rowData[index] === "Πετρέ") {
                            link.href = "ΦαραγγιΠετρε.html";
                        } else if (rowData[index] === "Γάλλου (Γαλλιανό)") {
                            link.href = "ΦαραγγιΓαλλουΓαλλιανο.html";
                        } else if (rowData[index] === "Μαργαριτών (Μαργαριτσανό)") {
                            link.href = "ΦαραγγιΜαργαριτων.html";
                        } else if (rowData[index] === "Μέσα (Πλατύ Ποταμού)") {
                            link.href = "ΦαραγγιΜεσαΠλατυΠοταμου.html";
                        } else if (rowData[index] === "Χελιδονιών") {
                            link.href = "ΦαραγγιΧελιδονιων.html";
                        } else if (rowData[index] === "Πατσού (Αγίου Αντωνίου)") {
                            link.href = "ΦαραγγιΠατσουΑγιουΑντωνιου.html";
                        } else if (rowData[index] === "Ροδάκινο (Μαγλινάρα)") {
                            link.href = "ΦαραγγιΡοδακινο.html";
                        } else if (rowData[index] === "Καρινιώτικο") {
                            link.href = "ΦαραγγιΚαρινιωτικο.html";
                        } else if (rowData[index] === "Κισσανό") {
                            link.href = "ΦαραγγιΚισσανο.html";
                        } else if (rowData[index] === "Κυνηγόσπηλιος") {
                            link.href = "ΦαραγγιΚυνηγοσπηλιος.html";
                        } else if (rowData[index] === "Συκιάς (Ξεπυτήρας)") {
                            link.href = "ΦαραγγιΣυκιαςΞεπυτηρας.html";
                        } else if (rowData[index] === "Καμινόλακκος") {
                            link.href = "ΦαραγγιΚαμινολακκος.html";
                        } else if (rowData[index] === "Κριτσάς (Χαυγάς)") {
                            link.href = "ΦαραγγιΚριτσαςΧαυγας.html";
                        } else if (rowData[index] === "Χοχλακιών (Καρουμών)") {
                            link.href = "ΦαραγγιΧοχλακιωνΚαρουμων.html";
                        } else if (rowData[index] === "Τρούλλας (Τσουτσουράκι)") {
                            link.href = "ΦαραγγιΤρουλλαςΤσουτσουρακι.html";
                        } else if (rowData[index] === "Μεσοσφήνι") {
                            link.href = "ΦαραγγιΜεσοσφηνι.html";
                        } else if (rowData[index] === "Αναποδάρη (Σκινοφάραγγο)") {
                            link.href = "ΦαραγγιΑναποδαρη.html";
                        } else if (rowData[index] === "Βορνό (Εθιάς, Εθιανό)") {
                            link.href = "ΦαραγγιΒορνοΕθιας.html";
                        } else if (rowData[index] === "Πρινιά (Λαγούτα)") {
                            link.href = "ΦαραγγιΠρινιαΛαγουτα.html";
                        } else if (rowData[index] === "Πετριγιάρι") {
                            link.href = "ΦαραγγιΠετριγιαρι.html";
                        } else if (rowData[index] === "Κακοπέρατος") {
                            link.href = "ΦαραγγιΚακοπερατοςΚρητη.html";
                        } else if (rowData[index] === "Ριζόπετρο") {
                            link.href = "ΦαραγγιΡιζοπετρο.html";
                        } else if (rowData[index] === "Παστρικού") {
                            link.href = "ΦαραγγιΠαστρικου.html";
                        } else if (rowData[index] === "Αχλιών") {
                            link.href = "ΦαραγγιΑχλιων.html";
                        } else if (rowData[index] === "Χαυγάς Καλαμαύκας") {
                            link.href = "ΦαραγγιΚαλαμαυκας.html";
                        } else if (rowData[index] === "Πεύκων (Ανεγυρούς)") {
                            link.href = "ΦαραγγιΠευκωνΑνεγυρους.html";
                        } else if (rowData[index] === "Κουδουμά (Κόφινα)") {
                            link.href = "ΦαραγγιΚουδουμαΚοφινα.html";
                        } else if (rowData[index] === "Ποροφάραγγο Κάτω Βάθειας (Σφακορύακο)") {
                            link.href = "ΦαραγγιΠοροφαραγγοΚατωΒαθειαςΣφακορυακο.html";
                        } else if (rowData[index] === "Εργάνου") {
                            link.href = "ΦαραγγιΕργανου.html";
                        } else if (rowData[index] === "Έλιγκα") {
                            link.href = "ΦαραγγιΕλιγκα.html";
                        } else if (rowData[index] === "Αμπέλου") {
                            link.href = "ΦαραγγιΑμπελουΗρακλειο.html";
                        } else if (rowData[index] === "Γωνιανό") {
                            link.href = "ΦαραγγιΓωνιανιΗρακλειο.html";
                        } else if (rowData[index] === "Ψαρό Νερό") {
                            link.href = "ΦαραγγιΨαροΝερο.html";
                        } else if (rowData[index] === "Μέσωνα (Μέσονα)") {
                            link.href = "ΦαραγγιΜεσωνα.html";
                        } else if (rowData[index] === "Αγίων Πάντων") {
                            link.href = "ΦαραγγιΑγιωνΠαντωνΚρητη.html";
                        } else if (rowData[index] === "Βεδέρων") {
                            link.href = "ΦαραγγιΒεδερων.html";
                        } else if (rowData[index] === "Αμπά") {
                            link.href = "ΦαραγγιΑμπα.html";
                        } else if (rowData[index] === "Πορτέλα") {
                            link.href = "ΦαραγγιΠορτελα.html";
                        } else if (rowData[index] === "Χάβου") {
                            link.href = "ΦαραγγιΧαβουΚορινθια.html";
                        } else if (rowData[index] === "Πλησόρεμα") {
                            link.href = "ΦαραγγιΠλησορεμα.html";
                        } else if (rowData[index] === "Κλειβωκάς (Λάδωνα)") {
                            link.href = "ΦαραγγιΚλειβωκας.html";
                        } else if (rowData[index] === "Αρκαδίου (Αρκαδιώτικο)") {
                            link.href = "ΦαραγγιΑρκαδιουΑρκαδιωτικο.html";
                        } else if (rowData[index] === "Καρανταλέ (Καρανταλιώτικο)") {
                            link.href = "ΦαραγγιΚαρανταλεΚαρανταλιωτικο.html";
                        } else if (rowData[index] === "Αγίων Αποστόλων (Λάπαθος)") {
                            link.href = "ΦαραγγιΑγιωνΑποστολωνΛαπαθος.html";
                        } else if (rowData[index] === "Απιδιανό (Γούδουρα, Αγίου Αντωνίου)") {
                            link.href = "ΦαραγγιΑπιδιανοΓουδουρα.html";
                        } else if (rowData[index] === "Χαράδρου") {
                            link.href = "ΦαραγγιΧαραδρου.html";
                        } else if (rowData[index] === "Κουμαριάς (Κρύας Βρύσης)") {
                            link.href = "ΦαραγγιΚουμαριαςΚρυαςΒρυσης.html";
                        } else if (rowData[index] === "Σκάλας\u200B\u200B") {
                            link.href = "ΦαραγγιΣκαλαςΓρεβενων.html";
                        } else if (rowData[index] === "Αγίας Ειρήνης Σητείας") {
                            link.href = "ΦαραγγιΑγιαςΕιρηνηςΣητειας.html";
                        } else if (rowData[index] === "Χαυγάς (Πλάκα)") {
                            link.href = "ΦαραγγιΧαυγαςΠλακα.html";
                        } else if (rowData[index] === "Φτερόρεμμα") {
                            link.href = "ΦαραγγιΦτερορεμα.html";
                        } else if (rowData[index] === "Κερεντάν") {
                            link.href = "ΦαραγγιΚερενταν.html";
                        } else if (rowData[index] === "Φάγγου") {
                            link.href = "ΦαραγγιΦαγγου.html";
                        } else if (rowData[index] === "Κλεισούρας\u200B\u200B") {
                            link.href = "ΦαραγγιΚλεισουραςΒοιωτια.html";
                        } else if (rowData[index] === "Σαρακίνας Μεσκλών") {
                            link.href = "ΦαραγγιΣαρακιναςΜεσκλων.html";
                        } else if (rowData[index] === "Τιθορέας (Κάχαλα, Βελίτσας)") {
                            link.href = "ΦαραγγιΤιθορεαςΚαχαλαΒελιτσας.html";
                        } else if (rowData[index] === "Ράμνο Μπορ") {
                            link.href = "ΦαραγγιΡαμνοΜπορ.html";
                        } else if (rowData[index] === "Τσιγγενόρεμα") {
                            link.href = "ΦαραγγιΤσιγγενορεμα.html";
                        } else if (rowData[index] === "Φακίστρας") {
                            link.href = "ΦαραγγιΦακιστρας.html";
                        } else if (rowData[index] === "Φονιά") {
                            link.href = "ΦαραγγιΦονιαΣαμοθρακη.html";
                        } else if (rowData[index] === "Κενταύρων") {
                            link.href = "ΦαραγγιΚενταυρων.html";
                        } else if (rowData[index] === "Κούμος") {
                            link.href = "ΦαραγγιΚουμος.html";
                        } else if (rowData[index] === "Ρίντομου (Κοσκάρακας)") {
                            link.href = "ΦαραγγιΡιντομου.html";
                        } else if (rowData[index] === "Φονέα (Νούπαντης)") {
                            link.href = "ΦαραγγιΦονεαΝουπαντης.html";
                        } else if (rowData[index] === "Βρυσιωτικού (Μύλων, Κάστορα, Κάρδαρη)") {
                            link.href = "ΦαραγγιΒρυσιωτικουΜυλωνΚαστοραΚαραδαρη.html";
                        } else if (rowData[index] === "Κουρταλιώτικο (Κουρταλιώτη)") {
                            link.href = "ΦαραγγιΚουρταλιωτη.html";
                        } else if (rowData[index] === "Μπουλοβίναινας (Νηλέα, Αράπη)") {
                            link.href = "ΦαραγγιΜπουλοβιναιναςΝηλεα.html";
                        } else if (rowData[index] === "Ελυγιάς") {
                            link.href = "ΦαραγγιΕλυγιας.html";
                        } else if (rowData[index] === "Αγίας Φωτιάς") {
                            link.href = "ΦαραγγιΑγιαςΦωτιαςΡεθυμνο.html";
                        } else if (rowData[index] === "Πλατανίων") {
                            link.href = "ΦαραγγιΠλατανιωνΡεθυμνο.html";
                        } else if (rowData[index] === "Μούνδρου (Μουνδριανό, Βελονάδο)") {
                            link.href = "ΦαραγγιΜουνδριανοΜουνδρου.html";
                        } else if (rowData[index] === "Βιλανδρέδο (Κολλητά, Κάτω Πόρου)") {
                            link.href = "ΦαραγγιΒιλαδενδροΚολλητα.html";
                        } else if (rowData[index] === "Ζωνιανών") {
                            link.href = "ΦαραγγιΖωνιανων.html";
                        } else if (rowData[index] === "Παναγιάς (Καλάμι Ι)") {
                            link.href = "ΦαραγγιΠαναγιαςΚαλαμι.html";
                        } else if (rowData[index] === "Ξεροφάραγγο (Καλάμι II)") {
                            link.href = "ΦαραγγιΞεροφαραγγοΚαλαμι.html";
                        } else if (rowData[index] === "Φλάμπουρου") {
                            link.href = "ΦαραγγιΦλαμπουρουΓερανεια.html";
                        } else if (rowData[index] === "Ρούβα (Ζαρού, Γάφαρη, Αγίου Νικολάου)") {
                            link.href = "ΦαραγγιΡουβαΖαρουΓαφαρη.html";
                        } else if (rowData[index] === "Κακοπέρατου") {
                            link.href = "ΦαραγγιΚακοπερατουΣαμος.html";
                        } else if (rowData[index] === "Αστρακιανό (Καρτερού)") {
                            link.href = "ΦαραγγιΑστρακιανο.html";
                        } else if (rowData[index] === "Κουναβιανό") {
                            link.href = "ΦαραγγιΚουναβιανο.html";
                        } else if (rowData[index] === "Αγιοφάραγγο") {
                            link.href = "ΦαραγγιΑγιοφαραγγο.html";
                        } else if (rowData[index] === "Κρουσώνα (Γαϊδουροράχης)") {
                            link.href = "ΦαραγγιΚρουσωνα.html";
                        } else if (rowData[index] === "Αγίου Χαραλάμπου") {
                            link.href = "ΦαραγγιΑγιουΧαραλαμπουΗρακλειο.html";
                        } else if (rowData[index] === "Αρχανιώτικο (Κνωσανό, Αγίας Ειρήνης)") {
                            link.href = "ΦαραγγιΑρχανιωτικοΚνωσανο.html";
                        } else if (rowData[index] === "Τρυπητής (Αγίου Σάββα)") {
                            link.href = "ΦαραγγιΤρυπητηςΗρακλειο.html";
                        } else if (rowData[index] === "Καμαρών (Καμαραϊκό)") {
                            link.href = "ΦαραγγιΚαμαρωνΚαραμαικο.html";
                        } else if (rowData[index] === "Μίντρη") {
                            link.href = "ΦαραγγιΜιντρη.html";
                        } else if (rowData[index] === "Ασπρορέματος") {
                            link.href = "ΦαραγγιΑσπρορεματος.html";
                        } else if (rowData[index] === "Αγίας Αναστασίας") {
                            link.href = "ΦαραγγιΑγιαςΑναστασιαςΗρακλειου.html";
                        } else if (rowData[index] === "Μαρτσαλιώτικο") {
                            link.href = "ΦαραγγιΜαρτσαλιωτικο.html";
                        } else if (rowData[index] === "Σπηλιώτισσας Χουδετσίου") {
                            link.href = "ΦαραγγιΣπηλιωτισσαςΧουδετσιου.html";
                        } else if (rowData[index] === "Βενεράτου") {
                            link.href = "ΦαραγγιΒενερατου.html";
                        } else if (rowData[index] === "Τράφουλα (Τράχουλα)") {
                            link.href = "ΦαραγγιΤραφουλα.html";
                        } else if (rowData[index] === "Ρόζας") {
                            link.href = "ΦαραγγιΡοζαςΗρακλειο.html";
                        } else if (rowData[index] === "Πετάλης (Κερασιάς)") {
                            link.href = "ΦαραγγιΠεταληςΚερασιας.html";
                        } else if (rowData[index] === "Μαριδακίου (Λιχνιστής)") {
                            link.href = "ΦαραγγιΜαριδακιουΛιχνιστης.html";
                        } else if (rowData[index] === "Αχεντριανό (Λιγιοφάρραγο)") {
                            link.href = "ΦαραγγιΑχεντριανοΛιγγιοφαραγγο.html";
                        } else if (rowData[index] === "Τσιγκούνη") {
                            link.href = "ΦαραγγιΤσιγγουνη.html";
                        } else if (rowData[index] === "Μπουζουνίκου") {
                            link.href = "ΦαραγγιΜπουζουνικου.html";
                        } else if (rowData[index] === "Στροπώνων") {
                            link.href = "ΦαραγγιΣτροπωνων.html";
                        } else if (rowData[index] === "Κακόρεμα" && rowData[index + 1] === "Μαγνησίας") {
                            link.href = "ΦαραγγιΚακορεμαΜαγνησιας.html";
                        } else if (rowData[index] === "Ελυγιάς (Βαλαχά)") {
                            link.href = "ΦαραγγιΕλυγιαςΒαλαχα.html";
                        } else if (rowData[index] === "Κλειδωνιάς (Βοϊδομάτη)") {
                            link.href = "ΦαραγγιΚλειδωνιαςΒοιδοματη.html";
                        } else if (rowData[index] === "Χρούσια (Σταυραετού, Μπόζια)") {
                            link.href = "ΦαραγγιΧρουσιαΣταυραετου.html";
                        } else if (rowData[index] === "Αλιμάχης") {
                            link.href = "ΦαραγγιΑλιμαχης.html";
                        } else if (rowData[index] === "Παπαπήδημα (Αράχθου)") {
                            link.href = "ΦαραγγιΠαπαπηδημαΑραχθου.html";
                        } else if (rowData[index] === "Κακόρεμα" && rowData[index + 1] === "Αττικής") {
                            link.href = "ΦαραγγιΚακορεμαΑττικης.html";
                        } else if (rowData[index] === "Αγγίτη") {
                            link.href = "ΦαραγγιΑγγιτηΣερρες.html";
                        } else if (rowData[index] === "Τσανάρκας (Γαλανά νερά)") {
                            link.href = "ΦαραγγιΤσαναρκαςΓαλαναΝερα.html";
                        } else if (rowData[index] === "Αγίου Δημητρίου") {
                            link.href = "ΦαραγγιΑγιουΔημητριουΕυβοιας.html";
                        } else if (rowData[index] === "Θηριόπετρας") {
                            link.href = "ΦαραγγιΘηριοπετρας.html";
                        } else if (rowData[index] === "Στραβοπόταμου") {
                            link.href = "ΦαραγγιΣτραβοποταμου.html";
                        } else if (rowData[index] === "Καλλιθέας (Αγίου Λουκά)") {
                            link.href = "ΦαραγγιΑγιουΛουκαΚαλλιθεας.html";
                        } else if (rowData[index] === "Φόνισσας") {
                            link.href = "ΦαραγγιΦονισσαςΚορινθια.html";
                        } else if (rowData[index] === "Τσάκωνα") {
                            link.href = "ΦαραγγιΤσακωναΚυθηρα.html";
                        } else if (rowData[index] === "Τόρνου (Χαλικόρεμα, Μικρό Πάντα Βρέχει)") {
                            link.href = "ΦαραγγιΤορνουΧαλικορεμα.html";
                        } else if (rowData[index] === "Χαλορέματος (Αφετών)") {
                            link.href = "ΦαραγγιΧαλορεματοςΑφετων.html";
                        } else if (rowData[index] === "Ορλιά") {
                            link.href = "ΦαραγγιΟρλια.html";
                        } else if (rowData[index] === "Ρεκάς") {
                            link.href = "ΦαραγγιΡεκας.html";
                        } else if (rowData[index] === "Ξηριά Κρύας (Έρκυνας)") {
                            link.href = "ΦαραγγιΞηριαΚρυας.html";
                        } else if (rowData[index] === "Πάντα Βρέχει") {
                            link.href = "ΦαραγγιΠανταΒρεχει.html";
                        } else if (rowData[index] === "Σαμαριάς") {
                            link.href = "ΦαραγγιΣαμαριας.html";
                        } else if (rowData[index] === "Βίκου") {
                            link.href = "ΦαραγγιΒικου.html";
                        } else if (rowData[index] === "Νέδας") {
                            link.href = "ΦαραγγιΝεδας.html";
                        } else if (rowData[index] === "Αχέροντα") {
                            link.href = "ΦαραγγιΑχεροντα.html";
                        } else if (rowData[index] === "Βουραϊκού") {
                            link.href = "ΦαραγγιΒουραικου.html";
                        } else if (rowData[index] === "Ενιπέα") {
                            link.href = "ΦαραγγιΕνιπεα.html";
                        } else if (rowData[index] === "Χούνης") {
                            link.href = "ΦαραγγιΧουνης.html";
                        } else if (rowData[index] === "Κουδουμή") {
                            link.href = "ΦαραγγιΚουδουμη.html";
                        } else if (rowData[index] === "Γκούρας\u200B\u200B") {
                            link.href = "ΦαραγγιΓκουραςΙωαννινα.html";
                        } else if (rowData[index] === "Γκούρας (Τουθόα)") {
                            link.href = "ΦαραγγιΓκουραςΑρκαδια.html";
                        } else if (rowData[index] === "Γκούρας\u200B") {
                            link.href = "ΦαραγγιΓκουραςΑττικη.html";
                        } else if (rowData[index] === "Κουβαρά (Δολού)") {
                            link.href = "ΦαραγγιΚουβαραΔολου.html";
                        } else if (rowData[index] === "Πεκλαρίου (Μπούση)") {
                            link.href = "ΦαραγγιΠεκλαριουΜπουση.html";
                        } else if (rowData[index] === "Ζηλιάνας") {
                            link.href = "ΦαραγγιΖηλιανας.html";
                        } else if (rowData[index] === "Τυρολόγου (Σκαμνί)") {
                            link.href = "ΦαραγγιΤυρολογουΣκαμνι.html";
                        } else if (rowData[index] === "Δία") {
                            link.href = "ΦαραγγιΔια.html";
                        } else if (rowData[index] === "Κλέφτη") {
                            link.href = "ΦαραγγιΚλεφτη.html";
                        } else if (rowData[index] === "Αδράβαστης") {
                            link.href = "ΦαραγγιΑδραβαστης.html";
                        } else if (rowData[index] === "Μυλοπόταμου\u200B\u200B") {
                            link.href = "ΦαραγγιΜυλοποταμουΚυθηρα.html";
                        } else if (rowData[index] === "Κακιάς Λαγκάδας (Παλαιοχώρας)") {
                            link.href = "ΦαραγγιΚακιαςΛαγκαδας.html";
                        } else if (rowData[index] === "Περιστεριώνα\u200B\u200B") {
                            link.href = "ΦαραγγιΠεριστεριωναΚυθηρα.html";
                        } else if (rowData[index] === "Κακαβού (Κότσαλου)") {
                            link.href = "ΦαραγγιΚακαβουΚοτσαλου.html";
                        } else if (rowData[index] === "Μπουντρούμι (Δέσης)") {
                            link.href = "ΦαραγγιΜπουντρουμιΔεσης.html";
                        } else if (rowData[index] === "Μανικιάτη") {
                            link.href = "ΦαραγγιΜανικιατη.html";
                        } else if (rowData[index] === "Ζαστάνι") {
                            link.href = "ΦαραγγιΖαστανι.html";
                        }
                        

                


                      link.classList.add('searchResultLink');
                        td.appendChild(link);
                    } else {
                        td.textContent = rowData[index];
                    }

                    tr.appendChild(td);
                }

                // Add YouTube icon to the last cell
                const youtubeTd = document.createElement('td');
                youtubeTd.classList.add('searchResultCell'); // Add a class for styling purposes
                
                const youtubeIcon = document.createElement('img');
                youtubeIcon.src = 'youtube_icon.png'; // Ensure you have a YouTube icon image
                youtubeIcon.alt = 'YouTube';
                youtubeIcon.classList.add('youtubeIcon');
                youtubeIcon.onclick = function() {
                    window.open(`https://www.youtube.com/results?search_query=${encodeURIComponent('φαράγγι ' + rowData[1])}`, '_blank');                };

                youtubeTd.appendChild(youtubeIcon);
                tr.appendChild(youtubeTd);

                table.appendChild(tr);
            }
            
        });


        if (table.children.length > 0) {
            searchResults.appendChild(table);
        } else {
            searchResults.textContent = "Δεν βρέθηκαν αποτελέσματα.";
        }
    } else {
        searchResults.textContent = "Δεν βρέθηκαν αποτελέσματα.";
    }
    
    backToHomePage.style.display = 'block';
}



function convertToGreekLatin(str) {
    const conversionMap = {
        
        'a': 'α',
        'b': 'β',
        'c': 'κ',
        'd': 'δ',
        'e': 'ε',
        'f': 'φ',
        'g': 'γ',
        'h': 'η',
        'i': 'ι',
        'j': 'τζ',
        'k': 'κ',
        'l': 'λ',
        'm': 'μ',
        'n': 'ν',
        'o': 'ο',
        'p': 'π',
        'q': 'κ',
        'r': 'ρ',
        's': 'σ',
        't': 'τ',
        'u': 'υ',
        'v': 'β',
        'w': 'ω',
        'x': 'ξ',
        'y': 'ψ',
        'z': 'ζ',        
        'th': 'θ',
        'y': 'υ',
        'x': 'χ',

    };

    return str.replace(/[a-z]/g, char => conversionMap[char] || char);
}

function removeDiacritics(word) {
    return word.normalize("NFD").replace(/[\u0300-\u036f]/g, "").replace(/ά/g, 'α').replace(/έ/g, 'ε').replace(/ή/g, 'η').replace(/ί/g, 'ι').replace(/ό/g, 'ο').replace(/ύ/g, 'υ').replace(/ώ/g, 'ω');
}


document.addEventListener("DOMContentLoaded", function() {
    // Define the mapping of canyon names to their corresponding links
    const linkMap = {
        "Άγγιστρος": "ΦαραγγιΑγγιστρος.html",
   "Αγία Κόρη": "ΦαραγγιΑγιαΚορη.html",
    "Αγιάλης (Αγάλης)": "ΦαραγγιΑγιαλης.html",
    "Αγίου Νικολάου (Κουνουπίτσας, Πόζαρ)": "ΦαραγγιΑγιουΝικολαουΠοζαρ.html",
    "Άι Γιάννη": "ΦαραγγιΑιΓιαννηΠελλα.html",
    "Αμπελοχώρι": "ΦαραγγιΑμπελοχωρι.html",
    "Ανδρωνίου (Αντρωνίου)": "ΦαραγγιΑνδρωνιου.html",
    "Αρακλού": "ΦαραγγιΑρακλου.html",
    "Αραπλάκου (Αράπη)": "ΦαραγγιΑραπλακου.html",
    "Ασωπού": "ΦαραγγιΑσωπου.html",
    "Άχλα": "ΦαραγγιΑχλα.html",
    "Αώου": "ΦαραγγιΑωου.html",
    "Βαθύρεμα": "ΦαραγγιΒαθυρεμα.html",
    "Βάτου (Κούσιαντα)": "ΦαραγγιΒατου.html",
    "Βελβεντού (Λάφιστας, Σκεπασμένο, Εννέα Πιερίδων Μουσών)": "ΦαραγγιΒελβεντου.html",
    "Βικάκη": "ΦαραγγιΒικακη.html",
    "Βραδέτου": "ΦαραγγιΒραδετου.html",
    "Βυρού": "ΦαραγγιΒυρου.html",
    "Γερακίνας": "ΦαραγγιΓερακινας.html",
    "Γαλανόρεμα": "ΦαραγγιΓαλανορεμα.html",
    "Καζάνια": "ΦαραγγιΚαζανια.html",
    "Ίναχου": "ΦαραγγιΙναχου.html",
    "Κακόσκαλα": "ΦαραγγιΚακοσκαλα.html",
    "Καμαριώτη": "ΦαραγγιΚαμαριωτη.html",
    "Κήπων": "ΦαραγγιΚηπων.html",
    "Κεφαλαρίου": "ΦαραγγιΚεφαλαριου.html",
    "Κριθάρια": "ΦαραγγιΚριθαρια.html",
    "Κωσταλέξη": "ΦαραγγιΚωσταλεξη.html",
    "Μαρουσώς": "ΦαραγγιΜαρουσως.html",
    "Ντούνου": "ΦαραγγιΝτουνου.html",
    "Αλέστιας": "ΦαραγγιΑλεστιας.html",
    "Βαπτιστή": "ΦαραγγιΒαπτιστη.html",
    "Κακαβόρεμα": "ΦαραγγιΚακαβορεμα.html",
    "Σελίου": "ΦαραγγιΣελιου.html",
    "Φλασκιά": "ΦαραγγιΦλασκια.html",
    "Φλαμπουρίτσας": "ΦαραγγιΦλαμπουριτσας.html",
    "Διποτάματα": "ΦαραγγιΔιποταματα.html",
    "Σαντορινιού": "ΦαραγγιΣαντορινιου.html",
    "Εμπασάς (Αποτύπωσης)": "ΦαραγγιΕμπασας.html",
    "Σπηλιώτισσας Ρογδιάς (Ρέχτρας)": "ΦαραγγιΣπηλιωτισσαςΡεχτ.html",
    "Καβουσίου": "ΦαραγγιΚαβουσιου.html",
    "Περβολιανό": "ΦαραγγιΠερβολιανο.html",
    "Απολύχνου": "ΦαραγγιΑπολυχνου.html",
    "Γούλας": "ΦαραγγιΓουλας.html",
    "Ψωράρη": "ΦαραγγιΨωραρη.html",
    "Αργουλιδιά": "ΦαραγγιΑργουλιδια.html",
    "Δοξασμένος": "ΦαραγγιΔοξασμενος.html",
    "Αγίας Παρασκευής (Βουκολιάς)": "ΦαραγγιΑγιαςΠαρασκευηςΒουκολιας.html",
    "Μυλωνά (Άη Γιάννη)": "ΦαραγγιΜυλωναΑιγιαννη.html",
    "Ξερόκαμπου (Ξηρόκαμπου, Λαμνώνι)": "ΦαραγγιΞεροκαμπουΛαμνωνι.html",
    "Βοριζιανό": "ΦαραγγιΒοριζιανο.html",
    "Περβολακίων (Καψά)": "ΦαραγγιΠερβολακιωνΚαψα.html",
    "Κώστιανο (Αχελώου)": "ΦαραγγιΚωστιανο.html",
    "Ανακώλου": "ΦαραγγιΑνακωλου.html",
    "Μοκιστιάνου": "ΦαραγγιΜοκιστιανου.html",
    "Χάβος": "ΦαραγγιΧαβοςΕυβοια.html",
    "Χάβος (Προσηλίου)": "ΦαραγγιΧαβοςΠιερια.html",
    "Φορτόσι": "ΦαραγγιΦορτοσι.html",
    "Σαρίας (Έντη)": "ΦαραγγιΣαριας.html",
    "Ρακοπόταμου": "ΦαραγγιΡακοποταμου.html",
    "Προπύλη (Άνω Καρλίμπου)": "ΦαραγγιΠροπυληΚαρλιμπου.html",
    "Μακρυχώραφα": "ΦαραγγιΜακρυχωραφα.html",
    "Ζαρμπάνιτσας": "ΦαραγγιΖαρμπανιτσας.html",
    "Δημόσαρη": "ΦαραγγιΔημοσαρη.html",
    "Βόθωνα": "ΦαραγγιΒοθωνα.html",
    "Γερακάρη": "ΦαραγγιΓερακαρη.html",
    "Γοργοπόταμου": "ΦαραγγιΓοργοποταμου.html",
    "Γούμερου": "ΦαραγγιΓουμερου.html",
    "Γουρνόρεμα": "ΦαραγγιΓουρνορεμα.html",
    "Γριά Βάθρα": "ΦαραγγιΓριαΒαθρα.html",
    "Γυάλι": "ΦαραγγιΓυαλι.html",
    "Δέλφινο (Δελφινάκος)": "ΦαραγγιΔελφινο.html",
    "Δέος": "ΦαραγγιΔεος.html",
    "Καλυψώ": "ΦαραγγιΚαλυψω.html",
    "Καραγιαννάκη": "ΦαραγγιΚαραγιαννακη.html",
    "Καταφύκι (Μυγγυριστέα)": "ΦαραγγιΚαταφυκι.html",
    "Κεραμιδίου": "ΦαραγγιΚεραμιδιου.html",
    "Κόκκινα Πατερά": "ΦαραγγιΚοκκιναΠατερα.html",
    "Κόκκινο Ποτάμι": "ΦαραγγιΚοκκινοΠοταμι.html",
    "Κοροβέσου": "ΦαραγγιΚοροβεσου.html",
    "Κράστας": "ΦαραγγιΚραστας.html",
    "Λαγκαδιώτισσας (Λαγκαδά)": "ΦαραγγιΛαγκαδιωτισσας.html",
    "Τζένας": "ΦαραγγιΤζενας.html",
    "Λεπίδας": "ΦαραγγιΛεπιδας.html",
    "Λουκά": "ΦαραγγιΛουκα.html",
    "Λούλουγκα": "ΦαραγγιΛουλουγκα.html",
    "Μαζιάς": "ΦαραγγιΜαζιας.html",
    "Μαύρη Σπηλιά": "ΦαραγγιΜαυρηΣπηλια.html",
    "Μαυρομάτη": "ΦαραγγιΜαυροματη.html",
    "Μέγα Ρέμα": "ΦαραγγιΜεγαΡεμαΦθιωτιδα.html",
    "Μέγας Λάκκος": "ΦαραγγιΜεγαςΛακκος.html",
    "Μεζαριάς": "ΦαραγγιΜεζαριας.html",
    "Μεσορόπης": "ΦαραγγιΜεσοροπης.html",
    "Μέγα Ρέμα Μουζακίου": "ΦαραγγιΜεγαΡεμαΜουζακιου.html",
    "Μπασδέκη (Κλίφκης)": "ΦαραγγιΜπασδεκηΚλιφκης.html",
    "Μύλων\u200B": "ΦαραγγιΜυλωνΑττικη.html",
    "Ματσουκίου": "ΦαραγγιΜατσουκιου.html",
    "Λούσιου": "ΦαραγγιΛουσιου.html",
    "Μυλοπόταμου\u200B": "ΦαραγγιΜυλοποταμου.html",
    "Νεφέλης": "ΦαραγγιΝεφελης.html",
    "Νταμούχαρη": "ΦαραγγιΝταμουχαρη.html",
    "Ξετρυπητή": "ΦαραγγιΞετρυπητη.html",
    "Ξηροπόταμου": "ΦαραγγιΞηροποταμου.html",
    "Οινόης (Μαραθώνα)": "ΦαραγγιΟινοης.html",
    "Παλαιάς Βροντούς": "ΦαραγγιΠαλαιαςΒροντους.html",
    "Παπά-Ρέμα": "ΦαραγγιΠαπαΡεμα.html",
    "Περιστεριώνα\u200B": "ΦαραγγιΠεριστεριωνα.html",
    "Πλατανάκι (Δεκατιάς)": "ΦαραγγιΠλατανακι.html",
    "Πύλη Παραδείσου (Καρλίμπου)": "ΦαραγγιΠυληΠαραδεισου.html",
    "Πύργων (Πετρούσας)": "ΦαραγγιΠυργωνΠετρουσας.html",
    "Ροδοκάλου": "ΦαραγγιΡοδοκαλου.html",
    "Σερβίων (Χούνη)": "ΦαραγγιΣερβιων.html",
    "Σεργούλας (Σεργουλοπόταμου)": "ΦαραγγιΣεργουλοποταμος.html",
    "Στριφτό": "ΦαραγγιΣτριφτο.html",
    "Τοίχου": "ΦαραγγιΤοιχου.html",
    "Σελινούντα (Τρανό Λαγκάδι)": "ΦαραγγιΣελινουντα.html",
    "Τσιβδογιάννη": "ΦαραγγιΤσιβδογιαννη.html",
    "Σαρακίνας (Σαρακηνό, Σαραντάπηχου)": "ΦαραγγιΣαρακηνας.html",
    "Πρασσανό": "ΦαραγγιΠρασσανο.html",
    "Στενό Αθαμανίας (Μουτσιαρίτη)": "ΦαραγγιΣτενοΑθαμανιας.html",
    "Σπίνας (Κανδάνου, Καντάνου)": "ΦαραγγιΣπιναςΚανδανου.html",
    "Μύλων\u200B\u200B": "ΦαραγγιΜυλωνΡεθυμνου.html",
    "Μάνας": "ΦαραγγιΜανας.html",
    "Αγίου Αντωνίου": "ΦαραγγιΑγιουΑντωνιουΗρακλειο.html",
    "Κοτσυφού": "ΦαραγγιΚοτσυφουΡεθυμνο.html",
    "Ρόκκας (Ρόκας)": "ΦαραγγιΡοκας.html",
    "Τραχινού": "ΦαραγγιΤραχινου.html",
    "Βαβουλέδω": "ΦαραγγιΒαβουλεδω.html",
    "Σμιλιανό (Καλαμαύκα)": "ΦαραγγιΣμιλιανοΚαλαμαυκα.html",
    "Ζάκρου (Νεκρών)": "ΦαραγγιΖακρουΝεκρων.html",
    "Τσούτσουρου (Τσούτσουρα)": "ΦαραγγιΤσουτσουρου.html",
    "Άρβης": "ΦαραγγιΑρβης.html",
    "Σηρικαρίου (Σηρικαριανό, Πολυρρήνιας)": "ΦαραγγιΣηρικαριανο.html",
    "Κλεισούρας\u200B": "ΦαραγγιΚλεισουρας.html",
    "Σφακιανό (Βαρθολομά, Λαγκό)": "ΦαραγγιΣφακιανο.html",
    "Ασφένδου": "ΦαραγγιΑσφενδου.html",
    "Ίμπρου (Νίμπρου)": "ΦαραγγιΙμπρου.html",
    "Κρύας Βρύσης": "ΦαραγγιΚρυαςΒρυσης.html",
    "Πορτίτσας": "ΦαραγγιΠορτιτσας.html",
    "Σκάλας\u200B": "ΦαραγγιΣκαλας.html",
    "Τιμίου Προδρόμου": "ΦαραγγιΤιμιουΠροδρομου.html",
    "Ρίχτη": "ΦαραγγιΡιχτη.html",
    "Λάρνακα": "ΦαραγγιΛαρνακα.html",
    "Χαυγά Οροπεδίου": "ΦαραγγιΧαυγαΟροπεδιου.html",
    "Κυδώνι": "ΦαραγγιΚυδωνι.html",
    "Θερίσσου (Ελευθερίου Βενιζέλου)": "ΦαραγγιΘερισσου.html",
    "Αγίας Ειρήνης": "ΦαραγγιΑγιαςΕιρηνηςΧανια.html",
    "Ορεινού (Πεταλούδων, Κόκκινων Πεταλούδων)": "ΦαραγγιΟρεινουΠεταλουδων.html",
    "Χα": "ΦαραγγιΤουΧα.html",
    "Αράδαινας": "ΦαραγγιΑραδαινας.html",
    "Καλλικράτη": "ΦαραγγιΚαλλικρατη.html",
    "Δικτάμου": "ΦαραγγιΔικταμου.html",
    "Κλάδου": "ΦαραγγιΚλαδου.html",
    "Αποσελέμη": "ΦαραγγιΑποσελεμη.html",
    "Μποριανών": "ΦαραγγιΜποριανων.html",
    "Τοπολίων": "ΦαραγγιΤοπολιων.html",
    "Μεσαυλίων - Δελιανών": "ΦαραγγιΜεσαυλιωνΔελιανων.html",
    "Αλμυρού": "ΦαραγγιΑλμυρου.html",
    "Αυλάκι (Καθολικού)": "ΦαραγγιΑυλακιΚαθολικου.html",
    "Καμπιών": "ΦαραγγιΚαμπιων.html",
    "Κυκλάμινου (Αη Γιωργίτικο, Βαντέ)": "ΦαραγγιΚυκλαμινουΑιγιωργιτικο.html",
    "Τρομάρισσας": "ΦαραγγιΤρομαρισσας.html",
    "Λισσού": "ΦαραγγιΛισσου.html",
    "Ανύδρων": "ΦαραγγιΑνυνδρων.html",
    "Τρυπητής": "ΦαραγγιΤρυπητηςΧανια.html",
    "Ίλιγκα (Καβή)": "ΦαραγγιΙλιγγαΚαβη.html",
    "Πελεκάνου (Πελεκανιώτη)": "ΦαραγγιΠελεκανουΠελεκανιωτη.html",
    "Λαγγός Ζούρβας (Λαγκός)": "ΦαραγγιΛαγγοςΖουρβας.html",
    "Σκαλωτής": "ΦαραγγιΣκαλωτης.html",
    "Περδικάρη": "ΦαραγγιΠερδικαρη.html",
    "Μαγγανίστρας": "ΦαραγγιΜαγγανιστρας.html",
    "Λύχνου Λάκκοι": "ΦαραγγιΛυχνουΛακκοι.html",
    "Κερατίδας": "ΦαραγγιΚερατιδας.html",
    "Κάμπου": "ΦαραγγιΚαμπουΧανια.html",
    "Ρέχτας": "ΦαραγγιΡεχταςΧανια.html",
    "Καλαμπούκι": "ΦαραγγιΚαλαμπουκι.html",
    "Κολιακουδέ": "ΦαραγγιΚολιακουδε.html",
    "Διμπλοχάχαλο": "ΦαραγγιΔιπλοχαχαλο.html",
    "Πρασσέ (Ασκιδιανό)": "ΦαραγγιΠρασσεΑσκιδιανο.html",
    "Κατσούνας": "ΦαραγγιΚατσουνας.html",
    "Φυγούς": "ΦαραγγιΦυγους.html",
    "Χαλασέ (Ποροφάραγγο, Σάσαλος)": "ΦαραγγιΧαλασεΣασαλος.html",
    "Κάπνης": "ΦαραγγιΚαπνης.html",
    "Ποταμού": "ΦαραγγιΠοταμου.html",
    "Φρατιανό": "ΦαραγγιΦρατιανο.html",
    "Πετρέ": "ΦαραγγιΠετρε.html",
    "Γάλλου (Γαλλιανό)": "ΦαραγγιΓαλλουΓαλλιανο.html",
    "Μαργαριτών (Μαργαριτσανό)": "ΦαραγγιΜαργαριτων.html",
    "Μέσα (Πλατύ Ποταμού)": "ΦαραγγιΜεσαΠλατυΠοταμου.html",
    "Χελιδονιών": "ΦαραγγιΧελιδονιων.html",
    "Πατσού (Αγίου Αντωνίου)": "ΦαραγγιΠατσουΑγιουΑντωνιου.html",
    "Ροδάκινο (Μαγλινάρα)": "ΦαραγγιΡοδακινο.html",
    "Καρινιώτικο": "ΦαραγγιΚαρινιωτικο.html",
    "Κισσανό": "ΦαραγγιΚισσανο.html",
    "Κυνηγόσπηλιος": "ΦαραγγιΚυνηγοσπηλιος.html",
    "Συκιάς (Ξεπυτήρας)": "ΦαραγγιΣυκιαςΞεπυτηρας.html",
    "Καμινόλακκος": "ΦαραγγιΚαμινολακκος.html",
    "Κριτσάς (Χαυγάς)": "ΦαραγγιΚριτσαςΧαυγας.html",
    "Χοχλακιών (Καρουμών)": "ΦαραγγιΧοχλακιωνΚαρουμων.html",
    "Τρούλλας (Τσουτσουράκι)": "ΦαραγγιΤρουλλαςΤσουτσουρακι.html",
    "Μεσοσφήνι": "ΦαραγγιΜεσοσφηνι.html",
    "Αναποδάρη (Σκινοφάραγγο)": "ΦαραγγιΑναποδαρη.html",
    "Βορνό (Εθιάς, Εθιανό)": "ΦαραγγιΒορνοΕθιας.html",
    "Πρινιά (Λαγούτα)": "ΦαραγγιΠρινιαΛαγουτα.html",
    "Πετριγιάρι": "ΦαραγγιΠετριγιαρι.html",
    "Κακοπέρατος": "ΦαραγγιΚακοπερατοςΚρητη.html",
    "Ριζόπετρο": "ΦαραγγιΡιζοπετρο.html",
    "Παστρικού": "ΦαραγγιΠαστρικου.html",
    "Αχλιών": "ΦαραγγιΑχλιων.html",
    "Χαυγάς Καλαμαύκας": "ΦαραγγιΚαλαμαυκας.html",
    "Πεύκων (Ανεγυρούς)": "ΦαραγγιΠευκωνΑνεγυρους.html",
    "Κουδουμά (Κόφινα)": "ΦαραγγιΚουδουμαΚοφινα.html",
    "Ποροφάραγγο Κάτω Βάθειας (Σφακορύακο)": "ΦαραγγιΠοροφαραγγοΚατωΒαθειαςΣφακορυακο.html",
    "Εργάνου": "ΦαραγγιΕργανου.html",
    "Έλιγκα": "ΦαραγγιΕλιγκα.html",
    "Αμπέλου": "ΦαραγγιΑμπελουΗρακλειο.html",
    "Γωνιανό": "ΦαραγγιΓωνιανιΗρακλειο.html",
    "Ψαρό Νερό": "ΦαραγγιΨαροΝερο.html",
    "Μέσωνα (Μέσονα)": "ΦαραγγιΜεσωνα.html",
    "Αγίων Πάντων": "ΦαραγγιΑγιωνΠαντωνΚρητη.html",
    "Βεδέρων": "ΦαραγγιΒεδερων.html",
    "Αμπά": "ΦαραγγιΑμπα.html",
    "Πορτέλα": "ΦαραγγιΠορτελα.html",
    "Χάβου": "ΦαραγγιΧαβουΚορινθια.html",
    "Πλησόρεμα": "ΦαραγγιΠλησορεμα.html",
    "Κλειβωκάς (Λάδωνα)": "ΦαραγγιΚλειβωκας.html",
    "Αρκαδίου (Αρκαδιώτικο)": "ΦαραγγιΑρκαδιουΑρκαδιωτικο.html",
    "Καρανταλέ (Καρανταλιώτικο)": "ΦαραγγιΚαρανταλεΚαρανταλιωτικο.html",
    "Αγίων Αποστόλων (Λάπαθος)": "ΦαραγγιΑγιωνΑποστολωνΛαπαθος.html",
    "Απιδιανό (Γούδουρα, Αγίου Αντωνίου)": "ΦαραγγιΑπιδιανοΓουδουρα.html",
    "Χαράδρου": "ΦαραγγιΧαραδρου.html",
    "Κουμαριάς (Κρύας Βρύσης)": "ΦαραγγιΚουμαριαςΚρυαςΒρυσης.html",
    "Σκάλας\u200B\u200B": "ΦαραγγιΣκαλαςΓρεβενων.html",
    "Αγίας Ειρήνης Σητείας": "ΦαραγγιΑγιαςΕιρηνηςΣητειας.html",
    "Χαυγάς (Πλάκα)": "ΦαραγγιΧαυγαςΠλακα.html",
    "Φτερόρεμμα": "ΦαραγγιΦτερορεμα.html",
    "Κερεντάν": "ΦαραγγιΚερενταν.html",
    "Φάγγου": "ΦαραγγιΦαγγου.html",
    "Κλεισούρας\u200B\u200B": "ΦαραγγιΚλεισουραςΒοιωτια.html",
    "Σαρακίνας Μεσκλών": "ΦαραγγιΣαρακιναςΜεσκλων.html",
    "Τιθορέας (Κάχαλα, Βελίτσας)": "ΦαραγγιΤιθορεαςΚαχαλαΒελιτσας.html",
    "Ράμνο Μπορ": "ΦαραγγιΡαμνοΜπορ.html",
    "Τσιγγενόρεμα": "ΦαραγγιΤσιγγενορεμα.html",
    "Φακίστρας": "ΦαραγγιΦακιστρας.html",
    "Φονιά": "ΦαραγγιΦονιαΣαμοθρακη.html",
    "Κενταύρων": "ΦαραγγιΚενταυρων.html",
    "Κούμος": "ΦαραγγιΚουμος.html",
    "Ρίντομου (Κοσκάρακας)": "ΦαραγγιΡιντομου.html",
    "Φονέα (Νούπαντης)": "ΦαραγγιΦονεαΝουπαντης.html",
    "Βρυσιωτικού (Μύλων, Κάστορα, Κάρδαρη)": "ΦαραγγιΒρυσιωτικουΜυλωνΚαστοραΚαραδαρη.html",
    "Κουρταλιώτικο (Κουρταλιώτη)": "ΦαραγγιΚουρταλιωτη.html",
    "Μπουλοβίναινας (Νηλέα, Αράπη)": "ΦαραγγιΜπουλοβιναιναςΝηλεα.html",
    "Ελυγιάς": "ΦαραγγιΕλυγιας.html",
    "Αγίας Φωτιάς": "ΦαραγγιΑγιαςΦωτιαςΡεθυμνο.html",
    "Πλατανίων": "ΦαραγγιΠλατανιωνΡεθυμνο.html",
    "Μούνδρου (Μουνδριανό, Βελονάδο)": "ΦαραγγιΜουνδριανοΜουνδρου.html",
    "Βιλανδρέδο (Κολλητά, Κάτω Πόρου)": "ΦαραγγιΒιλαδενδροΚολλητα.html",
    "Ζωνιανών": "ΦαραγγιΖωνιανων.html",
    "Παναγιάς (Καλάμι Ι)": "ΦαραγγιΠαναγιαςΚαλαμι.html",
    "Ξεροφάραγγο (Καλάμι II)": "ΦαραγγιΞεροφαραγγοΚαλαμι.html",
    "Φλάμπουρου": "ΦαραγγιΦλαμπουρουΓερανεια.html",
    "Ρούβα (Ζαρού, Γάφαρη, Αγίου Νικολάου)": "ΦαραγγιΡουβαΖαρουΓαφαρη.html",
    "Κακοπέρατου": "ΦαραγγιΚακοπερατουΣαμος.html",
    "Αστρακιανό (Καρτερού)": "ΦαραγγιΑστρακιανο.html",
    "Κουναβιανό": "ΦαραγγιΚουναβιανο.html",
    "Αγιοφάραγγο": "ΦαραγγιΑγιοφαραγγο.html",
    "Κρουσώνα (Γαϊδουροράχης)": "ΦαραγγιΚρουσωνα.html",
    "Αγίου Χαραλάμπου": "ΦαραγγιΑγιουΧαραλαμπουΗρακλειο.html",
    "Αρχανιώτικο (Κνωσανό, Αγίας Ειρήνης)": "ΦαραγγιΑρχανιωτικοΚνωσανο.html",
    "Τρυπητής (Αγίου Σάββα)": "ΦαραγγιΤρυπητηςΗρακλειο.html",
    "Καμαρών (Καμαραϊκό)": "ΦαραγγιΚαμαρωνΚαραμαικο.html",
    "Μίντρη": "ΦαραγγιΜιντρη.html",
    "Ασπρορέματος": "ΦαραγγιΑσπρορεματος.html",
    "Αγίας Αναστασίας": "ΦαραγγιΑγιαςΑναστασιαςΗρακλειου.html",
    "Μαρτσαλιώτικο": "ΦαραγγιΜαρτσαλιωτικο.html",
    "Σπηλιώτισσας Χουδετσίου": "ΦαραγγιΣπηλιωτισσαςΧουδετσιου.html",
    "Βενεράτου": "ΦαραγγιΒενερατου.html",
    "Τράφουλα (Τράχουλα)": "ΦαραγγιΤραφουλα.html",
    "Ρόζας": "ΦαραγγιΡοζαςΗρακλειο.html",
    "Πετάλης (Κερασιάς)": "ΦαραγγιΠεταληςΚερασιας.html",
    "Μαριδακίου (Λιχνιστής)": "ΦαραγγιΜαριδακιουΛιχνιστης.html",
    "Αχεντριανό (Λιγιοφάρραγο)": "ΦαραγγιΑχεντριανοΛιγγιοφαραγγο.html",
    "Τσιγκούνη": "ΦαραγγιΤσιγγουνη.html",
    "Μπουζουνίκου": "ΦαραγγιΜπουζουνικου.html",
    "Στροπώνων": "ΦαραγγιΣτροπωνων.html",
    "Κακόρεμα\u200B": "ΦαραγγιΚακορεμαΜαγνησιας.html",
    "Ελυγιάς (Βαλαχά)": "ΦαραγγιΕλυγιαςΒαλαχα.html",
    "Κλειδωνιάς (Βοϊδομάτη)": "ΦαραγγιΚλειδωνιαςΒοιδοματη.html",
    "Χρούσια (Σταυραετού, Μπόζια)": "ΦαραγγιΧρουσιαΣταυραετου.html",
    "Αλιμάχης": "ΦαραγγιΑλιμαχης.html",
    "Παπαπήδημα (Αράχθου)": "ΦαραγγιΠαπαπηδημαΑραχθου.html",
    "Κακόρεμα\u200B\u200B": "ΦαραγγιΚακορεμαΑττικης.html",
    "Αγγίτη": "ΦαραγγιΑγγιτηΣερρες.html",
    "Τσανάρκας (Γαλανά νερά)": "ΦαραγγιΤσαναρκαςΓαλαναΝερα.html",
    "Αγίου Δημητρίου": "ΦαραγγιΑγιουΔημητριουΕυβοιας.html",
    "Θηριόπετρας": "ΦαραγγιΘηριοπετρας.html",
    "Στραβοπόταμου": "ΦαραγγιΣτραβοποταμου.html",
    "Καλλιθέας (Αγίου Λουκά)": "ΦαραγγιΑγιουΛουκαΚαλλιθεας.html",
    "Φόνισσας": "ΦαραγγιΦονισσαςΚορινθια.html",
    "Τσάκωνα": "ΦαραγγιΤσακωναΚυθηρα.html",
    "Τόρνου (Χαλικόρεμα, Μικρό Πάντα Βρέχει)": "ΦαραγγιΤορνουΧαλικορεμα.html",
    "Χαλορέματος (Αφετών)": "ΦαραγγιΧαλορεματοςΑφετων.html",
    "Ορλιά": "ΦαραγγιΟρλια.html",
    "Ρεκάς": "ΦαραγγιΡεκας.html",
    "Ξηριά Κρύας (Έρκυνας)": "ΦαραγγιΞηριαΚρυας.html",
    "Πάντα Βρέχει": "ΦαραγγιΠανταΒρεχει.html",
    "Σαμαριάς": "ΦαραγγιΣαμαριας.html",
    "Βίκου": "ΦαραγγιΒικου.html",
    "Νέδας": "ΦαραγγιΝεδας.html",
    "Αχέροντα": "ΦαραγγιΑχεροντα.html",
    "Βουραϊκού": "ΦαραγγιΒουραικου.html",
    "Ενιπέα": "ΦαραγγιΕνιπεα.html",
    "Χούνης": "ΦαραγγιΧουνης.html",
    "Κουδουμή": "ΦαραγγιΚουδουμη.html",
    "Γκούρας\u200B\u200B": "ΦαραγγιΓκουραςΙωαννινα.html", 
    "Γκούρας\u200B": "ΦαραγγιΓκουραςΑττικη.html",
    "Γκούρας (Τουθόα)": "ΦαραγγιΓκουραςΑρκαδια.html",
    "Κουβαρά (Δολού)": "ΦαραγγιΚουβαραΔολου.html",
    "Πεκλαρίου (Μπούση)": "ΦαραγγιΠεκλαριουΜπουση.html",
    "Ζηλιάνας": "ΦαραγγιΖηλιανας.html",
    "Τυρολόγου (Σκαμνί)": "ΦαραγγιΤυρολογουΣκαμνι.html",
    "Δία": "ΦαραγγιΔια.html",
    "Κλέφτη": "ΦαραγγιΚλεφτη.html",
    "Αδράβαστης": "ΦαραγγιΑδραβαστης.html",
    "Μυλοπόταμου\u200B\u200B": "ΦαραγγιΜυλοποταμουΚυθηρα.html",
    "Κακιάς Λαγκάδας (Παλαιοχώρας)": "ΦαραγγιΚακιαςΛαγκαδας.html",
    "Περιστεριώνα\u200B\u200B": "ΦαραγγιΠεριστεριωναΚυθηρα.html",
    "Κακαβού (Κότσαλου)": "ΦαραγγιΚακαβουΚοτσαλου.html",
    "Μπουντρούμι (Δέσης)": "ΦαραγγιΜπουντρουμιΔεσης.html"
        
    };

    // Get all the rows in the table body
    const tableRows = document.querySelectorAll("#table-body-canyons tr");

    // Iterate through each row
    tableRows.forEach(row => {
        const nameCell = row.cells[1]; // Get the second column (name cell)
        const canyonName = nameCell.textContent.trim(); // Get the name of the canyon from the cell

        // If the canyon name exists in the linkMap, attach the corresponding link
        if (linkMap[canyonName]) {
            const link = document.createElement("a"); // Create an anchor element
            link.textContent = canyonName; // Set the text content of the link
            link.href = linkMap[canyonName]; // Set the href of the link from the linkMap
            nameCell.textContent = ''; // Clear the existing text in the cell
            nameCell.appendChild(link); // Append the link to the cell
        }
    });
});



